pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// bl602_demo_wifi_text_0004.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 23040340: void netif_init()
// Called from:
//      lwip_init
void netif_init()
{
}

// 23040342: Register word32 netif_set_ipaddr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      set_if
word32 netif_set_ipaddr(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		s2Out = s2;
		return s0;
	}
	else
	{
		word32 s0_42;
		Eq_2 s1_43;
		Eq_2 s2_46;
		word32 a1_155;
		word32 a3_156;
		word32 a4_157;
		word32 a5_158;
		word32 s3_159;
		word32 s4_160;
		word32 s5_161;
		word32 s6_162;
		word32 s7_163;
		word32 mstatus_164;
		netif_do_set_ipaddr(ra, s1, fp + ~0x13, a3, a4, a5, s2, s3, s4, s7, mstatus, dwLoc1C, dwLoc18, dwLoc08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg54, dwArg58, dwArg68, dwArg70, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArg0148, out s0_42, out s1_43, out a1_155, out a3_156, out a4_157, out a5_158, out s2_46, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out mstatus_164);
		s1Out = s1_43;
		s2Out = s2_46;
		return s0_42;
	}
}

// 23040360: void netif_set_netmask(Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_206169) a4, Register (ptr32 Eq_206169) a5)
// Called from:
//      set_if
void netif_set_netmask(Eq_2 a0, ptr32 a1, struct Eq_206169 * a4, struct Eq_206169 * a5)
{
	if (a0 != 0x00)
	{
		word32 a0_14 = a4->dw0008;
		if (a5 != a4)
			a5->dw0008 = a0_14;
	}
}

// 23040378: void netif_set_gw(Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_206185) a4, Register (ptr32 Eq_206185) a5)
// Called from:
//      set_if
void netif_set_gw(Eq_2 a0, ptr32 a1, struct Eq_206185 * a4, struct Eq_206185 * a5)
{
	if (a0 != 0x00)
	{
		word32 a0_14 = a4->dw000C;
		if (a5 != a4)
			a5->dw000C = a0_14;
	}
}

// 23040390: Register Eq_2 netif_set_addr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_186193) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_186262) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_186193) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netifapi_do_netif_set_addr
//      dhcp_bind
//      dhcp_recv
//      dhcp_stop
//      netif_add
Eq_2 netif_set_addr(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_186193 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArg0128, Eq_2 dwArg0138, struct Eq_186262 & s0Out, union Eq_2 & s1Out, struct Eq_186193 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s2_104 = a2;
	if (a2 == 0x00)
		s2_104.u0 = 587783820;
	if (a3 == 0x00)
		a3.u0 = 587783820;
	Eq_2 a5_102;
	Eq_2 ra_136;
	if (a5 != 0x00)
	{
		a5_102.u0 = 0x00;
		ra_136 = ra;
	}
	else
	{
		word32 a3_517;
		word32 a5_519;
		word32 s0_515;
		word32 a4_518;
		word32 s1_516;
		ra_136 = netif_do_set_ipaddr(ra, a0, fp + -20, a3, a4, a5, s2_104, s3, s4, s7, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArg0138, out s0_515, out s1_516, out a1, out a3_517, out a4_518, out a5_519, out s2_104, out s3, out s4, out s5, out s6, out s7, out mstatus);
		a2 = dwArg74;
		a5_102.u0 = 0x01;
	}
	Eq_2 a4_106 = *s2_104.u0;
	word32 s1_111 = *((word32) a2 + 8);
	if (a4_106 != a2)
		*((word32) a4_106 + 8) = s1_111;
	Eq_2 a3_115 = *a4_106;
	Eq_2 s1_116 = *((word32) a3_115 + 0x0C);
	if (a4_106 != a3_115)
		*((word32) a4_106 + 0x0C) = s1_116;
	if (a5_102 == 0x00)
	{
		word32 s0_520;
		ra_136 = netif_do_set_ipaddr(ra_136, s1_116, fp + -20, a3_115, a4_106, a5_102, s2_104, s3, s4, s7, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArg0138, out s0_520, out s1_116, out a1, out a3_115, out a4_106, out a5_102, out s2_104, out s3, out s4, out s5, out s6, out s7, out mstatus);
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_116;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3_115;
	a4Out = a4_106;
	a5Out = a5_102;
	s2Out = s2_104;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra_136;
}

// 23040406: Register Eq_2 netif_add(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_186130) a1, Register word32 a2, Register word32 a3, Register word32 a5, Register int32 a6, Register word32 s4, Register word32 s7, Register word32 mstatus, Stack word32 dwArg14, Stack word32 dwArg18, Stack word32 dwArg28, Stack word32 dwArg38, Stack word32 dwArg3C, Stack word32 dwArg44, Stack word32 dwArg48, Stack word32 dwArg58, Stack word32 dwArg68, Stack word32 dwArg74, Stack word32 dwArg88, Stack word32 dwArgB4, Stack word32 dwArgF8, Stack word32 dwArg0108, Stack word32 dwArg0128)
// Called from:
//      netifapi_do_netif_add
Eq_2 netif_add(Eq_2 ra, Eq_2 a0, struct Eq_186130 * a1, word32 a2, word32 a3, word32 a5, int32 a6, word32 s4, word32 s7, word32 mstatus, word32 dwArg14, word32 dwArg18, word32 dwArg28, word32 dwArg38, word32 dwArg3C, word32 dwArg44, word32 dwArg48, word32 dwArg58, word32 dwArg68, word32 dwArg74, word32 dwArg88, word32 dwArgB4, word32 dwArgF8, word32 dwArg0108, word32 dwArg0128)
{
	Eq_2 s0_148;
	if (a0 != 0x00 && a5 != 0x00)
	{
		struct Eq_186130 * s1_18 = a1;
		word32 s2_20 = a2;
		if (a1 == null)
			s1_18 = (struct Eq_186130 *) &g_t2308DE8C;
		if (a2 == 0x00)
			s2_20 = 587783820;
		g_t230402AA = a0;
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 8) = 0x00;
		*((word32) a0 + 0x0C) = 0x00;
		((word32) a0 + 56)->u0 = 0x00;
		((word32) a0 + 65)->u1 = 0x00;
		word32 a3_70;
		struct Eq_206328 * a4_71;
		word32 a5_72;
		word32 t1_514;
		word32 a0_515;
		word32 a2_517;
		word32 a1_516;
		Eq_2 ra_73 = memset(ra, (word32) a0 + 40, 0x00, 0x0C, out t1_514, out a0_515, out a1_516, out a2_517, out a3_70, out a4_71, out a5_72);
		a4_71->t0024 = a0;
		word32 a4_80 = (word32) g_b4200DF78;
		0x00 = dwArg74;
		*((word32) a0 + 16) = a6;
		*((word32) a0 + 0x0044) = (byte) a4_80;
		*((word32) a0 + 28) = 0x00;
		((word32) a0 + 32)->u0 = 0x00;
		((word32) a0 + 72)->u0 = 0x00;
		word32 a1_107;
		word32 a2_108;
		word32 a3_109;
		word32 a4_110;
		<anonymous> * a5_111;
		word32 mstatus_114;
		word32 s1_117;
		word32 s3_121;
		word32 s4_122;
		word32 s7_125;
		word32 a0_138;
		ptr32 mstatus_146;
		word32 ra_147;
		byte * s3_153;
		a5_111();
		if (a0_138 == 0x00)
		{
			Eq_2 a2_168 = g_t4201FD90;
l230404C8:
			if ((word32) *((word16) s0_148.u0 + 0x0044) == 0x00FF)
				((word16) s0_148.u0 + 0x0044)->u1 = 0x00;
			int32 a5_178 = (word32) *((word16) s0_148.u0 + 0x0044);
			Eq_2 a3_181 = a2_168;
			while (a3_181 != 0x00)
			{
				if ((word32) *((word32) a3_181 + 0x0044) == a5_178)
				{
					*((word16) s0_148.u0 + 0x0044) = (byte) (a5_178 + 0x01);
					goto l230404C8;
				}
				a3_181 = *a3_181;
			}
			Eq_2 a3_191 = 0x00;
			if (a5_178 != 0x00FE)
				a3_191 = a5_178 + 0x01 & 0x00FF;
			ui32 a5_196 = (word32) *((word16) s0_148.u0 + 65);
			*a2_168 = s0_148;
			*s3_153 = (byte) a3_191;
			*(union Eq_2 *) 0x42020D90 = s0_148;
			if ((a5_196 & 32) != 0x00)
				igmp_start(ra_147, s0_148, a3_191, 0x42020000, a5_196 & 32, mstatus_146, dwLoc08);
l23040416:
			0x00 = dwArg0128;
			return s0_148;
		}
	}
	s0_148.u0 = 0x00;
	goto l23040416;
}

// 2304051C: void netif_set_default(Register word32 a0)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
void netif_set_default(word32 a0)
{
	*(word32 *) 0x42020D8C = a0;
}

