pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230406B4: Register Eq_2 netif_find(Register Eq_2 a0, Register out (ptr32 Eq_187675) a4Out, Register out (ptr32 Eq_187676) a5Out)
// Called from:
//      lwip_setsockopt_callback
Eq_2 netif_find(Eq_2 a0, struct Eq_187675 & a4Out, struct Eq_187676 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a5_136;
		word32 a2_133;
		word32 a3_134;
		word32 a4_135;
		word32 a1_132;
		Eq_2 a0_11 = atoi((word32) a0 + 2, out a1_132, out a2_133, out a3_134, out a4_135, out a5_136);
		struct Eq_187675 * a4_26 = &g_t42020000;
		Eq_2 a0_28 = g_t4201FD90;
		while (a0_28 != 0x00)
		{
			a4_26 = (word32) *((word32) a0_28 + 0x0044);
			if (a4_26 == (a0_11 & 0x00FF))
			{
				a4_26 = (word32) *((word16) a0_28.u0 + 66);
				if ((word32) *a0 == a4_26)
				{
					a4_26 = (word32) *((word16) a0_28.u0 + 67);
					if ((word32) *((word32) a0 + 1) == a4_26)
						goto l230406D8;
				}
			}
			a0_28 = *a0_28.u0;
		}
		a0_28.u0 = 0x00;
l230406D8:
		a4Out = a4_26;
		a5Out = a0_11 & 0x00FF;
		return a0_28;
	}
	else
	{
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
}

// 23040704: void pbuf_skip_const(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 word16) a2)
// Called from:
//      pbuf_take_at
//      pbuf_try_get_at
//      pbuf_put_at
void pbuf_skip_const(Eq_2 a0, Eq_2 a1, word16 * a2)
{
	while (a0 != 0x00)
	{
		Eq_2 a5_5 = (word32) *((word32) a0 + 0x0A);
		if (a1 < a5_5)
			break;
		a1 = (word32) (word16) (a1 - a5_5);
		a0 = *a0;
	}
	if (a2 != null)
		*a2 = (word16) a1;
}

// 23040720: void pbuf_free_ooseq_callback(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgE8)
void pbuf_free_ooseq_callback(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgE8)
{
	word32 a5_66;
	word32 a4_65;
	word32 a2_64;
	sys_arch_protect(a4, mstatus, out a2_64, out a4_65, out a5_66);
	*(byte *) 0x42020D94 = 0x00;
	Eq_2 a4_16;
	word32 a5_67;
	Eq_2 a3_15 = sys_arch_unprotect(a3, mstatus, out a4_16, out a5_67);
	Eq_2 a0_19 = g_t4201FEAC;
	while (a0_19 != 0x00)
	{
		struct Eq_206963 * a0_23 = g_ptr42020074;
		if (true)
		{
			word32 a0_68;
			word32 a2_69;
			word32 a3_70;
			word32 a4_71;
			tcp_free_ooseq(ra, a3_15, a4_16, 0x42020000, s4, mstatus, dwArgE8, out a0_68, out a2_69, out a3_70, out a4_71);
			return;
		}
		a0_19 = a0_23->t000C;
	}
}

// 23040754: Register Eq_2 pbuf_add_header_impl(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_206997) a2, Register out Eq_2 a1Out, Register out (ptr32 Eq_206997) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      pbuf_add_header
//      pbuf_header
//      pbuf_header_force
Eq_2 pbuf_add_header_impl(Eq_2 a0, Eq_2 a1, struct Eq_206997 * a2, union Eq_2 & a1Out, struct Eq_206997 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_17;
	if (a0 != 0x00)
	{
		a4 = 0x10000000;
		a0_17.u0 = 0x01;
		if (a1 < 0x10000000)
		{
			a0_17.u0 = 0x00;
			if (a1 != 0x00)
			{
				a3 = (word32) (word16) a1;
				a4 = (word32) (word16) ((word32) *((word32) a0 + 8) + a3);
				a0_17.u0 = 0x01;
				if (a4 >= a3)
				{
					Eq_2 a1_22;
					Eq_2 a5_21;
					if ((int32) *((word32) a0 + 0x0C) < 0x00)
					{
						a5_21 = a2->t0004;
						a1_22 = a2 - a1;
						if (a1_22 < (word32) a5_21 + 16)
						{
							a1Out = a1_22;
							a2Out = (word32) a5_21 + 16;
							a3Out = a3;
							a4Out = a4;
							a5Out = a5_21;
							return 0x01;
						}
						goto l2304079E;
					}
					a0_17.u0 = 0x01;
					if (a2 != null)
					{
						a5_21 = a2->t0004;
						a1_22 = a2 - a1;
l2304079E:
						struct Eq_206997 * a2_29 = (word32) *((word32) a5_21 + 0x0A);
						*((word32) a1_22 + 4) = a5_21;
						*((word32) a5_21 + 8) = (word16) a4;
						ptr32 a3_35 = a2_29 + a3 / 8;
						((word32) a5_21 + 0x0A)->u0 = (word16) a3_35;
						a1Out = a1_22;
						a2Out = a2_29;
						a3Out = a3_35;
						a4Out = a4;
						a5Out = a5_21;
						return 0x00;
					}
				}
			}
		}
	}
	else
		a0_17.u0 = 0x01;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a0;
	return a0_17;
}

// 230407B6: Register Eq_2 pbuf_alloc_reference(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 bArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_207078) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s8Out)
// Called from:
//      pbuf_alloc
Eq_2 pbuf_alloc_reference(Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 bArg44, union Eq_2 & s1Out, struct Eq_207078 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s8Out)
{
	Eq_2 s0_27 = a0;
	struct Eq_207078 * a0_19;
	ptr32 a3_22;
	ptr32 a4_23;
	ptr32 a2_21;
	ptr32 a5_20;
	Eq_2 s1_24 = memp_malloc(s1, 0x0D, a3, a4, mstatus, out a0_19, out a2_21, out a3_22, out a4_23, out a5_20);
	if (a0_19 != null)
	{
		a0_19->dw0000 = 0x00;
		*((word32) a1 + 4) = a0_19;
		a0_19->w0008 = (word16) a1;
		a0_19->w000A = (word16) a1;
		a0_19->b000C = (byte) dwArg44;
		a0_19->b000D = 0x00;
		a0_19->w000E = 0x01;
		a2_21 = dwArg44;
		s0_27 = a1;
		a5_20 = 0x01;
	}
	s1Out = s1_24;
	a0Out = a0_19;
	a2Out = a2_21;
	a3Out = a3_22;
	a4Out = a4_23;
	a5Out = a5_20;
	s8Out = a2;
	return s0_27;
}

// 230407F2: Register Eq_2 pbuf_alloced_custom(Register Eq_2 a0, Register ptr32 a1, Register int32 a2, Register Eq_2 a3, Register (ptr32 Eq_109535) a4, Register ptr32 a5, Register out (ptr32 Eq_109535) a4Out, Register out ptr32 a5Out)
// Called from:
//      tcpip_stack_input
Eq_2 pbuf_alloced_custom(Eq_2 a0, ptr32 a1, int32 a2, Eq_2 a3, struct Eq_109535 * a4, ptr32 a5, struct Eq_109535 & a4Out, ptr32 & a5Out)
{
	Eq_207132 a0_5 = (word32) a0 + 3 & ~0x03;
	if (a5 < (word32) a0_5 + a1)
	{
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
	else
	{
		if (a4 != null)
			a4 += a0_5;
		((word32) a3 + 0x0D)->u1 = 0x02;
		*a3 = 0x00;
		a4->t0004 = a3;
		*((word32) a3 + 8) = (word16) a1;
		*((word32) a3 + 0x0A) = (word16) a1;
		((word32) a3 + 0x0C)->u1 = (byte) a2;
		((word32) a3 + 0x0E)->u0 = 0x01;
		a4Out = a4;
		a5Out = 0x01;
		return a3;
	}
}

// 23040828: Register Eq_2 pbuf_add_header(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_203985 a3Out, Register out Eq_203986 a4Out, Register out ptr32 a5Out)
// Called from:
//      ip4_output_if_opt
//      raw_sendto
//      tcp_create_segment
//      udp_sendto
//      ethernet_output
//      icmp_input
Eq_2 pbuf_add_header(Eq_2 a0, Eq_2 a1, ptr32 & a1Out, ptr32 & a2Out, union Eq_203985 & a3Out, union Eq_203986 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_7;
	Eq_203986 a4_8;
	Eq_203985 a3_9;
	ptr32 a1_10;
	ptr32 a2_11;
	Eq_2 a0_6 = pbuf_add_header_impl(a0, a1, null, out a1_10, out a2_11, out a3_9, out a4_8, out a5_7);
	a1Out = a1_10;
	a2Out = a2_11;
	a3Out = a3_9;
	a4Out = a4_8;
	a5Out = a5_7;
	return a0_6;
}

// 2304082E: Register Eq_2 pbuf_remove_header(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a1Out, Register out (ptr32 Eq_203600) a3Out, Register out (ptr32 Eq_203600) a4Out, Register out Eq_2 a5Out)
// Called from:
//      ip4_input
//      pbuf_header
//      pbuf_header_force
//      pbuf_free_header
//      raw_sendto
//      tcp_receive
//      tcp_input
//      udp_input
//      ethernet_input
//      icmp_input
Eq_2 pbuf_remove_header(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a1Out, struct Eq_203600 & a3Out, struct Eq_203600 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_14;
	if (a0 != 0x00)
	{
		a4 = (struct Eq_203600 *) 0x10000000;
		a0_14.u0 = 0x01;
		if (a1 < 0x10000000)
		{
			a0_14.u0 = 0x00;
			if (a1 != 0x00)
			{
				a4 = (word32) *((word32) a0 + 0x0A);
				a3 = (word32) (word16) a1;
				a0_14.u0 = 0x01;
				if (a4 >= a3)
				{
					Eq_2 a5_17 = *((word32) a2 + 4);
					*((word32) a5_17 + 0x0A) = (word16) (a4 - a3);
					word32 a4_19 = (word32) *((word32) a5_17 + 8);
					word32 a1_20 = a1 + a2;
					*((word32) a1_20 + 4) = a5_17;
					struct Eq_203600 * a4_22 = a4_19 - a3;
					((word32) a5_17 + 8)->u0 = (word16) a4_22;
					a1Out = a1_20;
					a3Out = a3;
					a4Out = a4_22;
					a5Out = a5_17;
					return 0x00;
				}
			}
		}
	}
	else
		a0_14.u0 = 0x01;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a0;
	return a0_14;
}

// 2304086C: Register Eq_2 pbuf_header(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      bl_output
Eq_2 pbuf_header(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & a3Out, ptr32 & a5Out)
{
	if (a1 >= 0x00)
	{
		ptr32 a5_7;
		ptr32 a3_9;
		word32 a1_30;
		word32 a2_31;
		word32 a4_32;
		Eq_2 a0_6 = pbuf_add_header_impl(a0, a1, null, out a1_30, out a2_31, out a3_9, out a4_32, out a5_7);
		a3Out = a3_9;
		a5Out = a5_7;
		return a0_6;
	}
	else
	{
		Eq_2 a1_12 = 0x00 - a1;
		ptr32 a5_15;
		ptr32 a3_17;
		word32 a1_28;
		word32 a4_29;
		Eq_2 a0_14 = pbuf_remove_header(a0, a1_12, a2, out a1_28, out a3_17, out a4_29, out a5_15);
		a3Out = a3_17;
		a5Out = a5_15;
		return a0_14;
	}
}

// 2304087E: Register word32 pbuf_header_force(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a4Out)
// Called from:
//      ip4_input
//      udp_input
word32 pbuf_header_force(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 & a4Out)
{
	if (a1 >= 0x00)
	{
		ptr32 a4_8;
		word32 a3_9;
		word32 a1_29;
		word32 a2_30;
		word32 a5_31;
		pbuf_add_header_impl(a0, a1, (struct Eq_206997 *) 0x01, out a1_29, out a2_30, out a3_9, out a4_8, out a5_31);
		a4Out = a4_8;
		return a3_9;
	}
	else
	{
		Eq_2 a1_12 = 0x00 - a1;
		ptr32 a4_16;
		word32 a3_17;
		word32 a1_27;
		word32 a5_28;
		pbuf_remove_header(a0, a1_12, a2, out a1_27, out a3_17, out a4_16, out a5_28);
		a4Out = a4_16;
		return a3_17;
	}
}

