pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23040890: Register Eq_2 pbuf_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_454) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_456) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_461 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_467) s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      cb_altcp_recv_fn
//      bl_txdatacfm
//      get_dns_request
//      httpc_free_state
//      httpc_tcp_recv
//      httpc_tcp_connected
//      lwip_recv_tcp
//      free_socket
//      altcp_tcp_recv
//      dns_check_entry
//      dns_recv
//      dhcp_option_trailer
//      dhcp_select
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
//      etharp_free_entry
//      etharp_input
//      etharp_request
//      etharp_query
//      igmp_send
//      igmp_input
//      ip4_input
//      pbuf_alloc
//      pbuf_free_header
//      raw_sendto
//      tcp_seg_free
//      tcp_pcb_purge
//      tcp_recv_null
//      tcp_shutdown
//      tcp_input
//      tcp_create_segment
//      tcp_output_control_segment
//      tcp_write
//      tcp_split_unsent_seg
//      udp_input
//      udp_sendto
//      ethernet_input
//      recv_udp
//      recv_raw
//      recv_tcp
//      netconn_drain
//      netbuf_delete
//      netbuf_alloc
//      netbuf_free
//      icmp_input
//      icmp_dest_unreach
//      dhcp_server_recv
//      iperf_server_udp_recv_fn
//      ping_timeout
//      ping_recv
//      sntp_recv
//      sntp_dns_found
Eq_2 pbuf_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_454 & s0Out, union Eq_2 & s1Out, struct Eq_456 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_461 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, struct Eq_467 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	struct Eq_207292 * sp_124 = fp + -48;
	struct Eq_456 * s0_115 = null;
	if (a0 != 0x00)
	{
		a1 = a0;
		s0_115 = null;
		s2.u0 = 0x02;
		s3.u0 = 0x01;
		do
		{
			sp_124->t0084 = a1;
			word32 a5_260;
			word32 a4_259;
			word32 a2_258;
			sys_arch_protect(a4, mstatus, out a2_258, out a4_259, out a5_260);
			word32 s1_30 = (word32) *((word32) a1 + 0x0E);
			s1 = s1_30 + ~0x00 & 0x00FF;
			*((word32) a1 + 0x0E) = (byte) s1;
			a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5);
			if (s1 != 0x00)
				break;
			ptr32 s8_109;
			struct Eq_467 * s6_108;
			ptr32 s5_107;
			ptr32 a7_106;
			Eq_2 s4_104;
			Eq_2 a3_103;
			Eq_2 a4_102;
			ptr32 mstatus_101;
			Eq_461 a5_98;
			ui32 a5_39 = (word32) *((word32) a1 + 0x0D);
			Eq_2 a1_40 = *(s1_30 + ~0x00 & 0x00FF);
			if ((a5_39 & 0x02) != 0x00)
			{
				word32 a1_85 = (a5_39 & 0x02)->dw0010;
				word32 a6_105;
				word32 t0_110;
				word32 t1_111;
				word32 t4_112;
				word32 t5_113;
				word32 t6_114;
				(a5_39 & 0x02)();
				a5 = a5_98;
				mstatus = mstatus_101;
				a4 = a4_102;
				a3 = a3_103;
				s4 = s4_104;
				a7 = a7_106;
				s5 = s5_107;
				s6 = s6_108;
				s8 = s8_109;
				goto l230408D6;
			}
			ui32 a5_42 = (word32) *((word32) a1_40 + 0x0C);
			Eq_2 a0_43 = 0x0E;
			a5 = a5_42 & 0x0F;
			if ((a5_42 & 0x0F) != s2)
			{
				if ((a5_42 & 0x0F) == s3)
				{
					a0_43.u0 = 0x0D;
					goto l23040902;
				}
				if ((a5_42 & 0x0F) == 0x00)
					s0_115 = mem_free(a1_40, a3, a4, s2, s3, s4, mstatus, sp_124->t0004, sp_124->t0008, sp_124->t0024, sp_124->t0084, sp_124->t00A4, sp_124->t00D8, sp_124->t00F8, sp_124->t0118, sp_124->t0138, sp_124->t0158, sp_124->t0178, sp_124->t0198, out s1, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8);
			}
			else
			{
l23040902:
				word32 a0_261;
				word32 a2_262;
				s1 = memp_free(a0_43, a1_40, a3, a4, mstatus, out a0_261, out a2_262, out a3, out a4, out a5);
			}
l230408D6:
			s0_115 = (char *) &s0_115->t0000 + 1 & 0x00FF;
			a1 = s1;
		} while (s1 != 0x00);
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	a0Out = s0_115;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	a7Out = a7;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s8Out = s8;
	mstatusOut = mstatus;
	return ra;
}

// 23040912: Register Eq_2 pbuf_alloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_142405 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_142419) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      httpc_init_connection_common.constprop.5
//      dns_check_entry
//      dhcp_create_msg
//      etharp_request
//      igmp_send
//      pbuf_clone
//      raw_sendto
//      tcp_output_alloc_header_common.constprop.6
//      tcp_write
//      tcp_split_unsent_seg
//      tcp_send_fin
//      udp_sendto
//      netbuf_alloc
//      icmp_input
//      icmp_dest_unreach
//      dhcp_server_recv
//      ping_timeout
//      sntp_dns_found
Eq_2 pbuf_alloc(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_142405 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, struct Eq_142419 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	if (a2 == 65)
	{
l230409BC:
		Eq_2 a0_232;
		ptr32 a2_233;
		Eq_2 a3_234;
		Eq_2 a4_235;
		Eq_2 a5_236;
		Eq_2 s1_238;
		ptr32 s8_239;
		s0Out = pbuf_alloc_reference(s1, a1, a3, a4, mstatus, dwArg44, out s1_238, out a0_232, out a2_233, out a3_234, out a4_235, out a5_236, out s8_239);
		s1Out = s1_238;
		a0Out = a0_232;
		a1Out = a1;
		a2Out = a2_233;
		a3Out = a3_234;
		a4Out = a4_235;
		a5Out = a5_236;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8_239;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a5_101;
	Eq_2 s1_103;
	if (a2 <= 65)
	{
		a5_101.u0 = 0x01;
		if (a2 != 0x01)
			goto l23040932;
		0x00 = (uint16) dwArg0128;
		goto l230409BC;
	}
	word32 s0_22 = (word32) (word16) a0;
	if (a2 == 386)
	{
		s3.u0 = 0x00;
		s1_103.u0 = 0x00;
		s4.u0 = 760;
		s2.u0 = 0x10000082;
		do
		{
			Eq_2 a0_36;
			Eq_2 a4_40;
			word32 a5_494;
			word32 a2_493;
			s1_103 = memp_malloc(s1_103, 0x0E, a3, a4, mstatus, out a0_36, out a2_493, out a3, out a4_40, out a5_494);
			if (a0_36 == 0x00)
			{
				word32 a2_482;
				word32 a4_483;
				word32 a5_484;
				sys_arch_protect(a4_40, mstatus, out a2_482, out a4_483, out a5_484);
				ui32 s2_87 = (word32) g_b4201FD94;
				*(byte *) 0x42020D94 = 0x01;
				s2 = s2_87 & 0x00FF;
				a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_101);
				if ((s2_87 & 0x00FF) == 0x00)
				{
					word32 a0_97;
					struct Eq_207596 * s0_111 = tcpip_try_callback(0x23040720, 0x00, a3, a4, mstatus, dwArgA8, dwArgE8, dwArg0128, out s1_103, out a0_97, out a1, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6);
					if (a0_97 != 0x00)
					{
						word32 a4_486;
						word32 a5_487;
						word32 a2_485;
						sys_arch_protect(a4, mstatus, out a2_485, out a4_486, out a5_487);
						s0_111->b0D94 = 0x00;
						a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_101);
					}
				}
				if (s1_103 != 0x00)
				{
					word32 a0_490;
					word32 a2_491;
					word32 s8_492;
					word32 s1_489;
					word32 s0_488;
					ra = pbuf_free(ra, s1_103, a3, a4, s4, mstatus, dwArgF8, out s0_488, out s1_489, out a0_490, out a1, out a2_491, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6, out s8_492, out mstatus);
				}
				goto l23040932;
			}
			Eq_2 a5_48 = 760 - (s0_22 + 3 & ~0x03);
			a4 = a5_48;
			if (a1 < (word32) ((word16) a5_48))
				a4 = a1;
			a0_36->u0 = 0x00;
			((word32) a0_36 + s0_22 + 0x13 & ~0x03)->t0004 = a0_36;
			*((word32) a0_36 + 8) = (word16) a1;
			*((word32) a0_36 + 0x0A) = (word16) a4;
			*((word32) a0_36 + 0x0C) = 0x10000082;
			uint32 a5_59 = a4 << 0x10;
			a5_101 = a5_59 >> 16;
			if (s1_103 != 0x00)
				*s3.u0 = a0_36;
			else
				s1_103 = a0_36;
			a1 = (word32) (word16) (a1 - (a5_59 >> 16));
			s0_22 = 0x00;
			s3 = a0_36;
		} while (a1 != 0x00);
l23040934:
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_103;
		a0Out = s1_103;
		a1Out = a1;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_101;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = dwArg58;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		a5_101.u0 = 640;
		if (a2 == 640)
		{
			a5_101 = (word32) a1 + 3 & ~0x03;
			Eq_2 s0_173 = (word32) (word16) ((word16) a5_101.u0 + (s0_22 + 0x03 & ~0x03));
			s2 = a0;
			uint32 a0_176 = (word32) s0_173 + 16 << 16;
			if (s0_173 >= a5_101 && a0_176 >> 16 >= a5_101)
			{
				Eq_2 a0_182;
				word32 s8_481;
				mem_malloc(ra, s0_173, a0_176 >> 16, a3, a4, a0, mstatus, s0, dwArg04, ra, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out a0_182, out a1, out a3, out a4, out a5_101, out a7, out s2, out s3, out s4, out s5, out s6, out s8_481);
				s1_103 = a0_182;
				if (a0_182 != 0x00)
				{
					*a0_182 = 0x00;
					s2 = s2 + a0_182 + 0x13 & -4;
					*((word32) a0_182 + 4) = s2;
					*((word32) a0_182 + 8) = (word16) a1;
					*((word32) a0_182 + 0x0A) = (word16) a1;
					*(union Eq_2 *) 0x1000008C = a0_182;
					a5_101.u0 = 0x10000080;
				}
				goto l23040934;
			}
		}
l23040932:
		s1_103.u0 = 0x00;
		goto l23040934;
	}
}

// 23040A70: Register Eq_2 pbuf_realloc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out Eq_142893 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_142900) s5Out, Register out Eq_142901 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      dhcp_option_trailer
//      ip4_input
//      tcp_oos_insert_segment
//      tcp_receive
//      tcp_split_unsent_seg
//      dhcp_server_recv
Eq_2 pbuf_realloc(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0118, union Eq_2 & s1Out, union Eq_142893 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, struct Eq_142900 & s5Out, union Eq_142901 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = (word32) *((word32) a0 + 8);
	if (a1 >= a5_5)
	{
		s1Out = s1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_14 = a0;
		Eq_2 s1_142 = a1;
		up32 a5_16 = a1 - a5_5;
		a4_122 = a4;
		while (true)
		{
			Eq_2 a4_122;
			Eq_2 a1_19 = (word32) *((word32) s0_14 + 0x0A);
			if (a1_19 >= s1_142)
				break;
			a4_122 = (word32) *((word32) s0_14 + 8) + a5_16;
			((word32) s0_14 + 8)->u0 = (word16) a4_122;
			s1_142 = (word32) (word16) (s1_142 - a1_19);
			s0_14 = *s0_14;
		}
		ui32 a5_29 = (word32) *((word32) s0_14 + 0x0C);
		Eq_2 a5_124 = a5_29 & 0x0F;
		if ((a5_29 & 0x0F) == 0x00 && a1_19 != s1_142)
		{
			ui32 a5_31 = (word32) *((word32) s0_14 + 0x0D);
			a5_124 = a5_31 & 0x02;
			if ((a5_31 & 0x02) == 0x00)
			{
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				a0 = *((word32) a1_19 + 4);
				Eq_2 stackArg4 = <invalid>;
				Eq_2 stackArg36 = <invalid>;
				Eq_2 stackArg132 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				Eq_2 stackArg216 = <invalid>;
				Eq_2 stackArg248 = <invalid>;
				Eq_2 stackArg280 = <invalid>;
				Eq_2 stackArg312 = <invalid>;
				Eq_2 stackArg376 = <invalid>;
				mem_trim(a0, a1, a3, a4, s2, s3, s4, mstatus, stackArg4, stackArg36, stackArg132, stackArg168, stackArg216, stackArg248, stackArg280, stackArg312, stackArg376);
			}
		}
		struct Eq_207782 * s0_43 = *a0;
		s0_43->w000A = (word16) s1_142;
		s0_43->w0008 = (word16) s1_142;
		if (a0 != 0x00)
		{
			word32 a7_227;
			word32 a1_225;
			word32 a2_226;
			word32 a0_224;
			ra = pbuf_free(ra, a0, a3, a4_122, s4, mstatus, dwArg0118, out s0_43, out s1_142, out a0_224, out a1_225, out a2_226, out a3, out a4_122, out a5_124, out a7_227, out s2, out s3, out s4, out s5, out s6, out s8, out mstatus);
		}
		s0_43->dw0000 = 0x00;
		s1Out = s1_142;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4_122;
		a5Out = a5_124;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
}

