pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23040AEA: Register Eq_2 pbuf_free_header(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_182379) s2Out, Register out (ptr32 Eq_182380) s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_182382) s5Out, Register out Eq_182383 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      httpc_tcp_recv
//      lwip_recv_tcp
Eq_2 pbuf_free_header(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_182379 & s2Out, struct Eq_182380 & s3Out, ptr32 & s4Out, struct Eq_182382 & s5Out, union Eq_182383 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s0_11 = a0;
	while (a1 != 0x00 && s0_11 != 0x00)
	{
		if (a1 < (word32) (*((word32) s0_11 + 0x0A)))
		{
			word32 a5_154;
			word32 a1_153;
			pbuf_remove_header(s0_11, a1, a2, out a1_153, out a3, out a4, out a5_154);
			break;
		}
		Eq_2 s0_34 = *s1;
		*s0_34 = 0x00;
		word32 s0_155;
		word32 a0_156;
		word32 a2_157;
		word32 a5_158;
		word32 a7_159;
		word32 s8_160;
		ra = pbuf_free(ra, s0_34, a3, a4, s4, mstatus, dwArg0108, out s0_155, out s1, out a0_156, out a1, out a2_157, out a3, out a4, out a5_158, out a7_159, out s2, out s3, out s4, out s5, out s6, out s8_160, out mstatus);
		s0_11 = s1;
		a2 = dwArg44;
	}
	s0Out = s0_11;
	s1Out = s1;
	a0Out = s0_11;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s8Out = dwLoc1C;
	mstatusOut = mstatus;
	return ra;
}

// 23040B2C: Register Eq_2 pbuf_clen(Register Eq_2 a0)
// Called from:
//      tcp_free_acked_segments.isra.3
//      tcp_write
//      tcp_split_unsent_seg
//      tcp_send_fin
Eq_2 pbuf_clen(Eq_2 a0)
{
	Eq_2 a5_3 = 0x00;
	while (a0 != 0x00)
	{
		a5_3 = (word32) (word16) ((word32) a5_3 + 1);
		a0 = *a0;
	}
	return a5_3;
}

// 23040B3E: Register Eq_2 pbuf_ref(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_output
//      etharp_query
//      pbuf_chain
//      tcp_seg_copy
Eq_2 pbuf_ref(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return a0;
	}
	else
	{
		word32 a2_41;
		word32 a4_42;
		word32 a5_43;
		Eq_2 a0_12 = sys_arch_protect(a4, mstatus, out a2_41, out a4_42, out a5_43);
		*((word32) a0 + 0x0E) = (byte) ((word32) *((word32) a0 + 0x0E) + 0x01);
		Eq_2 a4_24;
		ptr32 a5_25;
		a3Out = sys_arch_unprotect(a3, mstatus, out a4_24, out a5_25);
		a4Out = a4_24;
		a5Out = a5_25;
		return a0_12;
	}
}

// 23040B62: void pbuf_cat(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4)
// Called from:
//      tcpip_stack_input
//      httpc_tcp_recv
//      pbuf_chain
//      tcp_receive
void pbuf_cat(Eq_2 a0, Eq_2 a1, Eq_2 a4)
{
	if (a0 == 0x00)
		return;
	if (a1 == 0x00)
		return;
	while (true)
	{
		struct Eq_207943 * a0_11 = *a4;
		Mem15[a0_11 + 8:word16] = SLICE(CONVERT(CONVERT(Mem6[a0 + 8:uint16] + Mem6[a1 + 8:uint16], uint16, uint16), uint16, word32), word16, 0);
		if (a4 == 0x00)
			break;
		a0 = a4;
	}
	*a1 = a0_11;
}

// 23040B84: void pbuf_chain(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      raw_sendto
//      udp_sendto
void pbuf_chain(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	pbuf_cat(a0, a1, a4);
	word32 a3_26;
	word32 a4_27;
	word32 a5_28;
	pbuf_ref(a1, a3, a4, mstatus, out a3_26, out a4_27, out a5_28);
}

// 23040B9C: Register Eq_2 pbuf_copy(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_207985 a3Out, Register out (ptr32 Eq_2) a4Out, Register out Eq_2 s2Out, Register out Eq_207988 s3Out, Register out ptr32 s4Out)
// Called from:
//      pbuf_clone
//      icmp_input
//      dhcp_server_recv
Eq_2 pbuf_copy(Eq_2 a0, Eq_2 a1, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_207985 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_207988 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s0;
	}
	ptr32 a0_192;
	Eq_2 s1_111;
	Eq_2 s0_19 = a1;
	s1_111 = s1;
	if (a1 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 8);
		s1_111 = a0;
		if (a4 >= (word32) (*((word32) a1 + 8)))
		{
			union Eq_2 * s4_118 = null;
			s3.u0 = 0x00;
			do
			{
				s2 = (word32) *((word32) s1_111 + 0x0A) - s3;
				Eq_2 a5_33 = (word32) *((word32) s0_19 + 0x0A) - s4_118;
				if (a5_33 < s2)
					s2 = a5_33;
				s0_19 = *((word32) a1 + 4);
				s1_111 = *((word32) a0 + 4);
				a0 += s3;
				word32 a7_311;
				word32 a6_310;
				word32 a5_309;
				word32 a2_307;
				word32 a4_308;
				memcpy(a0, a1 + s4_118, s2, out a1, out a2_307, out a3, out a4_308, out a5_309, out a6_310, out a7_311);
				a4 = (word32) *((word32) s0_19 + 0x0A);
				s4_118 += s2;
				s3 += s2;
				Eq_207988 a5_64 = (word32) *((word32) s1_111 + 0x0A);
				if (s4_118 >= a4)
				{
					s0_19 = *s0_19;
					s4_118 = null;
				}
				if (s3 == a5_64)
				{
					s1_111 = *s1_111;
					if (s1_111 == 0x00)
					{
						a0_192 = 0x00;
						if (s0_19 != 0x00)
							goto l23040C06;
						goto l23040C08;
					}
					s3.u0 = 0x00;
				}
				if (s0_19 != 0x00)
				{
					a4 = (word32) *((word32) s0_19 + 0x0A);
					union Eq_2 * a5_77 = (word32) *((word32) s0_19 + 8);
					if (a4 != a5_77)
						goto l23040C2C;
					s0_19 = *a5_77;
					if (a5_77 == null)
						goto l23040C2C;
					goto l23040C42;
				}
l23040C2C:
				a4 = (word32) *((word32) s1_111 + 0x0A);
				union Eq_2 * a5_83 = (word32) *((word32) s1_111 + 8);
				if (a4 == a5_83)
				{
					s1_111 = *a5_83;
					if (a5_83 == null)
						goto l23040C3C;
l23040C42:
					a0_192 = ~0x05;
					goto l23040C08;
				}
l23040C3C:
			} while (s0_19 != 0x00);
			a0_192 = 0x00;
l23040C08:
			s1Out = s1_111;
			a0Out = a0_192;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			return s1;
		}
	}
l23040C06:
	a0_192 = ~0x0F;
	goto l23040C08;
}

