pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23040DF8: Register Eq_2 pbuf_get_at(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a3Out, Register out Eq_182145 a4Out)
// Called from:
//      httpc_tcp_recv
//      pbuf_memcmp
//      sntp_recv
Eq_2 pbuf_get_at(Eq_2 a0, Eq_2 a1, ptr32 & a3Out, union Eq_182145 & a4Out)
{
	ptr32 a3_12;
	Eq_182145 a4_13;
	word32 a5_30;
	int32 a0_14 = pbuf_try_get_at(a0, a1, out a3_12, out a4_13, out a5_30);
	if (a0_14 < 0x00)
		a0_14 = 0x00;
	a3Out = a3_12;
	a4Out = a4_13;
	return a0_14 & 0x00FF;
}

// 23040E10: void pbuf_put_at(Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register ui32 a2)
// Called from:
//      get_dns_request
//      dns_check_entry
void pbuf_put_at(Eq_2 s0, Eq_2 a0, Eq_2 a1, ui32 a2)
{
	pbuf_skip_const(a0, a1, fp + ~0x11);
	uint16 wLoc12_25 = SLICE(s0, uint16, 16);
	if (a0 != 0x00)
	{
		Eq_208408 a4_13 = (word32) wLoc12_25;
		Eq_208408 a5_14 = (word32) *((word32) a0 + 0x0A);
		if (a4_13 < a5_14)
			Mem17[a5_14 + a4_13:byte] = SLICE(a2, byte, 0);
	}
}

// 23040E3E: Register word32 pbuf_memcmp(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Stack ptr32 dwArg74, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out (ptr32 Eq_182121) a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_182125) s2Out, Register out (ptr32 Eq_182126) s3Out)
// Called from:
//      httpc_tcp_recv
//      pbuf_memfind
word32 pbuf_memcmp(Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 dwArg74, word32 dwArg0128, union Eq_2 & s1Out, struct Eq_182121 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_182125 & s2Out, struct Eq_182126 & s3Out)
{
	Eq_2 a4_141 = (word32) *((word32) a0 + 8);
	word32 a5_8 = a1 + a3;
	if (a4_141 >= a5_8)
	{
		Eq_2 s1_20 = a0;
		Eq_2 s0_21 = a1;
		do
		{
			Eq_2 a5_147 = (word32) *((word32) s1_20 + 0x0A);
			if (s0_21 < a5_147)
				break;
			s1_20 = *s1_20;
			s0_21 = (word32) (word16) (s0_21 - a5_147);
		} while (s1_20 != 0x00);
		struct Eq_182126 * s3_159 = null;
		do
		{
			struct Eq_182121 * a0_129;
			uint32 s2_32 = s3_159 << 0x10;
			if (s2_32 >> 0x10 >= a3)
			{
				a0_129 = null;
				goto l23040EBA;
			}
			s3_159 = (struct Eq_182126 *) ((char *) s3_159 + 1);
			Eq_2 a0_45 = pbuf_get_at(s1_20, (word32) (word16) ((word32) s0_21 + (s2_32 >> 0x10)), out a3, out a4_141);
			s0_21 = a3;
			a5_147 = (word32) *((char *) (s3_159 + dwArg74 / 0x0A) - 1);
		} while (a5_147 == a0_45);
		a5_147.u0 = 0x0FFFFFFE;
		uint32 a0_58 = s2_32 >> 0x10;
		if (s2_32 >> 0x10 > 0x0FFFFFFE)
			a0_58 = ~0x01;
		a0_129 = (word32) (word16) (a0_58 + 0x01);
l23040EBA:
		0x00 = dwArg0128;
		s1Out = s1_20;
		a0Out = a0_129;
		a3Out = a3;
		a4Out = a4_141;
		a5Out = a5_147;
		s2Out = s2_32 >> 0x10;
		s3Out = s3_159;
		return dwArgE4;
	}
	else
	{
		s1Out = s1;
		a0Out = (struct Eq_182121 *) 0x0FFFFFFF;
		a3Out = a3;
		a4Out = a4_141;
		a5Out = a5_8;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
}

// 23040EC8: Register Eq_2 pbuf_memfind(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Stack ptr32 dwArg54, Stack word32 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_182068 a4Out, Register out Eq_182068 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      httpc_tcp_recv
Eq_2 pbuf_memfind(Eq_2 a0, Eq_2 a2, Eq_2 a3, ptr32 dwArg54, word32 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_182068 & a4Out, union Eq_182068 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s1_114;
	Eq_2 s0_46;
	Eq_182068 a5_111 = (word32) *((word32) a0 + 8);
	word32 a4_108 = a2 + a3;
	s1_114 = s1;
	if (a5_111 >= a4_108)
	{
		a5_111 -= a2;
		s3 = a0;
		s2 = a2;
		Eq_2 s0_27 = a3;
		s1_114 = (word32) (word16) a5_111;
		while (s1_114 >= s0_27)
		{
			word32 a0_40;
			s0_46 = pbuf_memcmp(s3, s0_27, s2, dwArg54, dwArg0108, out s1_114, out a0_40, out a3, out a4_108, out a5_111, out s2, out s3);
			if (a0_40 == 0x00)
				goto l23040EFA;
			s0_27 = (word32) (word16) ((word16) s0_46.u0 + 1);
		}
	}
	s0_46.u0 = 0x0FFFFFFF;
l23040EFA:
	s1Out = s1_114;
	a0Out = s0_46;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4_108;
	a5Out = a5_111;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = s4;
	return s1;
}

// 23040F22: Register Eq_2 raw_input(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out (ptr32 Eq_203500) s1Out, Register out (ptr32 Eq_203501) a0Out, Register out ptr32 a2Out, Register out (ptr32 (ptr32 Eq_203500)) s2Out, Register out (ptr32 Eq_203500) s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_203506) s5Out, Register out (ptr32 Eq_200359) s6Out, Register out ptr32 s8Out)
// Called from:
//      ip4_input
Eq_2 raw_input(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg0128, ptr32 & s0Out, struct Eq_203500 & s1Out, struct Eq_203501 & a0Out, ptr32 & a2Out, struct Eq_203500 & s2Out, struct Eq_203500 & s3Out, ptr32 & s4Out, struct Eq_203506 & s5Out, struct Eq_200359 & s6Out, ptr32 & s8Out)
{
	word32 a5_271;
	word32 a3_269;
	word32 a4_270;
	struct Eq_200359 * s6_118 = ip4_addr_isbroadcast_u32(a0, a1, out a3_269, out a4_270, out a5_271);
	Eq_2 s4_116 = a0;
	struct Eq_203500 * s3_115 = null;
	struct Eq_203500 * s0_113;
	struct Eq_203506 * s5_117 = (word32) *((word32) *((word32) a0 + 4) + 9);
	struct Eq_203501 * a0_130 = null;
	struct Eq_203500 * s1_111 = &g_t4201FEC0;
	struct Eq_203500 ** s2_114 = &g_ptr4200DF7C;
	word32 s7_119 = 0x42020000;
	for (s0_113 = g_ptr4200DF7C; s0_113 != null; s0_113 = s0_113->ptr000C)
	{
		struct Eq_203506 * a5_45 = (word32) s0_113->b0010;
		if (a5_45 == s5_117)
		{
			struct Eq_203506 * a4_47 = (word32) s0_113->b0008;
			if (a4_47 != null)
			{
				s1_111 = a5_45->ptr0004;
				a5_45 = (word32) a5_45->b0044 + 0x01 & 0x00FF;
				if (a4_47 == a5_45)
					goto l23040F8A;
				goto l23040FE8;
			}
l23040F8A:
			s0_113 = a5_45->ptr0000;
			if (s6_118 != null)
			{
				if (a5_45 == null)
					goto l23040F92;
				goto l23040FE8;
			}
			if (a5_45 != null)
			{
				s1_111 = a4_47->ptr0014;
				if (a4_47 != a5_45)
					goto l23040FE8;
			}
l23040F92:
			ui32 a5_61 = (word32) s0_113->b0011;
			if ((a5_61 & 0x01) != 0x00)
			{
				s0_113 = a4_47->ptr0004;
				s1_111 = (a5_61 & 0x01)->ptr0010;
				if (a4_47 == (a5_61 & 0x01))
					goto l23040FA2;
			}
			else
			{
l23040FA2:
				s0_113 = (a5_61 & 0x01)->ptr0014;
				if ((a5_61 & 0x01) != 0x00)
				{
					word32 s0_73 = a0_130->dw0018;
					struct Eq_203500 * a5_112;
					word32 a0_121;
					(a5_61 & 0x01)();
					if (a0_121 != 0x00)
					{
						a0_130 = (struct Eq_203501 *) 0x01;
						if (s3_115 != null)
						{
							struct Eq_203500 * s0_136 = a5_112->ptr000C;
							s3_115->ptr000C = a5_112;
							struct Eq_203500 * a5_138 = *s2_114;
							*s2_114 = (struct Eq_203500 **) s0_136;
							a5_138->ptr000C = s0_136;
						}
						break;
					}
					a0_130 = (struct Eq_203501 *) 0x02;
				}
			}
		}
l23040FE8:
		s3_115 = s0_113;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_111;
	a0Out = a0_130;
	a2Out = dwArgB8;
	s2Out = s2_114;
	s3Out = s3_115;
	s4Out = dwArg78;
	s5Out = s5_117;
	s6Out = s6_118;
	s8Out = s5;
	return ra;
}

// 23040FF2: Register Eq_2 raw_bind(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_netconn_do_bind
//      ping_api_init
Eq_2 raw_bind(Eq_2 a0, Eq_2 a1)
{
	Eq_2 a5_10 = ~0x05;
	if (a0 != 0x00 && a1 != 0x00)
	{
		*(union Eq_2 *) ~0x05 = a0;
		a5_10.u0 = 0x00;
	}
	return a5_10;
}

// 23041002: Register ui32 raw_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 raw_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	((word32) a0 + 8)->u1 = (byte) a5_3;
	return a5_3;
}

