pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23041016: Register Eq_2 raw_connect(Register Eq_2 a0, Register (ptr32 Eq_196095) a1, Register Eq_2 a4, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      lwip_netconn_do_connect
Eq_2 raw_connect(Eq_2 a0, struct Eq_196095 * a1, Eq_2 a4, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		a4Out = a4;
		a5Out.u0 = <invalid>;
		return ~0x05;
	}
	else
	{
		*((word32) a4 + 4) = a0;
		ui32 a4_12 = (word32) *((word32) a0 + 0x0011);
		*((word32) a0 + 0x0011) = (byte) (a4_12 | 1);
		a4Out = a4_12 | 1;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
}

// 23041034: void raw_recv(Register Eq_2 a0, Register (ptr32 Eq_208717) a1, Register Eq_2 a2)
// Called from:
//      lwip_netconn_do_newconn
//      ping_api_init
void raw_recv(Eq_2 a0, struct Eq_208717 * a1, Eq_2 a2)
{
	a1->t0014 = a0;
	*((word32) a2 + 24) = a0;
}

// 2304103A: Register Eq_2 raw_sendto_if_src(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      raw_sendto
Eq_2 raw_sendto_if_src(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	ptr32 s1_175;
	if (a0 == 0x00 || (a2 == 0x00 || a3 == 0x00))
	{
l23041150:
		s1_175 = ~0x05;
		goto l2304109E;
	}
	Eq_2 s0_136 = a1;
	if (a4 == 0x00)
		goto l23041150;
	if (((word32) *((word32) a0 + 0x0011) & 0x02) != 0x00)
	{
		a4 = (word32) *((word32) a1 + 0x0A);
		a5 = 0x13;
		if (a4 > 0x13)
		{
			word32 s6_445;
			word32 s8_447;
			word32 s3_443;
			word32 a7_442;
			word32 s5_444;
			ptr32 a0_244;
			Eq_2 a3_247;
			Eq_2 a4_248;
			ptr32 a5_249;
			Eq_2 s0_253;
			Eq_2 s2_255;
			Eq_2 s4_257;
			word32 s7_446;
			word32 s9_448;
			word32 s1_441;
			Eq_2 ra_252 = ip4_output_if(ra, s1, s1, a1, a4, 0x00, 0x00, 0x00, 0x00, a3, dwArg04, s5, s6, s7, out s0_253, out s1_441, out a0_244, out a3_247, out a4_248, out a5_249, out a7_442, out s2_255, out s3_443, out s4_257, out s5_444, out s6_445, out s7_446, out s8_447, out s9_448);
			s0Out = s0_253;
			a0Out = a0_244;
			a3Out = a3_247;
			a4Out = a4_248;
			a5Out = a5_249;
			s2Out = s2_255;
			s4Out = s4_257;
			mstatusOut = mstatus;
			return ra_252;
		}
		goto l23041150;
	}
	a4 = (word32) *((word32) a1 + 8);
	a5 = 0x0FFFFFEB;
	if (a4 > 0x0FFFFFEB)
	{
l2304109C:
		s1_175 = ~0x00;
		goto l2304109E;
	}
	Eq_2 s4_123 = a4;
	Eq_2 s1_31 = a0;
	Eq_2 s5_115 = a3;
	Eq_2 s3_35 = a2;
	Eq_2 a2_38;
	Eq_2 a3_39;
	Eq_2 a4_40;
	word32 a1_449;
	word32 a5_450;
	if (pbuf_add_header(a1, 0x14, out a1_449, out a2_38, out a3_39, out a4_40, out a5_450) != 0x00)
	{
		Eq_2 a0_54;
		word32 a1_451;
		word32 a2_452;
		word32 a7_453;
		word32 s2_454;
		word32 s8_455;
		ra = pbuf_alloc(ra, a1, a0, 0x00A2, 0x00, 640, a3_39, a4_40, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_136, out s1_31, out a0_54, out a1_451, out a2_452, out a3, out a4, out a5, out a7_453, out s2_454, out s3_35, out s4_123, out s5_115, out s6, out s8_455, out mstatus);
		s2 = a0_54;
		if (a0_54 == 0x00)
			goto l2304109C;
		if ((word32) *((word32) s0_136 + 8) != 0x00)
			pbuf_chain(a0_54, s0_136, a3, a4, mstatus);
	}
	else
	{
		word32 a1_474;
		if (pbuf_remove_header(a1, 0x14, a2_38, out a1_474, out a3, out a4, out a5) != 0x00)
			goto l2304109C;
		s2 = a1;
	}
	Eq_2 a3_107;
	if (((word32) *((word32) s1_31 + 0x0011) & 0x04) != 0x00)
	{
		if ((*s3_35 & 0x00F0) != 224)
			goto l2304114A;
		*((word32) s2 + 0x0D) = (byte) ((word32) *((word32) s2 + 0x0D) | 4);
	}
	if ((*s3_35 & 0x00F0) == 224)
	{
		a3_107 = (word32) *((word32) s1_31 + 19);
		goto l2304111A;
	}
l2304114A:
	a3_107 = (word32) *((word32) s1_31 + 11);
l2304111A:
	ptr32 a0_149;
	Eq_2 s0_158;
	Eq_2 s4_162;
	word32 s1_456;
	word32 a7_457;
	word32 s3_458;
	word32 s5_459;
	word32 s6_460;
	word32 s7_461;
	word32 s8_462;
	word32 s9_463;
	ra = ip4_output_if(ra, s0_136, s1_31, s2, s4_123, s3_35, a3_107, (word32) *((word32) s1_31 + 0x0A), (word32) *((word32) s1_31 + 16), s5_115, s4_123, s5_115, s6, s7, out s0_158, out s1_456, out a0_149, out a3, out a4, out a5, out a7_457, out s2, out s3_458, out s4_162, out s5_459, out s6_460, out s7_461, out s8_462, out s9_463);
	s1_175 = a0_149;
	if (s0_158 != s2)
	{
		word32 s0_464;
		word32 a0_465;
		word32 a1_466;
		word32 a2_467;
		word32 a7_468;
		word32 s3_469;
		word32 s4_470;
		word32 s5_471;
		word32 s6_472;
		word32 s8_473;
		ra = pbuf_free(ra, s2, a3, a4, s4_162, mstatus, dwArg0108, out s0_464, out s1_175, out a0_465, out a1_466, out a2_467, out a3, out a4, out a5, out a7_468, out s2, out s3_469, out s4_470, out s5_471, out s6_472, out s8_473, out mstatus);
	}
l2304109E:
	s0Out = s1;
	a0Out = s1_175;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s4Out = dwArg04;
	mstatusOut = mstatus;
	return ra;
}

// 23041154: Register Eq_2 raw_sendto(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack word32 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_209023) s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_209026) a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      raw_send
//      lwip_netconn_do_send
//      ping_timeout
Eq_2 raw_sendto(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, word32 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, struct Eq_209023 & s0Out, ptr32 & a0Out, ptr32 & a3Out, struct Eq_209026 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a2 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x05;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	struct Eq_209026 * a4_247;
	Eq_2 a0_25;
	Eq_2 a5_23;
	Eq_2 a0_16 = (word32) *((word32) a0 + 8);
	if (a0_16 != 0x00)
		a0_25 = netif_get_by_index(a0_16, out a4_247, out a5_23);
	else
	{
		Eq_2 a2_21 = *a5;
		a5_23 = a5 & 0x00F0;
		if ((a5 & 0x00F0) == 224)
		{
			word32 a4_338;
			a0_25 = netif_get_by_index((word32) *((word32) a0 + 18), out a4_338, out a5_23);
			if (a0_25 != 0x00)
				goto l230411A2;
		}
		word32 a2_339;
		a0_25 = ip4_route(a2_21, a5_23, out a2_339, out a3, out a4_247, out a5_23);
	}
	if (a0_25 == 0x00)
	{
		0x00 = dwArg38;
		s0Out = s0;
		a0Out = ~0x03;
		a3Out = a3;
		a4Out = a4_247;
		a5Out = a5_23;
		s2Out = a1;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
l230411A2:
	Eq_2 a4_51;
	Eq_2 s0_46 = *a5_23;
	if (a5_23 != 0x00 && (a5_23 & 0x00F0) != 224)
		a4_51 = s0_46;
	else
		a4_51 = (word32) a0_25 + 4;
	0x00 = dwArg38;
	ptr32 a0_116;
	struct Eq_209023 * s0_119;
	Eq_2 s4_121;
	ptr32 a3_126;
	struct Eq_209026 * a4_127;
	Eq_2 a5_128;
	Eq_2 s2_131;
	ptr32 mstatus_142;
	Eq_2 ra_130 = raw_sendto_if_src(ra, a2, s0_46, a1, a2, a0_25, a4_51, s4, s5, s6, s7, mstatus, dwArg04, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_119, out a0_116, out a3_126, out a4_127, out a5_128, out s2_131, out s4_121, out mstatus_142);
	s0Out = s0_119;
	a0Out = a0_116;
	a3Out = a3_126;
	a4Out = a4_127;
	a5Out = a5_128;
	s2Out = s2_131;
	s4Out = s4_121;
	mstatusOut = mstatus_142;
	return ra_130;
}

