pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230411D4: Register word32 raw_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack word32 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out Eq_209143 a4Out, Register out (ptr32 Eq_209144) a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_send
word32 raw_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, word32 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & a0Out, union Eq_209143 & a4Out, struct Eq_209144 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	Eq_209143 a4_18;
	struct Eq_209144 * a5_19;
	ptr32 mstatus_22;
	word32 s0_24;
	word32 a3_56;
	word32 s2_57;
	word32 s4_58;
	raw_sendto(ra, a0, a1, (word32) a0 + 4, a5, s4, s5, s6, s7, mstatus, dwArg04, dwArg24, dwArg38, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_24, out a0_14, out a3_56, out a4_18, out a5_19, out s2_57, out s4_58, out mstatus_22);
	a0Out = a0_14;
	a4Out = a4_18;
	a5Out = a5_19;
	mstatusOut = mstatus_22;
	return s0_24;
}

// 230411DC: Register Eq_2 raw_remove(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 byte) a4Out, Register out (ptr32 Eq_209174) a5Out)
// Called from:
//      lwip_netconn_do_delconn
//      ping_free
Eq_2 raw_remove(Eq_2 a0, Eq_2 a3, Eq_2 a5, ptr32 mstatus, ptr32 & a2Out, ptr32 & a3Out, byte & a4Out, struct Eq_209174 & a5Out)
{
	Eq_2 a4_6 = *a5;
	Eq_2 a1_15 = a0;
	if (a5 == a0)
		*a5 = a4_6;
	else
	{
		while (a5 != 0x00)
		{
			Eq_2 a5_12 = *((word32) a4_6 + 0x0C);
			if (a4_6 == 0x00)
				break;
			if (a4_6 == a0)
			{
				a1_15 = *((word32) a4_6 + 0x0C);
				*((word32) a4_6 + 0x0C) = a5_12;
				break;
			}
			a5 = a4_6;
		}
	}
	struct Eq_209174 * a5_28;
	Eq_2 a0_29;
	ptr32 a2_30;
	ptr32 a3_31;
	byte * a4_32;
	memp_free(0x00, a1_15, a3, a4_6, mstatus, out a0_29, out a2_30, out a3_31, out a4_32, out a5_28);
	a2Out = a2_30;
	a3Out = a3_31;
	a4Out = a4_32;
	a5Out = a5_28;
	return a0_29;
}

// 23041208: Register Eq_2 raw_new(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_209220) a4Out, Register out ptr32 a5Out)
// Called from:
//      raw_new_ip_type
//      ping_api_init
Eq_2 raw_new(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_209220 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_16;
	word32 a2_75;
	ptr32 a3_19;
	struct Eq_209220 * a4_20;
	ptr32 a5_17;
	Eq_2 s1_21 = memp_malloc(a0, 0x00, a3, a4, mstatus, out a0_16, out a2_75, out a3_19, out a4_20, out a5_17);
	if (a0_16 != 0x00)
	{
		word32 t1_76;
		word32 a0_77;
		word32 a1_78;
		word32 a2_79;
		word32 a5_80;
		ra = memset(ra, a0_16, 0x00, 0x1C, out t1_76, out a0_77, out a1_78, out a2_79, out a3_19, out a4_20, out a5_80);
		((word32) a0_16 + 11)->u1 = ~0x00;
		((word32) a0_16 + 19)->u1 = ~0x00;
		a5_17 = a4_20->ptr0000;
		((word32) a0_16 + 16)->u1 = (byte) s1_21;
		*a0_16 = a5_17;
		a4_20->t000C = a0_16;
	}
	s1Out = s1_21;
	a2Out = dwArg10;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_17;
	return ra;
}

// 2304124C: Register word32 raw_new_ip_type(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out (ptr32 Eq_209285) a5Out)
// Called from:
//      lwip_netconn_do_newconn
word32 raw_new_ip_type(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a4Out, struct Eq_209285 & a5Out)
{
	ptr32 a2_9;
	ptr32 a4_11;
	struct Eq_209285 * a5_12;
	word32 s1_13;
	word32 a3_23;
	raw_new(ra, a1, a3, a4, mstatus, out s1_13, out a2_9, out a3_23, out a4_11, out a5_12);
	a0Out = a1;
	a2Out = a2_9;
	a4Out = a4_11;
	a5Out = a5_12;
	return s1_13;
}

// 23041252: void raw_netif_ip_addr_changed(Register word32 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
void raw_netif_ip_addr_changed(word32 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, word32 a5)
{
	if (a0 != 0x00 && (a5 != 0x00 && (a1 != 0x00 && a5 != 0x00)))
	{
		struct Eq_203500 * a5_10 = g_ptr4200DF7C;
		while (a5_10 != null)
		{
			struct Eq_209310 * a5_14 = *a3;
			if (a3 == a4)
				*a4 = a5_14;
			a5_10 = a5_14->ptr000C;
		}
	}
}

// 2304127A: void raw_get_pcbs()
// Called from:
//      stats_netstat
void raw_get_pcbs()
{
}

// 23041284: void stats_init()
// Called from:
//      lwip_init
void stats_init()
{
}

// 23041286: void stats_netstat(Register Eq_2 ra, Register (ptr32 Eq_209324) s0)
void stats_netstat(Eq_2 ra, struct Eq_209324 * s0)
{
	Eq_2 a3_26;
	word32 t1_527;
	word32 a0_528;
	word32 a1_529;
	word32 a2_530;
	word32 a4_531;
	word32 a5_532;
	Eq_2 ra_29 = memset(ra, fp + -0x00A0, 0x00, 0x0080, out t1_527, out a0_528, out a1_529, out a2_530, out a3_26, out a4_531, out a5_532);
	tcp_get_pcbs(fp + -0x00A4);
	udp_get_pcbs();
	raw_get_pcbs();
	word32 a0_533;
	word32 a1_534;
	word32 a2_535;
	word32 a3_536;
	word32 a4_537;
	word32 a5_538;
	word32 a7_539;
	word32 s3_540;
	word32 s5_541;
	word32 s6_542;
	word32 s7_543;
	word32 s8_544;
	word32 s9_545;
	word32 s10_546;
	word32 s11_547;
	word32 t4_548;
	int32 s4_166;
	word32 s1_161;
	int32 s2_164;
	Eq_2 ra_104 = printf(ra_29, &g_t23086328, a3_26, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_161, out a0_533, out a1_534, out a2_535, out a3_536, out a4_537, out a5_538, out a7_539, out s2_164, out s3_540, out s4_166, out s5_541, out s6_542, out s7_543, out s8_544, out s9_545, out s10_546, out s11_547, out t4_548);
	int32 s3_165;
	word32 s5_102 = 0x23086000;
	for (s3_165 = 0x00; s3_165 < s4_166; ++s3_165)
	{
		for (; s0 != null; s0 = s0->ptr000C)
		{
			Eq_2 a3_87;
			word32 a4_628;
			word32 a5_629;
			ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_87, out a4_628, out a5_629);
			word32 s6_121;
			word32 s1_630;
			word32 a0_631;
			word32 a1_632;
			word32 a2_633;
			word32 a3_634;
			word32 a4_635;
			word32 a5_636;
			word32 a7_637;
			word32 s2_638;
			word32 s3_639;
			word32 s4_640;
			word32 s5_641;
			word32 s7_642;
			word32 s8_643;
			word32 s9_644;
			word32 s10_645;
			word32 s11_646;
			word32 t4_647;
			Eq_2 ra_113 = printf(ra_104, s5_102 + 0x0338, a3_87, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_630, out a0_631, out a1_632, out a2_633, out a3_634, out a4_635, out a5_636, out a7_637, out s2_638, out s3_639, out s4_640, out s5_641, out s6_121, out s7_642, out s8_643, out s9_644, out s10_645, out s11_646, out t4_647);
			word32 a3_648;
			word32 a4_649;
			word32 a5_650;
			ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_648, out a4_649, out a5_650);
			word32 a0_651;
			word32 a1_652;
			word32 a2_653;
			word32 a3_654;
			word32 a4_655;
			word32 a5_656;
			word32 a7_657;
			word32 s6_658;
			word32 s7_659;
			word32 s8_660;
			word32 s9_661;
			word32 s10_662;
			word32 s11_663;
			word32 t4_664;
			ra_104 = printf(ra_113, s6_121 + 0x0344, tcp_debug_state_str((word32) s0->b0014), dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_161, out a0_651, out a1_652, out a2_653, out a3_654, out a4_655, out a5_656, out a7_657, out s2_164, out s3_165, out s4_166, out s5_102, out s6_658, out s7_659, out s8_660, out s9_661, out s10_662, out s11_663, out t4_664);
		}
	}
	while (s1_161 != 0x00)
	{
		Eq_2 a3_185;
		word32 a4_549;
		word32 a5_550;
		ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_185, out a4_549, out a5_550);
		word32 s3_216;
		word32 s1_551;
		word32 a0_552;
		word32 a1_553;
		word32 a2_554;
		word32 a3_555;
		word32 a4_556;
		word32 a5_557;
		word32 a7_558;
		word32 s2_559;
		word32 s4_560;
		word32 s5_561;
		word32 s6_562;
		word32 s7_563;
		word32 s8_564;
		word32 s9_565;
		word32 s10_566;
		word32 s11_567;
		word32 t4_568;
		Eq_2 ra_211 = printf(ra_104, &g_t23086350, a3_185, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_551, out a0_552, out a1_553, out a2_554, out a3_555, out a4_556, out a5_557, out a7_558, out s2_559, out s3_216, out s4_560, out s5_561, out s6_562, out s7_563, out s8_564, out s9_565, out s10_566, out s11_567, out t4_568);
		Eq_2 a3_229;
		word32 a4_569;
		word32 a5_570;
		ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_229, out a4_569, out a5_570);
		struct Eq_209475 * s1_253;
		word32 a0_571;
		word32 a1_572;
		word32 a2_573;
		word32 a3_574;
		word32 a4_575;
		word32 a5_576;
		word32 a7_577;
		word32 s3_578;
		word32 s4_579;
		word32 s5_580;
		word32 s6_581;
		word32 s7_582;
		word32 s8_583;
		word32 s9_584;
		word32 s10_585;
		word32 s11_586;
		word32 t4_587;
		ra_104 = printf(ra_211, s3_216 + 860, a3_229, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_253, out a0_571, out a1_572, out a2_573, out a3_574, out a4_575, out a5_576, out a7_577, out s2_164, out s3_578, out s4_579, out s5_580, out s6_581, out s7_582, out s8_583, out s9_584, out s10_585, out s11_586, out t4_587);
		s1_161 = s1_253->dw000C;
	}
	while (s2_164 != 0x00)
	{
		Eq_2 a3_275;
		word32 a4_588;
		word32 a5_589;
		ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_275, out a4_588, out a5_589);
		word32 s1_301;
		word32 a0_590;
		word32 a1_591;
		word32 a2_592;
		word32 a3_593;
		word32 a4_594;
		word32 a5_595;
		word32 a7_596;
		word32 s2_597;
		word32 s3_598;
		word32 s4_599;
		word32 s5_600;
		word32 s6_601;
		word32 s7_602;
		word32 s8_603;
		word32 s9_604;
		word32 s10_605;
		word32 s11_606;
		word32 t4_607;
		Eq_2 ra_300 = printf(ra_104, &g_t23086368, a3_275, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_301, out a0_590, out a1_591, out a2_592, out a3_593, out a4_594, out a5_595, out a7_596, out s2_597, out s3_598, out s4_599, out s5_600, out s6_601, out s7_602, out s8_603, out s9_604, out s10_605, out s11_606, out t4_607);
		Eq_2 a3_318;
		word32 a4_608;
		word32 a5_609;
		ip4addr_ntoa_r(fp + -0x00A0, 0x0080, out a3_318, out a4_608, out a5_609);
		struct Eq_209583 * s2_345;
		word32 s1_610;
		word32 a0_611;
		word32 a1_612;
		word32 a2_613;
		word32 a3_614;
		word32 a4_615;
		word32 a5_616;
		word32 a7_617;
		word32 s3_618;
		word32 s4_619;
		word32 s5_620;
		word32 s6_621;
		word32 s7_622;
		word32 s8_623;
		word32 s9_624;
		word32 s10_625;
		word32 s11_626;
		word32 t4_627;
		ra_104 = printf(ra_300, s1_301 + 880, a3_318, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_610, out a0_611, out a1_612, out a2_613, out a3_614, out a4_615, out a5_616, out a7_617, out s2_345, out s3_618, out s4_619, out s5_620, out s6_621, out s7_622, out s8_623, out s9_624, out s10_625, out s11_626, out t4_627);
		s2_164 = s2_345->dw000C;
	}
}

// 230413C8: Register word32 tcp_new_port(Register Eq_2 a2, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tcp_bind
//      tcp_connect
word32 tcp_new_port(Eq_2 a2, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	word32 a5_11 = (word32) g_w4200D950;
	word32 a0_34 = 0x04000000;
l230413DE:
	a5_11 = (word32) (word16) (a5_11 + 0x01);
	if (a5_11 == 0x0FFFFFFF)
		a5_11 = 0x0C000000;
	do
	{
		Eq_2 a3_23 = *a2;
		a2 = *a2;
		while (a2 != 0x00)
		{
			if ((word32) *((word32) a2 + 22) == a5_11)
			{
				a0_34 = (word32) (word16) (a0_34 + ~0x00);
				if (a0_34 != 0x00)
					goto l230413DE;
				g_w4200D950 = (word16) a5_11;
				a3Out = a3_23;
				a4Out.u0 = <invalid>;
				a5Out.u0 = <invalid>;
				return a0_34;
			}
			a2 = *((word32) a2 + 0x0C);
		}
	} while (a3_23 != 3707214788);
	g_w4200D950 = (word16) a5_11;
	a3Out = (word32) a3_23 + 4;
	a4Out.u0 = <invalid>;
	a5Out.u0 = <invalid>;
	return a5_11;
}

// 23041420: Register Eq_2 tcp_close_shutdown_fin(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_209825) a4Out, Register out Eq_2 a5Out, Register out (ptr32 byte) s2Out, Register out (ptr32 Eq_209828) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_new_ip_type
//      tcp_fasttmr
//      tcp_shutdown
Eq_2 tcp_close_shutdown_fin(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_209825 & a4Out, union Eq_2 & a5Out, byte & s2Out, struct Eq_209828 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_16;
	word32 a5_14;
	struct Eq_209825 * a4_154 = (word32) *((word32) a0 + 20);
	if (a4_154 != (struct Eq_209825 *) 0x04)
	{
		if (a4_154 == (struct Eq_209825 *) 0x07)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg36 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg152 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg216 = <invalid>;
			Eq_2 stackArg248 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg312 = <invalid>;
			tcp_send_fin(ra, s1, a3, a5, mstatus, stackArg36, stackArg56, stackArg136, stackArg152, stackArg184, stackArg200, stackArg216, stackArg248, stackArg264, stackArg312);
			if (a0 == 0x00)
			{
				a5_14 = 0x09;
l2304144A:
				((word32) a0 + 20)->u1 = (byte) a5_14;
				word32 a5_289;
				word32 a0_287;
				word32 a2_288;
				word32 s0_286;
				ra = tcp_output(ra, s1, a0, a2, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s0_286, out s1, out a0_287, out a2_288, out a3, out a4_154, out a5_289, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
				goto l23041454;
			}
l2304146C:
			a5_16 = a0;
			a4_154 = (struct Eq_209825 *) ~0x00;
			if (a0 != ~0x00)
			{
l23041456:
				s1Out = s1;
				a0Out = a5_16;
				a2Out = dwArg10;
				a3Out = a3;
				a4Out = a4_154;
				a5Out = a5_16;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				s8Out = s8;
				s9Out = s9;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus;
				return ra;
			}
			*((word32) a0 + 26) = (word16) ((word32) *((word32) a0 + 26) | 8);
l23041454:
			a5_16.u0 = 0x00;
			goto l23041456;
		}
		a3.u0 = 0x03;
		a5_16.u0 = 0x00;
		if (a4_154 != (struct Eq_209825 *) 0x03)
			goto l23041456;
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg56 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg200 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	tcp_send_fin(ra, s1, a3, a5, mstatus, stackArg36, stackArg56, stackArg136, stackArg152, stackArg184, stackArg200, stackArg216, stackArg248, stackArg264, stackArg312);
	if (a0 == 0x00)
	{
		a5_14 = 0x05;
		goto l2304144A;
	}
	goto l2304146C;
}

