pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23041480: Register Eq_2 tcp_init(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_52584) a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      lwip_init
Eq_2 tcp_init(Eq_2 ra, Eq_2 a0, struct Eq_52584 * a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out)
{
	word32 a0_8;
	Eq_2 a3_10;
	word32 a1_63;
	word32 a4_64;
	word32 a5_65;
	word32 s4_66;
	bl_rand(a0, a2, out a0_8, out a1_63, out a3_10, out a4_64, out a5_65, out s4_66);
	g_w4200E950 = (word16) (word32) (word16) ((word32) (word14) a0_8 + 0xFC000000);
	ptr32 a0_31;
	ptr32 a3_36;
	ptr32 s1_40;
	word32 a1_67;
	word32 a2_68;
	word32 a4_69;
	word32 a5_70;
	word32 a7_71;
	word32 s2_72;
	word32 s3_73;
	word32 s4_74;
	word32 s5_75;
	word32 s6_76;
	word32 s7_77;
	word32 s8_78;
	word32 s9_79;
	word32 s10_80;
	word32 s11_81;
	word32 t4_82;
	Eq_2 ra_39 = printf(ra, &g_t23086400, a3_10, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_40, out a0_31, out a1_67, out a2_68, out a3_36, out a4_69, out a5_70, out a7_71, out s2_72, out s3_73, out s4_74, out s5_75, out s6_76, out s7_77, out s8_78, out s9_79, out s10_80, out s11_81, out t4_82);
	s1Out = s1_40;
	a0Out = a0_31;
	a3Out = a3_36;
	return ra_39;
}

// 230414AE: Register Eq_2 tcp_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_210023) a0Out, Register out Eq_2 a1Out, Register out Eq_210025 a2Out, Register out Eq_210026 a3Out, Register out Eq_210027 a4Out, Register out Eq_210028 a5Out)
// Called from:
//      tcp_listen_with_backlog_and_err
//      tcp_abort
//      tcp_shutdown
//      tcp_tmr
//      tcp_input_delayed_close
//      tcp_input
Eq_2 tcp_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_191560 & a0Out, union Eq_2 & a1Out, union Eq_210025 & a2Out, union Eq_210026 & a3Out, union Eq_210026 & a4Out, union Eq_210028 & a5Out)
{
	Eq_210028 a5_9;
	struct Eq_191560 * a0_10;
	Eq_210025 a2_11;
	Eq_210026 a3_12;
	Eq_210027 a4_13;
	Eq_2 s1_14 = memp_free(0x02, a0, a3, a4, mstatus, out a0_10, out a2_11, out a3_12, out a4_13, out a5_9);
	a0Out = a0_10;
	a1Out = a0;
	a2Out = a2_11;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_9;
	return s1_14;
}

// 230414B6: Register Eq_2 tcp_bind(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Register out Eq_2 a4Out)
// Called from:
//      altcp_tcp_bind
//      lwip_netconn_do_bind
Eq_2 tcp_bind(Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg44, union Eq_2 & a4Out)
{
	if (a1 == 0x00)
		a1.u0 = 587783820;
	Eq_2 a0_128 = ~0x0F;
	if (a0 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 20);
		a0_128.u0 = ~0x05;
		if (a4 != 0x00)
			goto l230414F0;
		ui32 a3_18 = (word32) *((word32) a0 + 9);
		Eq_2 a3_110 = a3_18 & 0x04;
		word32 a6_20 = (word32) ((a3_18 & 0x04) < 1);
		if (a2 == 0x00)
		{
			tcp_new_port(a2, out a3_110, out a4, out a5);
			a2 = dwArg44;
			a0_128.u0 = ~0x01;
			if (dwArg44 == 0x00)
				goto l230414F0;
		}
		else
		{
			word32 a0_26 = 0x00;
			do
			{
				a4 = *a5;
				a5 = *a5;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == a2 && ((a3_18 & 0x04) == 0x00 || ((word32) (*((word32) a5 + 9)) & 4) == 0x00))
					{
						Eq_2 t1_40 = *a5;
						if (t1_40 != 0x00)
						{
							Eq_2 a7_43 = *a1.u0;
							if (a7_43 != 0x00 && t1_40 != a7_43)
								goto l2304155A;
						}
						a0_128.u0 = ~0x07;
						goto l230414F0;
					}
l2304155A:
					a5 = *((word32) a5 + 0x0C);
				}
				++a0_26;
			} while (a6_20 + 0x03 != a0_26);
		}
		if (a5 != 0x00)
			*a5 = a0;
		Eq_2 a4_86 = g_t4201FEB0;
		*((word32) a0 + 22) = (word16) a2;
		*(union Eq_2 *) 0x42020EB0 = a0;
		*((word32) a4_86 + 0x0C) = a0;
		word32 a0_233;
		word32 a3_235;
		word32 a2_234;
		word32 s1_232;
		word32 s8_236;
		tcp_timer_needed(s1, a3_110, mstatus, dwArg24, out s1_232, out a0_233, out a2_234, out a3_235, out a4, out s8_236);
		a0_128.u0 = 0x00;
	}
l230414F0:
	a4Out = a4;
	return a0_128;
}

// 23041562: Register ui32 tcp_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 tcp_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	((word32) a0 + 8)->u1 = (byte) a5_3;
	return a5_3;
}

// 23041576: Register Eq_2 tcp_listen_with_backlog_and_err(Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      altcp_tcp_listen
//      lwip_netconn_do_listen
Eq_2 tcp_listen_with_backlog_and_err(Eq_2 s1, Eq_2 a0, byte * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	Eq_2 s1_132;
	ptr32 a5_136;
	if (a0 != 0x00)
	{
		Eq_2 s0_161 = a0;
		if ((word32) *((word32) a0 + 20) == 0x00)
		{
			if (((word32) *((word32) a0 + 9) & 0x04) != 0x00)
			{
				Eq_2 a5_23 = g_t4201FEA8;
				while (a5_23 != 0x00)
				{
					a3 = (word32) *((word32) a5_23 + 22);
					a4 = (word32) *((word32) s0_161 + 22);
					if (a3 == a4)
					{
						a5_23 = *a3;
						s0_161 = *a4.u0;
						if (a3 == a4)
						{
							a5_136 = ~0x07;
							goto l2304166A;
						}
					}
					a5_23 = *((word32) a5_23 + 0x0C);
				}
			}
			word32 a5_246;
			Eq_2 a0_52;
			word32 a2_245;
			memp_malloc(s1, 0x03, a3, a4, mstatus, out a0_52, out a2_245, out a3, out a4, out a5_246);
			s1_132 = a0_52;
			a5_136 = ~0x00;
			if (a0_52 != 0x00)
			{
				Eq_2 s0_62 = *(union Eq_2 *) 0x0F;
				*(union Eq_2 *) 0x0F = a0_52;
				*((word32) a0_52 + 22) = (word16) (word32) *((word32) s0_62 + 22);
				((word32) a0_52 + 20)->u1 = 0x01;
				*((word32) a0_52 + 21) = (byte) (word32) *((word32) s0_62 + 21);
				word32 a5_70 = (word32) *((word32) s0_62 + 9);
				((word32) a0_52 + 8)->u1 = 0x00;
				((word32) a0_52 + 9)->u1 = (byte) a5_70;
				((word32) a0_52 + 11)->u1 = (byte) (word32) *((word32) s0_62 + 11);
				union Eq_2 * a5_75 = (word32) *((word32) s0_62 + 0x0A);
				((word32) a0_52 + 0x0A)->u1 = (byte) a5_75;
				Eq_2 s0_77 = *a5_75;
				*a5_75 = (union Eq_2 *) a0_52;
				if ((word32) *((word32) s0_77 + 22) != 0x00)
				{
					a4.u0 = 0x42020000;
					Eq_2 a5_81 = g_t4201FEB0;
					if (a5_81 == s0_77)
					{
						s0_77 = *((word32) a5_81 + 0x0C);
						*(union Eq_2 *) 0x42020EB0 = a5_81;
					}
					else
					{
						while (a5_81 != 0x00)
						{
							Eq_2 a5_85 = g_t4202000C;
							if (s0_77 == 0x42020000)
							{
								s0_77 = g_t4202000C;
								g_t4202000C = a5_85;
								break;
							}
							a5_81.u0 = 0x42020000;
						}
					}
					*((word32) s0_77 + 0x0C) = 0x00;
				}
				word32 a5_251;
				word32 a1_248;
				word32 a4_250;
				word32 a0_247;
				Eq_2 a3_107;
				word32 a2_249;
				Eq_2 s1_110 = tcp_free(s0_77, a3, a4, mstatus, out a0_247, out a1_248, out a2_249, out a3_107, out a4_250, out a5_251);
				g_t23041BDE = s1_110;
				Eq_2 a4_116 = g_t4201FEA8;
				*(union Eq_2 *) 0x42020EA8 = s1_110;
				*((word32) a4_116 + 0x0C) = s1_110;
				word32 a0_252;
				word32 a2_253;
				word32 s8_254;
				tcp_timer_needed(s1_110, a3_107, mstatus, dwArg34, out s1_132, out a0_252, out a2_253, out a3, out a4, out s8_254);
				a5_136 = 0x00;
			}
		}
		else
		{
			a5_136 = ~0x0E;
l2304166A:
			s1_132.u0 = 0x00;
		}
	}
	else
	{
		s1_132.u0 = 0x00;
		a5_136 = ~0x0F;
	}
	if (a2 != null)
		*a2 = (byte) a5_136;
	0x00 = (uint16) dwArg38;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_136;
	return s1_132;
}

// 23041672: Register Eq_2 tcp_update_rcv_ann_wnd(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_210396 a4Out, Register out Eq_2 a5Out)
// Called from:
//      tcp_recved
//      tcp_receive
Eq_2 tcp_update_rcv_ann_wnd(Eq_2 a0, Eq_2 a2, Eq_2 a3, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_210396 & a4Out, union Eq_2 & a5Out)
{
	word32 a1_6 = (word32) *((word32) a0 + 40);
	Eq_210403 a4_11 = (word32) *((word32) a0 + 50);
	Eq_2 a0_14 = (word32) a2 + (a1_6 - a3);
	if (a4_11 > 0x0408)
		a4_11.u0 = 0x0408;
	Eq_210396 a4_20 = a0_14 - (word32) ((word16) a4_11);
	if (a4_20 < 0x00)
	{
		Eq_210396 a4_23 = a2 - a3;
		if (a4_23 > 0x00)
			((word32) a0 + 42)->u0 = 0x00;
		else
		{
			a3 -= a2;
			*((word32) a0 + 42) = (word16) a3;
		}
		a1Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4_23;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
	else
	{
		*((word32) a0 + 42) = (word16) a1_6;
		a1Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4_20;
		a5Out.u0 = <invalid>;
		return a0_14;
	}
}

// 230416BC: Register Eq_2 tcp_recved(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_192264) a4Out, Register out (ptr32 byte) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_recved
//      tcp_recv_null
//      recv_tcp
//      lwip_netconn_do_recv
Eq_2 tcp_recved(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, struct Eq_192264 & a4Out, byte & a5Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		up32 a4_9 = (word32) *((word32) a0 + 40);
		up32 a1_15 = (word32) (word16) (a1 + a4_9);
		if (a1_15 > 0x00FFF810 || a1_15 < a4_9)
			a1_15 = 0x00FFF810;
		*((word32) a0 + 40) = (word16) a1_15;
		Eq_2 a3_31;
		struct Eq_192264 * a4_32;
		word32 a1_235;
		word32 a5_236;
		Eq_2 a0_29 = tcp_update_rcv_ann_wnd(a0, a2, a3, out a1_235, out a3_31, out a4_32, out a5_236);
		if (a0_29 <= 1031)
		{
			s0Out = s0;
			s1Out = s1;
			a0Out = a0_29;
			a2Out = dwArg10;
			a3Out = a3_31;
			a4Out = a4_32;
			a5Out = (byte *) 1031;
			s3Out = s3;
			s4Out = s4;
			s7Out = s7;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			*((word32) a0 + 26) = (word16) ((word32) *((word32) a0 + 26) | 2);
			Eq_2 a0_59;
			byte * a5_60;
			Eq_2 a2_61;
			Eq_2 a3_62;
			struct Eq_192264 * a4_63;
			ptr32 s0_66;
			Eq_2 s1_67;
			ptr32 s4_69;
			ptr32 s10_76;
			ptr32 s11_77;
			ptr32 s3_78;
			Eq_2 s7_79;
			ptr32 s9_80;
			ptr32 mstatus_87;
			word32 s6_239;
			word32 s8_240;
			word32 s2_237;
			word32 s5_238;
			Eq_2 ra_65 = tcp_output(ra, s1, a0, dwArg10, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_66, out s1_67, out a0_59, out a2_61, out a3_62, out a4_63, out a5_60, out s2_237, out s3_78, out s4_69, out s5_238, out s6_239, out s7_79, out s8_240, out s9_80, out s10_76, out s11_77, out mstatus_87);
			s0Out = s0_66;
			s1Out = s1_67;
			a0Out = a0_59;
			a2Out = a2_61;
			a3Out = a3_62;
			a4Out = a4_63;
			a5Out = a5_60;
			s3Out = s3_78;
			s4Out = s4_69;
			s7Out = s7_79;
			s9Out = s9_80;
			s10Out = s10_76;
			s11Out = s11_77;
			mstatusOut = mstatus_87;
			return ra_65;
		}
	}
}

// 23041712: Register Eq_2 tcp_seg_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0108, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_210539) a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_210542) a5Out)
// Called from:
//      tcp_segs_free
//      tcp_oos_insert_segment
//      tcp_free_acked_segments.isra.3
//      tcp_receive
//      tcp_input
//      tcp_create_segment
//      tcp_output
Eq_2 tcp_seg_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0108, union Eq_2 & a0Out, union Eq_2 & a1Out, struct Eq_210539 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_210542 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a1_21 = a0;
		Eq_2 a0_6 = *((word32) a0 + 4);
		if (a0_6 != 0x00)
		{
			word32 s0_130;
			word32 s1_131;
			word32 a0_132;
			word32 a2_133;
			word32 a5_134;
			word32 a7_135;
			word32 s2_136;
			word32 s3_137;
			word32 s4_138;
			word32 s5_139;
			word32 s6_140;
			word32 s8_141;
			pbuf_free(ra, a0_6, a3, a4, s4, mstatus, dwArg0108, out s0_130, out s1_131, out a0_132, out a1_21, out a2_133, out a3, out a4, out a5_134, out a7_135, out s2_136, out s3_137, out s4_138, out s5_139, out s6_140, out s8_141, out mstatus);
		}
		struct Eq_210542 * a5_50;
		Eq_2 a0_51;
		struct Eq_210539 * a2_52;
		Eq_2 a3_53;
		Eq_2 a4_54;
		Eq_2 s1_55 = memp_free(0x04, a1_21, a3, a4, mstatus, out a0_51, out a2_52, out a3_53, out a4_54, out a5_50);
		a0Out = a0_51;
		a1Out = a1_21;
		a2Out = a2_52;
		a3Out = a3_53;
		a4Out = a4_54;
		a5Out = a5_50;
		return s1_55;
	}
}

