pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23041736: Register Eq_2 tcp_segs_free(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_210612) a5Out)
// Called from:
//      tcp_free_ooseq
//      tcp_pcb_purge
//      tcp_abort
//      tcp_oos_insert_segment
//      tcp_write
Eq_2 tcp_segs_free(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgF8, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_210612 & a5Out)
{
	if (a0 != 0x00)
	{
		do
		{
			ptr32 a1_19;
			struct Eq_210612 * a5_23;
			word32 a0_61;
			word32 a2_62;
			Eq_2 s1_24 = tcp_seg_free(ra, *s0, a3, a4, s4, mstatus, dwArgF8, out a0_61, out a1_19, out a2_62, out a3, out a4, out a5_23);
		} while (s0 != 0x00);
		a0Out = s0;
		a1Out = a1_19;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_23;
		return s1_24;
	}
	else
	{
		a0Out = a0;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
}

// 23041752: void tcp_setprio(Register (ptr32 Eq_191483) a0, Register word32 a1)
// Called from:
//      altcp_tcp_setprio
void tcp_setprio(struct Eq_191483 * a0, word32 a1)
{
	if (a0 != null)
		a0->b0015 = (byte) a1;
}

// 2304175A: Register Eq_2 tcp_seg_copy(Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      tcp_receive
Eq_2 tcp_seg_copy(Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_15;
	word32 a2_86;
	ptr32 a3_18;
	ptr32 a4_19;
	ptr32 a5_16;
	Eq_2 s1_20 = memp_malloc(s1, 0x04, a3, a4, mstatus, out a0_15, out a2_86, out a3_18, out a4_19, out a5_16);
	Eq_2 s0_22 = a0_15;
	if (a0_15 != 0x00)
	{
		Eq_2 a4_26;
		Eq_2 a3_31;
		word32 a1_87;
		word32 a2_88;
		word32 a5_89;
		word32 a6_90;
		word32 a7_91;
		memcpy(a0_15, a1, 0x14, out a1_87, out a2_88, out a3_31, out a4_26, out a5_89, out a6_90, out a7_91);
		s0_22 = *((word32) a0_15 + 4);
		pbuf_ref(a0_15, a3_31, a4_26, mstatus, out a3_18, out a4_19, out a5_16);
	}
	s1Out = s1_20;
	a0Out = s0_22;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_16;
	return s0_22;
}

// 23041784: void tcp_arg(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
//      setup_tcp
//      accept_function
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
void tcp_arg(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a1 + 16) = a0;
}

// 2304178A: void tcp_recv(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
void tcp_recv(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 0x0084) = a1;
}

// 23041792: void tcp_sent(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
void tcp_sent(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 0x0080) = a1;
}

// 2304179A: void tcp_err(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_tcp_setup_callbacks
//      altcp_tcp_close
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
void tcp_err(Eq_2 a0, Eq_2 a1)
{
	if (a0 != 0x00)
		*((word32) a0 + 144) = a1;
}

// 230417A2: Register word32 tcp_accept(Register Eq_2 a0, Register (ptr32 Eq_192082) a1)
// Called from:
//      altcp_tcp_listen
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
word32 tcp_accept(Eq_2 a0, struct Eq_192082 * a1)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *((word32) a0 + 20);
		if (a4 == 0x01)
			a1->t0018 = a0;
	}
	return a4;
}

// 230417B2: void tcp_poll(Register Eq_2 a0, Register word32 a1, Register Eq_2 a2)
// Called from:
//      altcp_tcp_close
//      altcp_tcp_set_poll
//      setup_tcp
//      accept_function
//      lwip_netconn_do_close
void tcp_poll(Eq_2 a0, word32 a1, Eq_2 a2)
{
	if (a0 != 0x00)
	{
		*((word32) a0 + 0x008C) = a1;
		((word32) a0 + 29)->u1 = (byte) a2;
	}
}

// 230417BE: Register Eq_2 tcp_next_iss(Register Eq_2 a0)
// Called from:
//      tcp_connect
//      tcp_input
Eq_2 tcp_next_iss(Eq_2 a0)
{
	word32 a0_9 = a0 + Mem0[0x4201FEA4:int32];
	*a0_9 = *a0;
	return a0_9;
}

// 230417D6: Register (ptr32 int32) tcp_eff_send_mss_netif(Register (ptr32 int32) a0, Register Eq_2 a1, Register out Eq_210749 a3Out)
// Called from:
//      tcp_connect
//      tcp_input
//      tcp_output
int32 * tcp_eff_send_mss_netif(int32 * a0, Eq_2 a1, union Eq_210749 & a3Out)
{
	if (a1 != 0x00)
	{
		Eq_210753 a5_5 = (word32) *((word32) a1 + 56);
		if (a5_5 != 0x00)
		{
			a3.u0 = 40;
			int32 * a4_11 = null;
			if (a5_5 > 40)
			{
				uint32 a5_9 = (word32) a5_5.u1 - 40 << 16;
				a4_11 = a5_9 >> 16;
				if (a0 < a5_9 >> 16)
					a4_11 = a0;
			}
			a0 = (word32) (word16) a4_11;
		}
	}
	a3Out = a3;
	return a0;
}

// 23041800: Register Eq_2 tcp_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_connect
//      lwip_netconn_do_connect
Eq_2 tcp_connect(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_104 = ~0x0F;
	if (a0 != 0x00 && a1 != 0x00)
	{
		a5 = (word32) *((word32) a0 + 20);
		s1_104.u0 = ~0x09;
		if (a5 != 0x00)
			goto l2304185C;
		Eq_2 a3_310;
		Eq_2 a2_40;
		Eq_2 a0_36;
		Eq_2 a1_25 = *a5;
		*((word32) a5 + 4) = a0;
		*((word32) a0 + 24) = (word16) a2;
		Eq_2 a0_32 = (word32) *((word32) a0 + 8);
		if (a0_32 != 0x00)
		{
			a0_36 = netif_get_by_index(a0_32, out a4, out a5);
			a2_40 = a2;
			a3_310 = a3;
		}
		else
			a0_36 = ip4_route(a2, a5, out a2_40, out a3_310, out a4, out a5);
		s1_104.u0 = ~0x03;
		if (a0_36 != 0x00)
		{
			Eq_2 s0_105 = *a5;
			if (a5 == 0x00)
				*a5 = s0_105;
			word32 s5_54 = (word32) *((word32) s0_105 + 22);
			if (s5_54 == 0x00)
			{
				word32 a3_664;
				word32 a0_94 = tcp_new_port(a2_40, out a3_664, out a4, out a5);
				*((word32) s0_105 + 22) = (word16) a0_94;
				s1_104.u0 = ~0x01;
				if (a0_94 == 0x00)
					goto l2304185C;
			}
			else if (((word32) *((word32) s0_105 + 9) & 0x04) != 0x00)
			{
				a5 = g_t4201FEAC;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == s5_54)
					{
						Eq_2 a4_80 = (word32) *((word32) a5 + 24);
						if (a4_80 == a2)
						{
							a5 = *a3_310;
							s0_105 = *a4_80;
							if (a3_310 == a4_80)
							{
								a5 = *((word32) a3_310 + 4);
								a4 = *a1_25;
								if (a3_310 == a4)
								{
l230418B4:
									s1_104.u0 = ~0x07;
									goto l2304185C;
								}
							}
						}
					}
					a5 = *((word32) a5 + 0x0C);
				}
				a5 = g_t4201FEA0;
				while (a5 != 0x00)
				{
					if ((word32) *((word32) a5 + 22) == s5_54)
					{
						Eq_2 a4_67 = (word32) *((word32) a5 + 24);
						if (a4_67 == a2)
						{
							a5 = *a3_310;
							s0_105 = *a4_67;
							if (a3_310 == a4_67)
							{
								a5 = *((word32) a3_310 + 4);
								a4 = *a1_25;
								if (a3_310 == a4)
									goto l230418B4;
							}
						}
					}
					a5 = *((word32) a5 + 0x0C);
				}
			}
			struct Eq_210862 * a0_111 = tcp_next_iss(s0_105);
			*(union Eq_2 *) 0x08100838 = s0_105;
			a0_111->t0050 = s0_105;
			*((word32) s0_105 + 96) = 0xF810;
			a0_111->t0043 = s0_105;
			a0_111->t0057 = s0_105;
			a0_111->t005B = s0_105;
			((word32) s0_105 + 50)->u0 = 0x0218;
			((word32) s0_105 + 36)->u0 = 0x00;
			((word32) s0_105 + 44)->u0 = 0x00;
			Eq_2 a3_140;
			*((word32) s0_105 + 50) = (word16) tcp_eff_send_mss_netif((int32 *) 536, a0_36, out a3_140);
			((word32) s0_105 + 72)->u0 = 0x01;
			*((word32) s0_105 + 0x0088) = a3;
			Eq_2 a0_177;
			Eq_2 a3_180;
			word32 s5_192;
			word32 a2_666;
			word32 s1_665;
			word32 s3_667;
			word32 s4_668;
			Eq_2 s0_187;
			Eq_2 ra_186 = tcp_enqueue_flags(ra, s0_105, 0x02, a3_140, mstatus, dwArg04, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_187, out s1_665, out a0_177, out a2_666, out a3_180, out a4, out a5, out s3_667, out s4_668, out s5_192, out mstatus);
			s1_104 = a0_177;
			if (a0_177 == 0x00)
			{
				((word32) s0_187 + 20)->u1 = 0x02;
				if (s5_192 != 0x00)
				{
					Eq_2 a5_206 = g_t4201FEB0;
					if (a5_206 == s0_187)
					{
						s0_187 = *((word32) a5_206 + 0x0C);
						*(union Eq_2 *) 0x42020EB0 = a5_206;
					}
					else
					{
						while (a5_206 != 0x00)
						{
							Eq_2 a5_210 = g_t4202000C;
							if (s0_187 == 0x42020000)
							{
								s0_187 = g_t4202000C;
								g_t4202000C = a5_210;
								break;
							}
							a5_206.u0 = 0x42020000;
						}
					}
				}
				Eq_2 a4_219 = g_t4201FEAC;
				*(union Eq_2 *) 0x42020EAC = s0_187;
				*((word32) a4_219 + 0x0C) = s0_187;
				Eq_2 a2_235;
				Eq_2 s1_238;
				word32 a3_670;
				word32 a0_669;
				word32 a4_671;
				word32 s8_672;
				Eq_2 s0_237 = tcp_timer_needed(a0_177, a3_180, mstatus, dwArg24, out s1_238, out a0_669, out a2_235, out a3_670, out a4_671, out s8_672);
				*(byte *) 0x42020EB4 = 0x01;
				word32 s3_678;
				word32 a0_674;
				word32 a2_675;
				word32 s4_679;
				word32 a3_676;
				word32 s2_677;
				word32 s0_673;
				word32 s11_686;
				word32 s6_681;
				word32 s7_682;
				word32 s5_680;
				word32 s10_685;
				word32 s9_684;
				word32 s8_683;
				tcp_output(ra_186, s1_238, s0_237, a2_235, s7, mstatus, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_673, out s1_104, out a0_674, out a2_675, out a3_676, out a4, out a5, out s2_677, out s3_678, out s4_679, out s5_680, out s6_681, out s7_682, out s8_683, out s9_684, out s10_685, out s11_686, out mstatus);
			}
		}
	}
l2304185C:
	0x00 = (uint16) dwArgA8;
	s1Out = s1_104;
	a0Out = s1_104;
	a4Out = a4;
	a5Out = a5;
	mstatusOut = mstatus;
	return s1;
}

