pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
Eq_2 g_t23041BDE = 
	{
		0xC226
	};
// 23041C02: Register Eq_2 tcp_netif_ip_addr_changed(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
Eq_2 tcp_netif_ip_addr_changed(Eq_2 ra, ptr32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_12 = *a4;
		if (a4 != 0x00)
		{
			Eq_2 a3_26;
			Eq_2 a4_27;
			ptr32 mstatus_31;
			Eq_2 s1_33;
			Eq_2 s3_37;
			Eq_2 s4_38;
			Eq_2 s7_41;
			word32 s7_265;
			word32 s2_263;
			word32 s3_264;
			word32 a5_262;
			ra = tcp_netif_ip_addr_changed_pcblist.isra.2(tcp_netif_ip_addr_changed_pcblist.isra.2(ra, a0_12, a1, g_t4201FEAC, a3, a4, 0x42020000, s3, s4, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1_33, out a3_26, out a4_27, out a5_262, out s2_263, out s3_37, out s4_38, out s7_41, out mstatus_31), a0_12, s1_33, g_t4201FEB0, a3_26, a4_27, 0x42020000, s3_37, s4_38, s7_41, mstatus_31, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1, out a3, out a4, out a5, out s2, out s3_264, out s4, out s7_265, out mstatus);
			if (s1 != 0x00)
			{
				s1 = *a5;
				if (a5 != 0x00)
				{
					a5 = g_t4201FEA8;
					while (a5 != 0x00)
					{
						Eq_2 a5_88 = *a3;
						if (a3 == a4)
						{
							s1 = *a4;
							*a4 = a5_88;
						}
						a5 = *((word32) a5_88 + 0x0C);
					}
				}
			}
		}
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23041C5A: Register Eq_2 tcp_kill_state(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_212042) a0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_210739 a1Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_212042) a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_new_ip_type
Eq_2 tcp_kill_state(Eq_2 ra, Eq_2 s1, struct Eq_212042 * a0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_210739 & a1Out, union Eq_2 & a3Out, struct Eq_212042 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_212042 * a4_12 = &g_t42020000;
	Eq_2 a5_10 = g_t4201FEAC;
	Eq_210739 a1_7 = g_t4201FEA4;
	struct Eq_212042 * a2_17 = null;
	Eq_2 a3_19 = 0x00;
	while (a5_10 != 0x00)
	{
		a4_12 = (word32) *((word32) a5_10 + 20);
		if (a4_12 == a0)
		{
			a5_10 = a4_12->t0020;
			a4_12 = a1_7 - a4_12;
			if (a4_12 >= a2_17)
			{
				a2_17 = a4_12;
				a3_19 = a5_10;
			}
		}
		a5_10 = *((word32) a5_10 + 0x0C);
	}
	if (a3_19 == 0x00)
	{
		s1Out = s1;
		a1Out = a1_7;
		a3Out = a3_19;
		a4Out = a4_12;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_210739 a1_48;
		Eq_2 a3_50;
		struct Eq_212042 * a4_51;
		ptr32 mstatus_55;
		Eq_2 s1_58;
		ptr32 s10_59;
		ptr32 s11_60;
		ptr32 s2_61;
		Eq_2 s3_62;
		Eq_2 s4_63;
		ptr32 s5_64;
		ptr32 s6_65;
		Eq_2 s7_66;
		ptr32 s9_68;
		word32 a0_229;
		word32 a5_230;
		word32 s0_228;
		Eq_2 ra_56 = tcp_abandon(ra, s1, a3_19, a3_19, s3, s4, s7, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg58, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s0_228, out s1_58, out a0_229, out a1_48, out a3_50, out a4_51, out a5_230, out s2_61, out s3_62, out s4_63, out s5_64, out s6_65, out s7_66, out s9_68, out s10_59, out s11_60, out mstatus_55);
		s1Out = s1_58;
		a1Out = a1_48;
		a3Out = a3_50;
		a4Out = a4_51;
		s2Out = s2_61;
		s3Out = s3_62;
		s4Out = s4_63;
		s5Out = s5_64;
		s6Out = s6_65;
		s7Out = s7_66;
		s9Out = s9_68;
		s10Out = s10_59;
		s11Out = s11_60;
		mstatusOut = mstatus_55;
		return ra_56;
	}
}

// 23041C96: Register Eq_2 tcp_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_212180) a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_212182) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_new_ip_type
//      tcp_input
Eq_2 tcp_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, struct Eq_211489 & a4Out, ptr32 & a5Out, struct Eq_212182 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_211489 * a4_340;
	ptr32 a3_339;
	ptr32 a5_337;
	Eq_2 a0_20;
	word32 a3_923;
	word32 a5_924;
	Eq_2 a2_22;
	Eq_2 a4_116;
	Eq_2 s1_123 = memp_malloc(a0, 0x02, a3, a4, mstatus, out a0_20, out a2_22, out a3_923, out a4_116, out a5_924);
	Eq_2 s0_153 = a0_20;
	if (a0_20 != 0x00)
	{
l23041D62:
		word32 a0_941;
		word32 t1_940;
		word32 a1_942;
		word32 a5_944;
		word32 a2_943;
		ra = memset(ra, s0_153, 0x00, 0x00A4, out t1_940, out a0_941, out a1_942, out a2_943, out a3_339, out a4_340, out a5_944);
		((word32) s0_153 + 100)->u0 = 0x0580;
		*(union Eq_2 *) 0x08100838 = s0_153;
		((word32) s0_153 + 11)->u1 = ~0x00;
		((word32) s0_153 + 64)->u0 = 0x06;
		*((word32) s0_153 + 62) = 0x06;
		*(union Eq_2 *) 0x0219002F = s0_153;
		Eq_210739 a5_404 = g_t4201FEA4;
		*((word32) s0_153 + 21) = (byte) s1_123;
		*((word32) a5_404 + 32) = s0_153;
		*((word32) s0_153 + 30) = (byte) (word32) g_b4200DF81;
		*(union Eq_2 *) 0x15800049 = s0_153;
		((word32) s0_153 + 0x0084)->u0 = 587472846;
		((word32) s0_153 + 0x0094)->u0 = 7200000;
		((word32) s0_153 + 0x0098)->u0 = 301991160;
		((word32) s0_153 + 0x009C)->u0 = 0x09;
		a5_337 = 0x09;
l23041DE4:
		s1Out = s1_123;
		a0Out = s0_153;
		a3Out = a3_339;
		a4Out = a4_340;
		a5Out = a5_337;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = dwLoc1C;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	s3.u0 = 0x42020000;
	Eq_2 a0_29 = g_t4201FEAC;
	while (a0_29 != 0x00)
	{
		ui32 a5_32 = (word32) *((word32) a0_29 + 26);
		Eq_2 a0_34 = *((word32) a0_20 + 0x0C);
		a4_116 = a5_32 & 8;
		if ((a5_32 & 8) != 0x00)
		{
			*((word32) a0_34 + 26) = (word16) (a5_32 & ~0x08);
			word32 a3_950;
			word32 s2_952;
			word32 s8_953;
			word32 a0_949;
			word32 a5_951;
			ra = tcp_close_shutdown_fin(ra, s1_123, a0_34, a2_22, s7, mstatus, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s1_123, out a0_949, out a2_22, out a3_950, out a4_116, out a5_951, out s2_952, out s3, out s4, out s5, out s6, out s7, out s8_953, out s9, out s10, out s11, out mstatus);
		}
		a0_29 = a0_20;
	}
	s2 = (struct Eq_212182 *) &g_t42020000;
	Eq_2 a5_76 = g_t4201FEA0;
	Eq_210739 a2_77 = g_t4201FEA4;
	Eq_2 a3_115 = 0x00;
	while (a5_76 != 0x00)
	{
		Eq_2 a5_82 = *((word32) a4_116 + 32);
		a4_116 = a2_77 - a4_116;
		if (a4_116 >= a3_115)
		{
			a3_115 = a4_116;
			a0_29 = a5_82;
		}
		a5_76 = *((word32) a5_82 + 0x0C);
	}
	if (a0_29 != 0x00)
	{
		word32 a0_926;
		word32 a5_927;
		word32 s0_925;
		ra = tcp_abort(ra, s1_123, a0_29, a3_115, s3, s4, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0_925, out s1_123, out a0_926, out a3_115, out a4_116, out a5_927, out s2, out s3, out s4, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	}
	Eq_2 a0_146;
	word32 a2_928;
	word32 a5_931;
	word32 a4_930;
	word32 a3_929;
	s1_123 = memp_malloc(s1_123, 0x02, a3_115, a4_116, mstatus, out a0_146, out a2_928, out a3_929, out a4_930, out a5_931);
	s0_153 = a0_146;
	if (a0_146 != 0x00)
	{
l23041D50:
		uint16 * a4_364 = g_ptr4201FE58;
		*a4_364 = (word16) ((word32) *a4_364 + ~0x00);
		goto l23041D62;
	}
	Eq_2 a3_163;
	Eq_2 a4_164;
	Eq_2 s1_172;
	Eq_2 s4_177;
	word32 a1_932;
	ra = tcp_kill_state(ra, s1_123, (struct Eq_212042 *) 0x09, s3, s4, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1_172, out a1_932, out a3_163, out a4_164, out s2, out s3, out s4_177, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	Eq_2 a0_191;
	word32 a5_936;
	word32 a3_934;
	word32 a4_935;
	word32 a2_933;
	s1_123 = memp_malloc(s1_172, 0x02, a3_163, a4_164, mstatus, out a0_191, out a2_933, out a3_934, out a4_935, out a5_936);
	s0_153 = a0_191;
	if (a0_191 != 0x00)
	{
l23041D3E:
		uint16 * a4_358 = g_ptr4201FE58;
		*a4_358 = (word16) ((word32) *a4_358 + ~0x00);
		goto l23041D50;
	}
	Eq_2 a3_202;
	Eq_2 a4_203;
	Eq_2 s1_211;
	Eq_2 s4_216;
	Eq_2 a1_200;
	ra = tcp_kill_state(ra, s1_123, (struct Eq_212042 *) 0x08, s3, s4_177, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s1_211, out a1_200, out a3_202, out a4_203, out s2, out s3, out s4_216, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	Eq_2 a0_230;
	word32 a2_937;
	word32 a5_938;
	Eq_2 a4_234;
	Eq_2 a3_233;
	s1_123 = memp_malloc(s1_211, 0x02, a3_202, a4_203, mstatus, out a0_230, out a2_937, out a3_233, out a4_234, out a5_938);
	s0_153 = a0_230;
	if (a0_230 != 0x00)
	{
l23041D2C:
		uint16 * a4_352 = g_ptr4201FE58;
		*a4_352 = (word16) ((word32) *a4_352 + ~0x00);
		goto l23041D3E;
	}
	Eq_2 a5_240;
	if ((int32) (byte) s1_123 >= 0x00)
	{
		a5_240 = s1_123;
		if (s1_123 == 0x00)
			goto l23041D10;
	}
	else
		a5_240.u0 = 0x007F;
	a4_234 = *((word16) s3.u0 - 340);
	int32 a0_246 = s2->dwFFFFFEA4;
	uint32 a5_249 = (word32) a5_240 - 1 & 0x00FF;
	a3_233.u0 = 0x00;
	while (a4_234 != 0x00)
	{
		uint32 a2_253 = (word32) *((word32) a4_234 + 21);
		if (a2_253 >= a5_249)
		{
			if (a2_253 != a5_249)
				goto l23041E62;
			a4_234 = *((word32) a1_200 + 32);
			a1_200 = a0_246 - a1_200;
			if (a1_200 >= a3_233)
				goto l23041E58;
		}
		else
		{
l23041E58:
			a4_234 = *((word16) a3_233.u0 + 32);
			a5_249 = a2_253;
			s0_153 = a4_234;
			a3_233 = a0_246 - a3_233;
		}
l23041E62:
		a4_234 = *((word32) a4_234 + 0x0C);
	}
	if (s0_153 != 0x00)
	{
		word32 a5_947;
		word32 a0_946;
		word32 s0_945;
		word32 s4_948;
		ra = tcp_abort(ra, s1_123, s0_153, a3_233, s3, s4_216, s7, mstatus, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0_945, out s1_123, out a0_946, out a3_233, out a4_234, out a5_947, out s2, out s3, out s4_948, out s5, out s6, out s7, out s9, out s10, out s11, out mstatus);
	}
l23041D10:
	Eq_2 a0_336;
	word32 a2_939;
	s1_123 = memp_malloc(s1_123, 0x02, a3_233, a4_234, mstatus, out a0_336, out a2_939, out a3_339, out a4_340, out a5_337);
	s0_153 = a0_336;
	if (a0_336 == 0x00)
		goto l23041DE4;
	uint16 * a4_346 = g_ptr4201FE58;
	*a4_346 = (word16) ((word32) *a4_346 + ~0x00);
	goto l23041D2C;
}

// 23041E66: Register Eq_2 tcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_192459) a5Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_new_ip_type
//      lwip_netconn_do_newconn
Eq_2 tcp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_192459 & a5Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a3_15;
	ptr32 a4_16;
	struct Eq_192459 * a5_17;
	ptr32 s1_21;
	ptr32 s4_22;
	ptr32 a0_28;
	ptr32 mstatus_30;
	ptr32 s7_37;
	word32 s2_68;
	word32 s3_69;
	word32 s5_70;
	word32 s6_71;
	word32 s8_72;
	word32 s9_73;
	word32 s10_74;
	word32 s11_75;
	Eq_2 ra_19 = tcp_alloc(ra, s1, 64, a3, a4, s3, s4, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgDC, dwArgE8, out s1_21, out a0_28, out a3_15, out a4_16, out a5_17, out s2_68, out s3_69, out s4_22, out s5_70, out s6_71, out s7_37, out s8_72, out s9_73, out s10_74, out s11_75, out mstatus_30);
	s1Out = s1_21;
	a0Out = a0_28;
	a3Out = a3_15;
	a4Out = a4_16;
	a5Out = a5_17;
	s4Out = s4_22;
	s7Out = s7_37;
	mstatusOut = mstatus_30;
	return ra_19;
}

// 23041E6E: Register Eq_2 tcp_close_shutdown(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_close
//      tcp_shutdown
Eq_2 tcp_close_shutdown(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_108;
	Eq_2 s1_113;
	Eq_2 s0_11 = a0;
	Eq_2 a5_12 = (word32) *((word32) a0 + 20);
	if (a1 != 0x00)
	{
		a4.u0 = 0x04;
		if (a5_12 != 0x04)
		{
			a4.u0 = 0x07;
			if (a5_12 != 0x07)
				goto l23041F06;
		}
		s0_11 = *((word16) a4.u0 + 0x0078);
		if (a4 != 0x00)
		{
l23041E9C:
			Eq_2 a3_222;
			word32 a4_695;
			word32 a5_696;
			word32 s1_693;
			word32 a0_694;
			ra = tcp_rst(ra, *((word32) a1 + 80), a1, a2, s7, mstatus, dwArg38, dwArg48, dwArg68, dwArg78, dwArg84, dwArg88, dwArgA8, dwArgB8, dwArgE8, dwArg0118, out s0_11, out s1_693, out a0_694, out a3_222, out a4_695, out a5_696, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out mstatus);
			word32 a5_701;
			word32 a2_699;
			word32 a4_700;
			word32 a0_697;
			word32 a1_698;
			s1_113 = tcp_pcb_purge(ra, s0_11, a3_222, s4, mstatus, dwArgC8, dwArgD8, dwArg0108, out a0_697, out a1_698, out a2_699, out a3, out a4_700, out a5_701);
			Eq_2 a5_256 = g_t4201FEAC;
			if (a5_256 == s0_11)
			{
				s0_11 = *((word32) a5_256 + 0x0C);
				*(union Eq_2 *) 0x42020EAC = a5_256;
			}
			else
			{
				while (a5_256 != 0x00)
				{
					Eq_2 a5_260 = g_t4202000C;
					if (s0_11 == 0x42020000)
					{
						s0_11 = g_t4202000C;
						g_t4202000C = a5_260;
						break;
					}
					a5_256.u0 = 0x42020000;
				}
			}
			*(byte *) 0x42020EB4 = 0x01;
			a5_108 = g_t4201FEB8;
			*((word32) s0_11 + 0x0C) = 0x00;
			a4.u0 = 0x01;
			if (a5_108 == s0_11)
			{
				tcp_trigger_input_pcb_close();
				goto l23041EEA;
			}
			goto l23041F3E;
		}
		a3 = (word32) *((word32) s0_11 + 40);
		a4.u0 = 0x00FFF810;
		if (a3 != 0x00FFF810)
			goto l23041E9C;
	}
l23041F06:
	if (a5_12 == 0x01)
	{
		do
		{
			word32 a5_30 = *((word16) a4.u0 + 4);
			a4 = *a4.u0;
			while (a4 != 0x00)
			{
				Eq_2 a4_35 = *((word32) a2 + 0x007C);
				if (s0_11 == a2)
					((word32) a4_35 + 0x007C)->u0 = 0x00;
				a4 = *((word32) a4_35 + 0x0C);
			}
		} while (a5_30 != 3707214792);
		Eq_2 a3_81;
		Eq_2 a4_82;
		word32 s1_707;
		word32 a0_708;
		ra = tcp_pcb_remove(ra, s0_11, 587752508, a4, a5_30 + 0x04, s4, s7, mstatus, dwArg38, dwArg48, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s1_707, out a0_708, out a3_81, out a4_82, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
		word32 a0_709;
		word32 a2_710;
		s1_113 = memp_free(0x03, s0_11, a3_81, a4_82, mstatus, out a0_709, out a2_710, out a3, out a4, out a5_108);
l23041EEA:
		s1Out = s1_113;
		a0Out = 0x00;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_108;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	if (a5_12 != 0x00)
	{
		if (a5_12 != 0x02)
		{
			Eq_2 a4_174;
			Eq_2 a5_175;
			ptr32 a0_176;
			Eq_2 a3_178;
			ptr32 mstatus_181;
			Eq_2 s1_183;
			ptr32 s10_184;
			ptr32 s11_185;
			ptr32 s2_186;
			ptr32 s3_187;
			Eq_2 s4_188;
			ptr32 s5_189;
			ptr32 s6_190;
			Eq_2 s7_191;
			ptr32 s8_192;
			ptr32 s9_193;
			word32 a2_705;
			Eq_2 ra_182 = tcp_close_shutdown_fin(ra, 0x01, s0_11, dwArg10, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s1_183, out a0_176, out a2_705, out a3_178, out a4_174, out a5_175, out s2_186, out s3_187, out s4_188, out s5_189, out s6_190, out s7_191, out s8_192, out s9_193, out s10_184, out s11_185, out mstatus_181);
			s1Out = s1_183;
			a0Out = a0_176;
			a3Out = a3_178;
			a4Out = a4_174;
			a5Out = a5_175;
			s2Out = s2_186;
			s3Out = s3_187;
			s4Out = s4_188;
			s5Out = s5_189;
			s6Out = s6_190;
			s7Out = s7_191;
			s8Out = s8_192;
			s9Out = s9_193;
			s10Out = s10_184;
			s11Out = s11_185;
			mstatusOut = mstatus_181;
			return ra_182;
		}
		word32 s1_144;
		word32 a0_706;
		ra = tcp_pcb_remove(ra, s0_11, a3, 0x02, a5_12, s4, s7, mstatus, dwArg38, dwArg48, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s1_144, out a0_706, out a3, out a4, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out mstatus);
		*(byte *) 0x42020EB4 = (byte) s1_144;
	}
	else if ((word32) *((word32) s0_11 + 22) != 0x00)
	{
		a4.u0 = 0x42020000;
		Eq_2 a5_119 = g_t4201FEB0;
		if (a5_119 == s0_11)
		{
			s0_11 = *((word32) a5_119 + 0x0C);
			*(union Eq_2 *) 0x42020EB0 = a5_119;
		}
		else
		{
			while (a5_119 != 0x00)
			{
				Eq_2 a5_123 = g_t4202000C;
				if (s0_11 == 0x42020000)
				{
					s0_11 = g_t4202000C;
					g_t4202000C = a5_123;
					break;
				}
				a5_119.u0 = 0x42020000;
			}
		}
		*((word32) s0_11 + 0x0C) = 0x00;
	}
l23041F3E:
	word32 a1_703;
	word32 a2_704;
	word32 a0_702;
	s1_113 = tcp_free(s0_11, a3, a4, mstatus, out a0_702, out a1_703, out a2_704, out a3, out a4, out a5_108);
	goto l23041EEA;
}

