pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23041FAC: Register Eq_2 tcp_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_191879) s1Out, Register out (ptr32 Eq_191880) a0Out, Register out Eq_2 a3Out, Register out Eq_191882 a4Out, Register out (ptr32 Eq_191883) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out Eq_191887 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_close
//      altcp_tcp_new_ip_type
//      tcp_recv_null
//      lwip_netconn_do_listen
//      lwip_netconn_do_close
Eq_2 tcp_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_191879 & s1Out, struct Eq_191880 & a0Out, union Eq_2 & a3Out, union Eq_191882 & a4Out, struct Eq_191883 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, union Eq_191887 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = (struct Eq_191880 *) ~0x0F;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a4_6 = (word32) *((word32) a0 + 20);
		if (a4_6 != 0x01)
			*((word32) a0 + 26) = (word16) ((word32) *((word32) a0 + 26) | 16);
		struct Eq_191880 * a0_28;
		Eq_2 a3_31;
		Eq_191882 a4_32;
		struct Eq_191883 * a5_33;
		ptr32 mstatus_36;
		struct Eq_191879 * s1_38;
		ptr32 s10_39;
		ptr32 s11_40;
		ptr32 s2_41;
		ptr32 s3_42;
		Eq_2 s4_43;
		Eq_191887 s5_44;
		ptr32 s6_45;
		Eq_2 s7_46;
		ptr32 s8_47;
		ptr32 s9_48;
		Eq_2 ra_37 = tcp_close_shutdown(ra, a0, 0x01, a2, a3, a4_6, s4, s7, mstatus, dwArg10, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, out s1_38, out a0_28, out a3_31, out a4_32, out a5_33, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45, out s7_46, out s8_47, out s9_48, out s10_39, out s11_40, out mstatus_36);
		s1Out = s1_38;
		a0Out = a0_28;
		a3Out = a3_31;
		a4Out = a4_32;
		a5Out = a5_33;
		s2Out = s2_41;
		s3Out = s3_42;
		s4Out = s4_43;
		s5Out = s5_44;
		s6Out = s6_45;
		s7Out = s7_46;
		s8Out = s8_47;
		s9Out = s9_48;
		s10Out = s10_39;
		s11Out = s11_40;
		mstatusOut = mstatus_36;
		return ra_37;
	}
}

// 23041FCE: Register Eq_2 tcp_recv_null(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out (ptr32 Eq_213067) a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_213069) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_process_refused_data
//      tcp_input
Eq_2 tcp_recv_null(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s1Out, struct Eq_213067 & a0Out, union Eq_2 & a3Out, struct Eq_213069 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	if (a1 == 0x00)
	{
		s1Out = s1;
		a0Out = (struct Eq_213067 *) ~0x0F;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else if (a2 == 0x00)
	{
		if (a3 != 0x00)
		{
			s1Out = s1;
			a0Out = null;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			struct Eq_213067 * a0_14;
			Eq_2 a3_17;
			struct Eq_213069 * a4_18;
			ptr32 mstatus_22;
			Eq_2 s1_24;
			ptr32 s10_25;
			ptr32 s11_26;
			ptr32 s2_27;
			ptr32 s3_28;
			Eq_2 s4_29;
			ptr32 s5_30;
			ptr32 s6_31;
			Eq_2 s7_32;
			ptr32 s8_33;
			union Eq_2 * s9_34;
			word32 a5_208;
			Eq_2 ra_23 = tcp_close(ra, a1, a2, a3, s4, s7, mstatus, dwArg10, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, out s1_24, out a0_14, out a3_17, out a4_18, out a5_208, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31, out s7_32, out s8_33, out s9_34, out s10_25, out s11_26, out mstatus_22);
			s1Out = s1_24;
			a0Out = a0_14;
			a3Out = a3_17;
			a4Out = a4_18;
			s2Out = s2_27;
			s3Out = s3_28;
			s4Out = s4_29;
			s5Out = s5_30;
			s6Out = s6_31;
			s7Out = s7_32;
			s8Out = s8_33;
			s9Out = s9_34;
			s10Out = s10_25;
			s11Out = s11_26;
			mstatusOut = mstatus_22;
			return ra_23;
		}
	}
	else
	{
		Eq_2 a3_53;
		Eq_2 a4_54;
		ptr32 mstatus_58;
		Eq_2 s0_60;
		ptr32 s10_62;
		ptr32 s11_63;
		Eq_2 s4_66;
		Eq_2 s7_69;
		union Eq_2 * s9_71;
		Eq_2 a3_86;
		struct Eq_213069 * a4_87;
		Eq_2 s1_89;
		ptr32 s2_90;
		ptr32 s3_91;
		Eq_2 s4_94;
		ptr32 s5_95;
		ptr32 s6_96;
		ptr32 s8_97;
		ptr32 mstatus_103;
		word32 s1_197;
		word32 a0_198;
		word32 a2_199;
		word32 a5_200;
		word32 s3_201;
		word32 s0_202;
		word32 a0_203;
		word32 a1_204;
		word32 a2_205;
		word32 a5_206;
		word32 a7_207;
		Eq_2 ra_104 = pbuf_free(tcp_recved(ra, s1, a1, (word32) *((word32) a2 + 8), a2, a3, s7, mstatus, dwArg00, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgF8, dwArgFC, dwArg0108, out s0_60, out s1_197, out a0_198, out a2_199, out a3_53, out a4_54, out a5_200, out s3_201, out s4_66, out s7_69, out s9_71, out s10_62, out s11_63, out mstatus_58), s0_60, a3_53, a4_54, s4_66, mstatus_58, dwArg0118, out s0_202, out s1_89, out a0_203, out a1_204, out a2_205, out a3_86, out a4_87, out a5_206, out a7_207, out s2_90, out s3_91, out s4_94, out s5_95, out s6_96, out s8_97, out mstatus_103);
		s1Out = s1_89;
		a0Out = null;
		a3Out = a3_86;
		a4Out = a4_87;
		s2Out = s2_90;
		s3Out = s3_91;
		s4Out = s4_94;
		s5Out = s5_95;
		s6Out = s6_96;
		s7Out = s7_69;
		s8Out = s8_97;
		s9Out = s9_71;
		s10Out = s10_62;
		s11Out = s11_63;
		mstatusOut = mstatus_103;
		return ra_104;
	}
}

