pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23042004: Register Eq_2 tcp_process_refused_data(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out Eq_2 s0Out, Register out (ptr32 Eq_213229) s1Out, Register out (ptr32 Eq_213229) a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_213232) a3Out, Register out Eq_213233 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_fasttmr
//      tcp_input
Eq_2 tcp_process_refused_data(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, union Eq_2 & s0Out, struct Eq_213229 & s1Out, struct Eq_213229 & a0Out, union Eq_2 & a2Out, struct Eq_213232 & a3Out, union Eq_213233 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_213229 * s1_124 = (struct Eq_213229 *) ~0x0F;
	if (a0 != 0x00)
	{
		word32 s4_118;
		struct Eq_213229 * a0_28;
		Eq_2 s2_16 = *((word32) a0 + 0x0078);
		Eq_2 a5_17 = *((word32) a0 + 0x0084);
		word32 s3_19 = (word32) *((word32) s2_16 + 0x0D);
		((word32) a0 + 0x0078)->u0 = 0x00;
		s0 = a0;
		if (a5_17 != 0x00)
		{
			word32 a5_64;
			word32 a1_67;
			word32 a7_75;
			word32 t0_81;
			word32 t1_82;
			word32 t4_83;
			word32 t5_84;
			word32 t6_85;
			word32 tp_86;
			a5_17();
		}
		else
		{
			word32 s1_359;
			word32 s8_360;
			ra = tcp_recv_null(ra, ~0x0F, a0, s2_16, 0x00, s4, s7, mstatus, dwLoc20, dwLoc10, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_359, out a0_28, out a3, out a4, out s2, out s3, out s4_118, out s5, out s6, out s7, out s8_360, out s9, out s10, out s11, out mstatus);
		}
		s1_124 = a0_28;
		if (a0_28 == null)
		{
			s3 &= 32;
			if (s3 == 0x00)
				goto l2304206A;
			word32 a5_97 = (word32) *((word32) s0 + 40);
			a4.u0 = 0x00FFF810;
			if (a5_97 != 0x00FFF810)
				((word32) s0 + 40)->u0 = (word16) (a5_97 + 0x01);
			Eq_2 a5_104 = *((word32) s0 + 0x0084);
			if (a5_104 != 0x00)
			{
				word32 s0_106 = a0_28->dw0010;
				word32 a0_129;
				word32 a7_141;
				word32 t0_147;
				word32 t1_148;
				word32 t4_149;
				word32 t5_150;
				word32 t6_151;
				word32 tp_152;
				a5_104();
				if (a0_129 != ~0x0C)
					goto l2304206A;
l23042068:
				s1_124 = (struct Eq_213229 *) ~0x0C;
				goto l2304206A;
			}
		}
		else
		{
			if (a0_28 == (struct Eq_213229 *) ~0x0C)
				goto l23042068;
			*((word32) s0 + 0x0078) = s2;
			s1_124 = (struct Eq_213229 *) ~0x04;
		}
	}
l2304206A:
	s0Out = s0;
	s1Out = s1_124;
	a0Out = s1_124;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwLoc1C;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23042090: Register Eq_2 tcp_fasttmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s5Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
Eq_2 tcp_fasttmr(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s5Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	g_b4200DF81 = (byte) ((word32) g_b4200DF81 + 0x01);
	ptr32 a3_143 = 1107353473;
	byte * s2_103 = &g_b4200DF81;
	Eq_2 s4_105 = 0x42020000;
	Eq_2 s3_104 = 0x42020000;
	s1_100 = s1;
	ra_128 = ra;
l230420BC:
	Eq_2 ra_128;
	Eq_2 s1_100;
	Eq_2 s0_166 = *((word32) s4_105 - 340);
	while (s0_166 != 0x00)
	{
		word32 a5_30 = (word32) *s2_103;
		if ((word32) *((word32) s0_166 + 30) != a5_30)
		{
			*((word32) s0_166 + 30) = (byte) a5_30;
			ui32 a5_35 = (word32) *((word32) s0_166 + 26);
			if ((a5_35 & 1) != 0x00)
			{
				*((word32) s0_166 + 26) = (word16) (a5_35 | 2);
				word32 s11_481;
				word32 s9_479;
				word32 s10_480;
				word32 s8_478;
				word32 a4_475;
				word32 a5_476;
				word32 s6_477;
				ra_128 = tcp_output(ra_128, s1_100, s0_166, a2, s7, mstatus, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_166, out s1_100, out a0, out a2, out a3_143, out a4_475, out a5_476, out s2_103, out s3_104, out s4_105, out s5, out s6_477, out s7, out s8_478, out s9_479, out s10_480, out s11_481, out mstatus);
				*((word32) s0_166 + 26) = (word16) ((word32) *((word32) s0_166 + 26) & ~0x03);
			}
			ui32 a5_118 = (word32) *((word32) s0_166 + 26);
			if ((a5_118 & 8) != 0x00)
			{
				*((word32) s0_166 + 26) = (word16) (a5_118 & ~0x08);
				word32 s10_486;
				word32 s11_487;
				word32 s8_484;
				word32 s9_485;
				word32 a4_482;
				word32 s6_483;
				ra_128 = tcp_close_shutdown_fin(ra_128, s1_100, s0_166, a2, s7, mstatus, dwArg28, dwArg38, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s1_100, out a0, out a2, out a3_143, out a4_482, out a5_118, out s2_103, out s3_104, out s4_105, out s5, out s6_483, out s7, out s8_484, out s9_485, out s10_486, out s11_487, out mstatus);
			}
			Eq_2 s0_122 = *((word32) s1_100 + 0x0C);
			if (a5_118 != 0x00)
			{
				((word32) s3_104 + 0x0EB4)->u1 = 0x00;
				word32 s11_494;
				word32 s9_492;
				word32 s10_493;
				word32 s8_491;
				word32 s6_490;
				word32 a4_489;
				word32 s0_488;
				ra_128 = tcp_process_refused_data(ra_128, s1_100, s0_122, s3_104, s4_105, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg58, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, out s0_488, out s1_100, out a0, out a2, out a3_143, out a4_489, out s2_103, out s3_104, out s4_105, out s5, out s6_490, out s7, out s8_491, out s9_492, out s10_493, out s11_494, out mstatus);
				if ((word32) *((word32) s3_104 - 332) != 0x00)
					goto l230420BC;
			}
		}
		s0_166 = s1_100;
	}
	s1Out = s1_100;
	a0Out = a0;
	a3Out = a3_143;
	s5Out = s5;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra_128;
}

// 23042138: Register Eq_2 tcp_shutdown(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ui32 a2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_shutdown
//      lwip_netconn_do_close
Eq_2 tcp_shutdown(Eq_2 ra, Eq_2 a0, Eq_2 a1, ui32 a2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	ptr32 a0_156;
	Eq_2 a3_10 = (word32) *((word32) a0 + 20);
	Eq_2 a4_11 = 0x01;
	if (a3_10 != 0x01)
	{
		if (a1 != 0x00)
		{
			ui32 a4_19 = (word32) *((word32) a0 + 26);
			*((word32) a0 + 26) = (word16) (a4_19 | 16);
			a1.u0 = 0x01;
			a4_11 = a4_19 | 16;
			if (a2 == 0x00)
			{
				Eq_2 a0_67 = *((word32) a0 + 0x0078);
				if (a0_67 != 0x00)
				{
					struct Eq_213617 * s0_70;
					word32 s8_301;
					word32 s2_300;
					word32 a7_299;
					word32 a0_296;
					word32 a2_298;
					word32 a1_297;
					ra = pbuf_free(ra, a0_67, a3_10, a4_19 | 16, s4, mstatus, dwArg0118, out s0_70, out s1, out a0_296, out a1_297, out a2_298, out a3_10, out a4_11, out a5, out a7_299, out s2_300, out s3, out s4, out s5, out s6, out s8_301, out mstatus);
					s0_70->dw0078 = 0x00;
				}
l23042162:
				a0_156 = 0x00;
l23042164:
				s1Out = s1;
				a0Out = a0_156;
				a3Out = a3_10;
				a4Out = a4_11;
				a5Out = a5;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				mstatusOut = mstatus;
				return ra;
			}
			goto l23042188;
		}
		if (a2 == 0x00)
			goto l23042162;
		a5 = 0x07;
		if (a3_10 <= 0x07)
		{
			ui32 a4_16 = 0x01 << a3_10;
			a4_11 = a4_16 & 0x0098;
			if ((a4_16 & 0x0098) != 0x00)
			{
l23042188:
				ptr32 a0_39;
				Eq_2 a3_42;
				Eq_2 a4_43;
				ptr32 a5_44;
				ptr32 mstatus_47;
				ptr32 s1_49;
				ptr32 s3_53;
				Eq_2 s4_54;
				ptr32 s5_55;
				ptr32 s6_56;
				Eq_2 s7_57;
				word32 s9_304;
				word32 s11_306;
				word32 s10_305;
				word32 s8_303;
				word32 s2_302;
				Eq_2 ra_48 = tcp_close_shutdown(ra, a0, a1, dwArg10, a3_10, a4_11, s4, s7, mstatus, dwArg10, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, out s1_49, out a0_39, out a3_42, out a4_43, out a5_44, out s2_302, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_303, out s9_304, out s10_305, out s11_306, out mstatus_47);
				s1Out = s1_49;
				a0Out = a0_39;
				a3Out = a3_42;
				a4Out = a4_43;
				a5Out = a5_44;
				s3Out = s3_53;
				s4Out = s4_54;
				s5Out = s5_55;
				s6Out = s6_56;
				s7Out = s7_57;
				mstatusOut = mstatus_47;
				return ra_48;
			}
		}
	}
	a0_156 = ~0x0A;
	goto l23042164;
}

