pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304219A: Register word32 tcp_slowtmr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArg010C, Register out ptr32 a3Out, Register out Eq_213719 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
word32 tcp_slowtmr(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, word32 dwArg010C, ptr32 & a3Out, union Eq_210026 & a4Out, ptr32 & mstatusOut)
{
	*(int32 *) 0x42020EA4 = (word32) g_t4201FEA4 + 1;
	g_b4200DF81 = (byte) ((word32) g_b4200DF81 + 0x01);
	struct Eq_213735 * s2_222 = &g_t42020000;
	Eq_213719 a4_17 = 1107353473;
	byte * s5_225 = &g_b4200DF81;
	Eq_2 s7_178 = 0x42020000;
	int32 s8_228 = 0x230863F0;
	word32 s9_229 = 587783828;
	ra_162 = ra;
	mstatus_194 = mstatus;
	a0_208 = a0;
	a3_211 = a3;
l230421EE:
	ptr32 mstatus_718;
	Eq_2 a0_716;
	Eq_2 a2_714;
	Eq_2 a3_710;
	Eq_2 a3_211;
	Eq_2 a0_208;
	ptr32 mstatus_194;
	Eq_2 ra_162;
	struct Eq_213755 * s6_226 = &g_t42020000;
	Eq_2 s0_100 = g_t4201FEAC;
	Eq_2 s10_124 = 0x07FFFFFE;
	Eq_2 s3_223 = 0x00;
	Eq_2 s4_224 = 0x07FFFFFF;
	while (true)
	{
		struct Eq_213766 * sp_204 = fp - 80;
		if (s0_100 == 0x00)
			break;
		Eq_2 s11_583;
		Eq_213719 a5_55 = (word32) *s5_225;
		a4_17 = (word32) *((word32) s0_100 + 30);
		if (a4_17 == a5_55)
		{
			s11_583 = *((word32) s0_100 + 0x0C);
			goto l23042242;
		}
		Eq_2 a4_61;
		a3_211 = (word32) *((word32) s0_100 + 20);
		((word32) s0_100 + 30)->u1 = (byte) a5_55;
		Eq_2 a5_60 = (word32) *((word32) s0_100 + 66);
		if (a3_211 == 0x02)
			a4_61.u0 = 0x05;
		else
			a4_61.u0 = 11;
		Eq_2 s1_219 = 0x01;
		if (a4_61 >= a5_60)
		{
			Eq_2 s1_68 = (word32) *((word32) s0_100 + 161);
			if (s1_68 != 0x00)
			{
				if ((word32) *((word32) s0_100 + 0x00A2) <= 11)
				{
					Eq_2 s1_242 = (word32) s1_68 + s9_229;
					uint32 a4_243 = (word32) *((word32) s1_242 - 1);
					uint32 a5_244 = (word32) *((word32) s0_100 + 0x00A0);
					if (a5_244 < a4_243)
					{
						uint32 a5_246 = a5_244 + 0x01 & 0x00FF;
						((word32) s0_100 + 0x00A0)->u1 = (byte) a5_246;
						if (a5_246 < a4_243)
							goto l230422B0;
					}
					if ((word32) *((word32) s0_100 + 96) != 0x00)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg104 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg168 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg216 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						tcp_split_unsent_seg(ra, s0, a1, a3, a4, mstatus, stackArg88, stackArg104, stackArg136, stackArg152, stackArg168, stackArg200, stackArg216, stackArg264);
						a0_208 = s0_100;
						if (s0_100 != 0x00)
							goto l230423A0;
						word32 s1_2029;
						word32 s11_2032;
						word32 a4_2030;
						word32 a5_2031;
						ra_162 = tcp_output(ra_162, s1_242, s0_100, a2, s7_178, mstatus_194, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_100, out s1_2029, out a0_208, out a2, out a3_211, out a4_2030, out a5_2031, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_2032, out mstatus_194);
						if (a0_208 != 0x00)
							goto l230423A0;
					}
					else
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg72 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg120 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg184 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg248 = <invalid>;
						Eq_2 stackArg296 = <invalid>;
						tcp_zero_window_probe(ra, a0, s4, s7, mstatus, stackArg72, stackArg88, stackArg120, stackArg136, stackArg152, stackArg184, stackArg200, stackArg248, stackArg296);
						a0_208 = s0_100;
						if (s0_100 == 0x00)
						{
l230423A0:
							up32 a5_293 = (word32) *((word32) s0_100 + 161);
							((word32) s0_100 + 0x00A0)->u1 = 0x00;
							if (a5_293 <= 0x06)
								((word32) s0_100 + 161)->u1 = (byte) (a5_293 + 0x01);
						}
					}
					goto l230422B0;
				}
				s1_219.u0 = 0x01;
				goto l230422B2;
			}
			Eq_2 a5_69 = (int32) *((word32) s0_100 + 48);
			if (a5_69 >= 0x00)
			{
				if (a5_69 == s4_224)
					goto l230423C2;
				*((word32) s0_100 + 48) = (word16) ((word32) a5_69 + 1);
			}
			a4_61 = (int32) *((word32) s0_100 + 48);
			a5_69 = (int32) *((word32) s0_100 + 64);
			if (a4_61 >= a5_69)
			{
l230423C2:
				struct Eq_214427 * a5_88;
				Eq_2 s1_90;
				word32 a4_2062;
				s0_100 = tcp_rexmit_rto_prepare(s1_68, a4_61, a5_69, out s1_90, out a0_208, out a2, out a3_211, out a4_2062, out a5_88, out s2_222, out s3_223, out s4_224, out s8_228);
				if (a0_208 != 0x00)
				{
					s0_100 = a5_88->t0070;
					if (a5_88 != null)
						goto l230422B0;
					s0_100 = a5_88->t006C;
					if (a5_88 != null)
						goto l230423D6;
					goto l230422B0;
				}
l230423D6:
				if ((word32) *((word32) s0_100 + 20) != 0x02)
				{
					int32 a5_108 = ((int32) *((word32) s0_100 + 60) >> 3) + (int32) (*((word32) s0_100 + 62));
					uint32 a4_109 = (word32) *((word32) s0_100 + 66);
					if (a4_109 > 0x0C)
						a4_109 = 0x0C;
					Eq_2 a5_119 = a5_108 << (word32) (*((word32) (a4_109 & 0x00FF) + s8_228));
					if (s10_124 < a5_119)
						a5_119 = s4_224;
					*((word32) s0_100 + 64) = (word16) a5_119;
				}
				uint32 a4_135 = (word32) *((word32) s0_100 + 72);
				uint32 a5_136 = (word32) *((word32) s0_100 + 96);
				*((word32) s0_100 + 48) = 0x00;
				if (a4_135 < a5_136)
					a5_136 = a4_135;
				ui32 a3_141 = (word32) *((word32) s0_100 + 50);
				uint32 a5_143 = a5_136 << 16;
				*((word32) s0_100 + 74) = (word16) (a5_143 >> 0x0011);
				uint32 a4_149 = a3_141 << 0x11 >> 16;
				if (a5_143 >> 0x0011 < a4_149)
					*((word32) s0_100 + 74) = (word16) a4_149;
				((word32) s0_100 + 72)->u0 = (word16) a3_141;
				*((word32) s0_100 + 0x006A) = 0x00;
				word32 s11_2064;
				word32 a4_2063;
				ra_162 = tcp_rexmit_rto_commit(ra_162, s1_90, s0_100, a2, s7_178, mstatus_194, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_100, out s1_219, out a0_208, out a2, out a3_211, out a4_2063, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_2064, out mstatus_194);
			}
			else
			{
l230422B0:
				s1_219.u0 = 0x00;
			}
		}
l230422B2:
		Eq_213975 a5_303 = (word32) *((word32) s0_100 + 20);
		if (a5_303 == 0x06 && ((word32) (*((word32) s0_100 + 26)) & 0x10) != 0x00)
		{
			s0_100 = *((word32) a3_211 + 32);
			a3_211.u0 = 40;
			if (s2_222->tFFFFFEA4 - a3_211 > 40)
				s1_219 = (word16) s1_219.u0 + 1 & 0x00FF;
		}
		ui32 s11_329 = (word32) *((word32) s0_100 + 9);
		ui32 s11_330 = s11_329 & 8;
		if ((s11_329 & 8) != 0x00)
		{
			if (a5_303 != 0x04)
			{
				s11_330 = 0x00;
				if (a5_303 == 0x07)
					goto l230422F4;
			}
			else
			{
l230422F4:
				a0_208 = *((word32) s0_100 + 0x0098);
				struct Eq_214023 * a1_339 = *((word32) s0_100 + 0x0094);
				a2.u0 = 500;
				Eq_2 s0_346 = *((word32) a5_303 + 32);
				a3_211 = s2_222->tFFFFFEA4 - a5_303;
				if (a0_208 + Mem301[s0_100 + 0x009C:int32] + a1_339 >>u 500 <u a3_211)
				{
					s1_219 = (word16) s1_219.u0 + 1 & 0x00FF;
					s11_330 = 0x01;
				}
				else
				{
					uint32 a5_353 = a1_339 + ((word32) a0_208 + (word32) (*((word32) s0_346 + 0x00A3)));
					s11_330 = 0x00;
					a5_303 = a5_353 >> 500;
					if (a5_353 >> 500 < a3_211)
					{
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						// Failed to bind call argument.
						// Please report this issue at https://github.com/uxmal/reko
						Eq_2 stackArg16 = <invalid>;
						Eq_2 stackArg88 = <invalid>;
						Eq_2 stackArg104 = <invalid>;
						Eq_2 stackArg136 = <invalid>;
						Eq_2 stackArg152 = <invalid>;
						Eq_2 stackArg168 = <invalid>;
						Eq_2 stackArg200 = <invalid>;
						Eq_2 stackArg216 = <invalid>;
						Eq_2 stackArg248 = <invalid>;
						Eq_2 stackArg264 = <invalid>;
						Eq_2 stackArg296 = <invalid>;
						tcp_keepalive(ra, s0, a0, s7, mstatus, stackArg16, stackArg88, stackArg104, stackArg136, stackArg152, stackArg168, stackArg200, stackArg216, stackArg248, stackArg264, stackArg296);
						a0_208 = s0_346;
						if (s0_346 == 0x00)
						{
							word32 a5_356 = (word32) *((word32) s0_346 + 0x00A3);
							((word32) s0_346 + 0x00A3)->u1 = (byte) (a5_356 + 0x01);
							a5_303 = a5_356 + 0x01;
						}
					}
				}
			}
		}
		s0_100 = *((word32) a5_303 + 116);
		if (a5_303 != 0x00)
		{
			s0_100 = *((word32) a5_303 + 32);
			a3_211.u0 = 0x06;
			Eq_2 a4_371 = s2_222->tFFFFFEA4 - a5_303;
			Eq_214063 a5_372 = (int32) *((word32) s0_100 + 64);
			if (a4_371 >= (word32) a5_372 + 6)
			{
				word32 a4_2033;
				s1_219 = tcp_free_ooseq(ra_162, 0x06, a4_371, (word32) a5_372 + 6, s4_224, mstatus_194, dwArg98, out a0_208, out a2, out a3_211, out a4_2033);
			}
		}
		word32 a5_411 = (word32) *((word32) s0_100 + 20);
		if (a5_411 == 0x03)
		{
			s0_100 = *(union Eq_2 *) 0x23;
			if (s2_222->tFFFFFEA4 > 0x2B)
				s1_219 = (word16) s1_219.u0 + 1 & 0x00FF;
			goto l23042362;
		}
		Eq_214295 a5_422;
		Eq_214295 a4_423;
		if (a5_411 == 0x09)
		{
			s0_100 = *(union Eq_2 *) 0x29;
			a5_422 = s2_222->tFFFFFEA4 - 0x09;
			a4_423.u0 = 0x00F0;
			goto l230424A4;
		}
		Eq_214308 a4_414 = 0x05;
		if (a5_411 != 0x05)
		{
			a4_414.u0 = 0x08;
			if (a5_411 == 0x08)
				goto l2304250C;
			goto l23042362;
		}
l2304250C:
		s0_100 = a4_414.u0[32];
		a5_422 = s2_222->tFFFFFEA4 - a4_414;
		a4_423.u0 = 0x0A;
l230424A4:
		if (a4_423 < a5_422)
		{
l230424A8:
			Eq_2 a1_479;
			Eq_2 a2_480;
			word32 a0_2037;
			struct Eq_214220 * a5_477;
			Eq_2 a4_476;
			Eq_2 a3_481;
			tcp_pcb_purge(ra_162, s0_100, a3_211, s4_224, mstatus_194, dwArg88, dwArg98, dwArgC8, out a0_2037, out a1_479, out a2_480, out a3_481, out a4_476, out a5_477);
			if (s3_223 != 0x00)
				*((word32) s3_223 + 0x0C) = a5_477;
			else
				s6_226[0x0EAC] = (struct Eq_213755) a5_477;
			if (s11_330 != 0x00)
			{
				word32 s1_2039;
				word32 a0_2040;
				word32 s0_2038;
				ra_162 = tcp_rst(ra_162, *((word32) a1_479 + 80), a1_479, a2_480, s7_178, mstatus_194, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_2038, out s1_2039, out a0_2040, out a3_481, out a4_476, out a5_477, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out mstatus_194);
			}
			Eq_2 s0_581 = a5_477[16];
			s11_583 = *((word32) s0_581 + 0x0C);
			word32 a5_596;
			word32 a1_2041;
			Eq_2 s1_597 = tcp_free(s0_581, a3_481, a4_476, mstatus_194, out a0_208, out a1_2041, out a2, out a3_211, out a4_17, out a5_596);
			((word32) s7_178 + 0x0EB4)->u1 = 0x00;
			if (s1_597 != 0x00)
			{
				s1_597();
				if ((word32) *((word32) s7_178 - 332) != 0x00)
					goto l230421EE;
			}
			s0_100 = s3_223;
			goto l23042242;
		}
l23042362:
		if (s1_219 != 0x00)
			goto l230424A8;
		a4_17 = (word32) *((word32) s0_100 + 29);
		s11_583 = *((word32) s0_100 + 0x0C);
		Eq_213719 a5_621 = (word32) *((word32) s0_100 + 28) + 0x01 & 0x00FF;
		((word32) s0_100 + 28)->u1 = (byte) a5_621;
		if (a5_621 >= a4_17)
		{
			<anonymous> * a5_623 = *((word32) s0_100 + 0x008C);
			((word32) s0_100 + 28)->u1 = 0x00;
			((word32) s7_178 + 0x0EB4)->u1 = 0x00;
			if (a5_623 != null)
			{
				word32 s0_638 = *((word32) a0_208 + 16);
				word32 a7_719;
				word32 t1_720;
				word32 t4_721;
				word32 t5_722;
				word32 t6_723;
				a5_623();
				mstatus_194 = mstatus_718;
				a2 = a2_714;
				a0_208 = a0_716;
				a3_211 = a3_710;
				if ((word32) *((word32) s7_178 - 332) != 0x00)
					goto l230421EE;
				mstatus_194 = mstatus_718;
				a2 = a2_714;
				a0_208 = a0_716;
				a3_211 = a3_710;
				if (a0_716 != 0x00)
					goto l23042242;
				a2 = a2_714;
				mstatus_194 = mstatus_718;
			}
			word32 a5_2035;
			word32 s3_2036;
			word32 s1_2034;
			ra_162 = tcp_output(ra_162, s1_219, s0_100, a2, s7_178, mstatus_194, sp_204[88], sp_204[0x0068], sp_204[0x0088], sp_204[0x0094], sp_204[0x0098], sp_204[0x00A8], sp_204[0x00B8], sp_204[200], sp_204[0x00CC], sp_204[0x00D8], sp_204[232], sp_204[264], sp_204[268], sp_204[0x0118], out s0_100, out s1_2034, out a0_208, out a2, out a3_211, out a4_17, out a5_2035, out s2_222, out s3_2036, out s4_224, out s5_225, out s6_226, out s7_178, out s8_228, out s9_229, out s10_124, out s11_583, out mstatus_194);
			goto l23042242;
		}
l23042242:
		s3_223 = s0_100;
		s0_100 = s11_583;
	}
	Eq_2 s1_780 = g_t4201FEA0;
	while (s1_780 != 0x00)
	{
		Eq_2 s1_788 = *((word32) a4_17 + 32);
		if (s2_222->tFFFFFEA4 - a4_17 > 0x00F0)
		{
			Eq_2 a4_798;
			Eq_2 a5_799;
			Eq_2 a3_803;
			word32 a1_2014;
			word32 a2_2015;
			word32 a0_2013;
			tcp_pcb_purge(ra_162, s1_788, a3_211, 0x00F0, mstatus_194, dwArg88, dwArg98, dwArgC8, out a0_2013, out a1_2014, out a2_2015, out a3_803, out a4_798, out a5_799);
			Eq_2 s1_806 = *((word32) a5_799 + 0x0C);
			if (s0_100 == 0x00)
				*(union Eq_2 *) 0x42020EA0 = a5_799;
			else
				*((word32) a5_799 + 0x0C) = s0_100;
			Eq_2 s5_813 = *((word32) s1_806 + 0x0C);
			word32 a0_2016;
			word32 a2_2018;
			word32 a5_2019;
			word32 a1_2017;
			tcp_free(s1_806, a3_803, a4_798, mstatus_194, out a0_2016, out a1_2017, out a2_2018, out a3_211, out a4_17, out a5_2019);
			s1_780 = s5_813;
		}
		else
		{
			s0_100 = s1_788;
			s1_780 = *((word32) s1_788 + 0x0C);
		}
	}
	0x00 = dwArg010C;
	a3Out = s2;
	a4Out = a4_17;
	mstatusOut = mstatus_194;
	return dwLoc4C;
}

// 23042564: Register Eq_2 tcp_tmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack word32 dwArg010C, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      tcpip_tcp_timer
Eq_2 tcp_tmr(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, word32 dwArg010C, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_11;
	Eq_2 a3_14;
	ptr32 mstatus_19;
	Eq_2 s1_22;
	Eq_2 s5_28;
	Eq_2 s7_30;
	Eq_2 ra_20 = tcp_fasttmr(ra, s1, a2, s3, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, out s1_22, out a0_11, out a3_14, out s5_28, out s7_30, out mstatus_19);
	ui32 a5_44 = (word32) g_b4200DF80 + 0x01 & 0x00FF;
	g_b4200DF80 = (byte) a5_44;
	if ((a5_44 & 0x01) == 0x00)
	{
		a3Out = a3_14;
		a4Out = 0x4200DF80;
		mstatusOut = mstatus_19;
		return s1_22;
	}
	else
	{
		Eq_2 a3_54;
		ptr32 a4_55;
		ptr32 mstatus_59;
		Eq_2 s1_62 = tcp_slowtmr(ra_20, a0_11, dwArg10, a3_14, s5_28, s7_30, mstatus_19, dwArg08, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArg010C, out a3_54, out a4_55, out mstatus_59);
		a3Out = a3_54;
		a4Out = a4_55;
		mstatusOut = mstatus_59;
		return s1_62;
	}
}

