pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23042882: Register Eq_2 tcp_receive(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_215354) a4Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_215356) s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
Eq_2 tcp_receive(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, struct Eq_215354 & a4Out, union Eq_2 & s2Out, struct Eq_215356 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s5_115;
	ui32 a5_5 = (word32) g_b4200DF88;
	struct Eq_215356 * s3_113 = &g_t4200DF94;
	Eq_2 s4_114 = 0x4200DFAA;
	s5_115 = s5;
	if ((a5_5 & 0x10) == 0x00)
	{
l23042A0C:
		struct Eq_215354 * a4_1562;
		ui32 a5_1563;
		ui32 a5_1564;
		Eq_2 a2_430 = (word32) *s4_114;
		Eq_2 s0_1434 = *((word32) a3 + 36);
		Eq_2 a5_450 = s3_113->t0000;
		if (a2_430 == 0x00 || (word32) (*((word32) s0_1434 + 20)) > 0x06)
		{
			a4_1562 = a5_450 - a3;
			if (a4_1562 >= null)
			{
				a4_1562 = (word32) *((word32) s0_1434 + 40);
				if ((word32) a5_450 + 1 - a3 - a4_1562 <= 0x00)
				{
l23042FCE:
					0x00 = (uint16) dwArg0128;
					s0Out.u0 = <invalid>;
					s1Out = s1;
					a0Out = a0;
					a3Out = a3;
					a4Out = a4_1562;
					s2Out = s2;
					s3Out = s3_113;
					s4Out = dwArg78;
					s5Out = s5_115;
					s6Out = s6;
					s7Out = s7;
					s8Out = s5;
					s9Out = s9;
					mstatusOut = mstatus;
					return ra;
				}
			}
			a5_1564 = (word32) *((word32) s0_1434 + 26);
			goto l23042FBC;
		}
		Eq_2 a1_465 = a3 - a5_450;
		Eq_2 a4_1162 = (word32) a1_465 - 1;
		if (a1_465 >= ~0x00)
		{
			a4_1162 = (word32) a3 + ((0x01 - a5_450) - a2_430);
			if (a4_1162 <= 0x00)
			{
				Eq_2 a1_483 = (word32) (word16) a1_465;
				*((word32) *((word32) a0 + 4) + 8) = (word16) ((word32) g_w42015278 - a1_483);
				word32 a5_496 = (word32) (word16) ((word32) *((word32) a0 + 8) - a1_483);
				while (true)
				{
					Eq_2 a4_499 = (word32) *((word32) a0 + 0x0A);
					if (a4_499 >= a1_483)
						break;
					((word32) a0 + 8)->u0 = (word16) a5_496;
					((word32) a0 + 0x0A)->u0 = 0x00;
					a1_483 = (word32) (word16) (a1_483 - a4_499);
					a0 = *a0;
				}
				word32 a3_2878;
				Eq_2 a5_510;
				pbuf_remove_header(a0, a1_483, a2_430, out a1_465, out a3_2878, out a4_1162, out a5_510);
				s1 = *((word32) a4_1162 + 16);
				s3_113->t0000 = a5_510;
				((word32) a4_1162 + 4)->u1 = (byte) a5_510;
				((word32) a4_1162 + 5)->u1 = (byte) (a5_510 >> 0x08);
				*((word32) a4_1162 + 6) = (byte) (a5_510 >> 0x10);
				*((word32) a4_1162 + 7) = (byte) (a5_510 >> 24);
l23042A90:
				Eq_2 a5_528 = s3_113->t0000;
				Eq_2 s0_531 = *((word32) a4_1162 + 36);
				if (a5_528 - a4_1162 >= 0x00)
				{
					Eq_2 a2_1161 = (word32) *((word32) s0_531 + 40);
					Eq_2 a3_1166 = (word32) a5_528 + 1 - a4_1162 - a2_1161;
					if (a3_1166 <= 0x00)
					{
						if (a5_528 == a4_1162)
						{
							struct Eq_215604 * a5_1082 = g_ptr42015280;
							word32 a5_2879;
							word32 a0_1092 = (word32) ((lwip_htons((word32) a5_1082->b000C | (word32) a5_1082->b000D << 8, out a5_2879) & 0x03) != 0x00) + (word32) g_w42015278;
							struct Eq_215632 * a5_1094 = (word32) *((word32) s0_531 + 40);
							struct Eq_215632 * a0_1095 = (word32) (word16) a0_1092;
							s4_114->u0 = (word16) a0_1095;
							if (a5_1094 < a0_1095)
							{
								Eq_2 s1_1097 = a5_1094->t0010;
								struct Eq_215655 * a5_1103;
								if ((lwip_htons((word32) a5_1094->b000C | (word32) a5_1094->b000D << 8, out a5_1103) & 0x01) != 0x00)
								{
									Eq_2 s2_1109 = (word32) a5_1103->b000D << 8 | (word32) a5_1103->b000C;
									word32 a5_2882;
									word32 a5_2881;
									Eq_2 a0_1114 = lwip_htons(lwip_htons(s2_1109, out a5_2881) & 62, out a5_2882);
									s1_1097 = *((word32) a4_1162 + 16);
									uint32 a0_1122 = (word32) (word16) (s2_1109 & 0xFC0000FF | a0_1114);
									((word32) a4_1162 + 0x0C)->u1 = (byte) a0_1122;
									*((word32) a4_1162 + 0x0D) = (byte) (a0_1122 >> 8);
								}
								struct Eq_215674 * a5_1128 = (word32) *((word32) s0_531 + 40);
								*((word32) s1_1097 + 8) = (word16) a5_1128;
								struct Eq_215683 * s1_1131 = a5_1128->ptr0010;
								word32 a5_2880;
								Eq_2 a0_1136 = lwip_htons((word32) a5_1128->b000C | (word32) a5_1128->b000D << 8, out a5_2880);
								if ((a0_1136 & 0x02) != 0x00)
									s1_1131->w0008 = (word16) ((word32) s1_1131->w0008 + ~0x00);
								word32 s6_2886;
								word32 s8_2887;
								word32 s1_2883;
								word32 s5_2885;
								word32 s2_2884;
								struct Eq_215759 * a5_1159;
								ra = pbuf_realloc(ra, a0_1136 & 0x02, (word32) s1_1131->w0008, a3_1166, a4_1162, s4_114, mstatus, dwArgE8, out s1_2883, out a2_1161, out a3_1166, out a4_1162, out a5_1159, out s2_2884, out s3_113, out s4_114, out s5_2885, out s6_2886, out s8_2887, out mstatus);
								s4_114->u0 = (word16) ((word32) a5_1159->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1159->b000C | (word32) a5_1159->b000D << 8, out a5_1094) & 0x03) != 0x00));
							}
							Eq_2 s0_1197 = a5_1094->t0074;
							if (a5_1094 != null)
							{
								Eq_2 s1_1198 = a5_1094->t0010;
								struct Eq_215866 * a5_1204;
								Eq_2 a0_1203 = lwip_htons((word32) a5_1094->b000C | (word32) a5_1094->b000D << 8, out a5_1204);
								struct Eq_215882 * a0_1205 = a0_1203 & 0x01;
								if ((a0_1203 & 0x01) == 0x00)
								{
									Eq_2 s5_1226 = *((word32) s0_1197 + 116);
									while (true)
									{
										Eq_2 a1_1229 = s3_113->t0000;
										Eq_2 a4_1232 = (word32) a1_1229 + (word32) (*s4_114);
										if (s5_1226 == 0x00)
											break;
										Eq_2 a3_1234 = *((word32) s5_1226 + 16);
										ui32 a5_1244 = (word32) *((word32) a3_1234 + 7) << 24 | ((word32) (*((word32) a3_1234 + 6)) << 16 | ((word32) (*((word32) a3_1234 + 4)) | (word32) (*((word32) a3_1234 + 5)) << 8));
										a2_1161 = a4_1232 - ((word32) (*((word32) s5_1226 + 8)) + a5_1244);
										if (a2_1161 < 0x00)
										{
											Eq_2 a4_1312 = a4_1232 - a5_1244;
											if (a4_1312 > 0x00)
											{
												struct Eq_215962 * a5_1313 = a5_1244 - a1_1229;
												*((word32) s1_1198 + 8) = (word16) a5_1313;
												struct Eq_215969 * s1_1316 = a5_1313->ptr0010;
												word32 a5_2890;
												Eq_2 a0_1321 = lwip_htons((word32) a5_1313->b000C | (word32) a5_1313->b000D << 8, out a5_2890);
												if ((a0_1321 & 0x02) != 0x00)
													s1_1316->w0008 = (word16) ((word32) s1_1316->w0008 + ~0x00);
												word32 s1_2891;
												word32 a3_2892;
												word32 s8_2896;
												word32 a4_2893;
												word32 s6_2895;
												word32 s2_2894;
												struct Eq_215999 * a5_1338;
												ra = pbuf_realloc(ra, a0_1321 & 0x02, (word32) s1_1316->w0008, a3_1234, a4_1312, s4_114, mstatus, dwArgE8, out s1_2891, out a2_1161, out a3_2892, out a4_2893, out a5_1338, out s2_2894, out s3_113, out s4_114, out s5_1226, out s6_2895, out s8_2896, out mstatus);
												word32 a5_2897;
												s4_114->u0 = (word16) ((word32) a5_1338->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1338->b000C | (word32) a5_1338->b000D << 8, out a5_2897) & 0x03) != 0x00));
											}
											break;
										}
										struct Eq_215939 * a5_1253;
										if ((lwip_htons((word32) *((word32) a3_1234 + 0x0C) | (word32) (*((word32) a3_1234 + 0x0D)) << 8, out a5_1253) & 0x01) != 0x00)
										{
											struct Eq_216161 * a5_1261;
											if ((lwip_htons((word32) a5_1253->b000C | (word32) a5_1253->b000D << 8, out a5_1261) & 0x02) == 0x00)
											{
												struct Eq_216180 * a5_1270;
												uint32 a0_1274 = (word32) (word16) ((word32) a5_1261->b000D << 8 | (word32) a5_1261->b000C | lwip_htons(0x01, out a5_1270));
												a5_1270->b000C = (byte) a0_1274;
												a5_1270->b000D = (byte) (a0_1274 >> 8);
												word32 a5_2907;
												s4_114->u0 = (word16) ((word32) a5_1270->ptr0010->w0008 + (word32) ((lwip_htons((word32) a5_1270->b000C | (word32) a5_1270->b000D << 8, out a5_2907) & 0x03) != 0x00));
											}
										}
										Eq_2 s2_1292 = *s5_1226;
										word32 a1_2903;
										word32 a5_2906;
										word32 a0_2902;
										word32 a4_2905;
										word32 a3_2904;
										s1_1198 = tcp_seg_free(ra, s5_1226, a3_1234, a4_1232, s4_114, mstatus, dwArgD8, out a0_2902, out a1_2903, out a2_1161, out a3_2904, out a4_2905, out a5_2906);
										s5_1226 = s2_1292;
									}
									*((word32) s0_1197 + 116) = s5_1226;
								}
								else
								{
									while (true)
									{
										s0_1197 = a0_1205->t0074;
										if (a0_1205 == null)
											break;
										Eq_2 a0_1210 = a5_1204->t0000;
										a5_1204->t0074 = s0_1197;
										word32 a1_2908;
										tcp_seg_free(ra, a0_1210, a3_1166, a4_1162, s4_114, mstatus, dwArgD8, out a0_1205, out a1_2908, out a2_1161, out a3_1166, out a4_1162, out a5_1204);
									}
								}
							}
							Eq_2 a3_1384 = (word32) *s4_114;
							word32 a5_1393 = (word32) *((word32) s0_1197 + 40) - a3_1384;
							Mem1395[Mem1383[s3_113 + 0x00:int32] + a3_1384 + 36:word32] = s0_1197;
							((word32) s0_1197 + 40)->u0 = (word16) a5_1393;
							word32 a4_2889;
							word32 a1_2888;
							struct Eq_215844 * a5_1406;
							tcp_update_rcv_ann_wnd(s0_1197, a2_1161, a3_1384, out a1_2888, out a3, out a4_2889, out a5_1406);
							struct Eq_215851 * s1_1408 = a5_1406->ptr0004;
							struct Eq_215855 * a4_1409 = (word32) a5_1406->w0008;
							if (a4_1409 != null)
							{
								g_ptr4200EF8C = a5_1406;
								s1_1408->dw0004 = 0x00;
								a4_1409 = (struct Eq_215855 *) &g_t4200E000;
							}
							s1 = a5_1406->t0010;
							word32 a5_2909;
							Eq_2 a0_1420 = lwip_htons((word32) a5_1406->b000C | (word32) a5_1406->b000D << 8, out a5_2909);
							a0 = a0_1420 & 0x01;
							if ((a0_1420 & 0x01) != 0x00)
							{
								ui32 a4_1425 = (word32) g_b4200DF90;
								g_b4200DF90 = (byte) (a4_1425 | 32);
								a4_1409 = a4_1425 | 32;
							}
							s2.u0 = 0x4200E000;
							s5_115.u0 = 0x04;
							s6 = 0x07;
							while (true)
							{
								s0_1434 = *((word16) s1.u0 + 116);
								if (s1 == 0x00)
									break;
								a3 = (word32) a4_1409->b0005 << 8 | (word32) a4_1409->b0004 | (word32) a4_1409->t0006 << 16;
								s1 = a4_1409->t0010;
								Eq_2 a5_1446 = (word32) a4_1409->t0007 << 24 | a3;
								s0_1434 = *((word32) a3 + 36);
								if (a5_1446 != a3)
									break;
								s3_113->t0000 = a5_1446;
								int32 s7_1452 = (word32) *((word16) s1.u0 + 8);
								struct Eq_216809 * a5_1456;
								Eq_2 a0_1455 = lwip_htons((word32) a4_1409->b000C | (word32) a4_1409->t000D << 8, out a5_1456);
								Eq_2 s0_1457 = a5_1456->t0024;
								(a5_1456 + s7_1452 / 40 + (word32) ((a0_1455 & 0x03) != 0x00) / 40)->t0024 = s0_1457;
								struct Eq_216839 * a5_1469;
								lwip_htons((word32) a5_1456->b000C | (word32) a5_1456->b000D << 8, out a5_1469);
								s7 = (word32) a5_1469->ptr0010->w0008;
								word32 a5_2940;
								((word32) s0_1457 + 40)->u0 = (word16) ((word32) *((word32) s0_1457 + 40) - ((word32) s7 + (word32) ((lwip_htons((word32) a5_1469->b000C | (word32) a5_1469->b000D << 8, out a5_2940) & 0x03) != 0x00)));
								Eq_2 a1_1487;
								Eq_2 a3_1488;
								word32 a5_2941;
								Eq_2 a4_1489;
								Eq_2 a0_1486 = tcp_update_rcv_ann_wnd(s0_1457, a2_1161, a3, out a1_1487, out a3_1488, out a4_1489, out a5_2941);
								struct Eq_216902 * s1_1492 = *((word32) a1_1487 + 4);
								struct Eq_216906 * a5_1493 = (word32) *((word32) a1_1487 + 8);
								if (a5_1493 != null)
								{
									a5_1493 = (struct Eq_216906 *) *a0_1486;
									if (a0_1486 != 0x00)
										pbuf_cat(a0_1486, a1_1487, a4_1489);
									else
										*a1_1487 = a5_1493;
									s1_1492->dw0004 = 0x00;
								}
								struct Eq_216921 * a5_1507;
								if ((lwip_htons((word32) a5_1493->b000C | (word32) a5_1493->b000D << 8, out a5_1507) & 0x01) != 0x00)
								{
									g_b4200DF90 = (byte) ((word32) g_b4200DF90 | 32);
									a4_1489.u0 = 0x4200DF90;
									a5_1507 = (word32) *((word32) s0_1457 + 20);
									if (a5_1507 == (struct Eq_216921 *) 0x04)
										((word32) s0_1457 + 20)->u1 = 0x07;
								}
								Eq_2 s1_1528 = a5_1507->t0000;
								a5_1507->t0074 = s0_1457;
								word32 a5_2943;
								word32 a1_2942;
								s1 = tcp_seg_free(ra, s1_1528, a3_1488, a4_1489, 0x4200E000, mstatus, dwArgD8, out a0, out a1_2942, out a2_1161, out a3, out a4_1409, out a5_2943);
							}
							ui32 a5_1561 = (word32) *((word32) s0_1434 + 26);
							a4_1562 = a5_1561 & 1;
							if ((a5_1561 & 1) == 0x00)
							{
								a5_1563 = a5_1561 | 1;
								goto l23042FCA;
							}
							a5_1564 = a5_1561 & ~0x01;
l23042FBC:
							a5_1563 = a5_1564 | 2;
l23042FCA:
							((word32) s0_1434 + 26)->u0 = (word16) a5_1563;
							goto l23042FCE;
						}
						s0_531 = *((word16) s1.u0 + 116);
						Eq_2 s2_547 = 0x00;
						if (s1 == 0x00)
						{
							word32 s1_2898;
							word32 a5_2901;
							struct Eq_216100 * a0_973;
							word32 a4_2900;
							word32 a3_2899;
							s0_531 = tcp_seg_copy(s1, a1_465, a3_1166, a4_1162, mstatus, out s1_2898, out a0_973, out a3_2899, out a4_2900, out a5_2901);
							a0_973->t0074 = s0_531;
						}
						else
						{
							do
							{
								Eq_2 a3_583;
								Eq_2 a4_616;
								Eq_2 a1_652;
								struct Eq_214751 * a5_612;
								Eq_2 s1_857;
								Eq_2 a3_558 = (word32) *((word32) a2_1161 + 5) << 8 | (word32) (*((word32) a2_1161 + 4)) | (word32) (*((word32) a2_1161 + 6)) << 16;
								Eq_2 s1_551 = *((word32) a2_1161 + 16);
								Eq_2 a4_561 = (word32) *((word32) a2_1161 + 7) << 24 | a3_558;
								if (a5_528 == a4_561)
								{
									Eq_2 a4_873 = (word32) g_w42015278;
									if ((word32) *((word32) s1_551 + 8) >= a4_873)
										goto l23042FFC;
									Eq_2 a0_885;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_558, a4_873, mstatus, out s1_857, out a0_885, out a3_583, out a4_616, out a5_612);
									if (a0_885 == 0x00)
										goto l23042FFC;
									if (s2_547 != 0x00)
										*s2_547 = a0_885;
									else
										*((word32) a0_885 + 116) = s0_531;
									goto l23043060;
								}
								Eq_2 a3_576;
								if (s2_547 == 0x00)
								{
									a3_576 = a5_528 - a4_561;
									if (a3_576 >= 0x00)
										goto l23043116;
									struct Eq_216295 * a0_861;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_576, a4_561, mstatus, out s1_857, out a0_861, out a3_583, out a4_616, out a5_612);
									if (a0_861 == null)
										goto l23042FFC;
									a0_861->t0074 = s0_531;
l23043060:
									a1_652 = s1_857;
									goto l23043062;
								}
								struct Eq_216252 * a7_564 = *((word32) s2_547 + 16);
								a1_465 = (word32) a7_564->b0005 << 8 | (word32) a7_564->b0004 | (word32) a7_564->b0006 << 16;
								a3_576 = (word32) a5_528 - 1 - ((word32) a7_564->b0007 << 24 | a1_465);
								if (a3_576 >= 0x00)
								{
									a3_576 = (word32) a5_528 + 1 - a4_561;
									if (a3_576 > 0x00)
										goto l23043116;
									word32 a5_2922;
									word32 a4_2921;
									Eq_2 a0_591;
									Eq_2 s1_587;
									s0_531 = tcp_seg_copy(s1_551, a1_465, a3_576, a4_561, mstatus, out s1_587, out a0_591, out a3_583, out a4_2921, out a5_2922);
									s4_114 = a0_591;
									if (a0_591 == 0x00)
										goto l23042FFC;
									struct Eq_216252 * a4_601 = *((word32) s2_547 + 16);
									a5_612 = (word32) a4_601->b0006 << 16 | ((word32) a4_601->b0004 | (word32) a4_601->b0005 << 8) | (word32) a4_601->b0007 << 24;
									Eq_2 a1_614 = s3_113->t0000;
									a4_616 = a5_612 + (word32) (*((word32) s2_547 + 8)) / 20 - a1_614;
									if (a4_616 > 0x00)
									{
										Eq_2 a0_619 = *((word32) s2_547 + 4);
										Eq_2 a1_620 = (word32) (word16) (a1_614 - a5_612);
										((word32) s2_547 + 8)->u0 = (word16) a1_620;
										word32 s8_2927;
										word32 s6_2926;
										word32 s3_2924;
										word32 s5_2925;
										word32 a2_2923;
										ra = pbuf_realloc(ra, a0_619, a1_620, a3_583, a4_616, a0_591, mstatus, dwArgE8, out s1_587, out a2_2923, out a3_583, out a4_616, out a5_612, out s2_547, out s3_2924, out s4_114, out s5_2925, out s6_2926, out s8_2927, out mstatus);
									}
									*s2_547 = s4_114;
									a1_652 = s1_587;
l23043062:
									ra = tcp_oos_insert_segment(ra, s0_531, a1_652, a3_583, a4_616, a5_612, s4_114, mstatus, dwArgA8, dwArgB8, dwArgC8, out s0_531, out mstatus);
									goto l23042FFC;
								}
l23043116:
								Eq_2 s1_657 = *a3_576;
								s2_547 = s1_657;
							} while (a3_576 != 0x00);
							if (a5_528 - a4_561 > 0x00)
							{
								word32 a5_2910;
								if ((lwip_htons((word32) *((word32) a2_1161 + 0x0C) | (word32) (*((word32) a2_1161 + 0x0D)) << 8, out a5_2910) & 0x01) == 0x00)
								{
									word32 a5_2911;
									Eq_2 a3_679;
									struct Eq_216394 * a4_680;
									word32 s1_683;
									Eq_2 a0_687;
									s0_531 = tcp_seg_copy(s1_657, a1_465, a3_576, a4_561, mstatus, out s1_683, out a0_687, out a3_679, out a4_680, out a5_2911);
									*a0_687 = s1_683;
									if (a0_687 != 0x00)
									{
										int32 a5_708 = (word32) a4_680->b0006 << 16 | ((word32) a4_680->b0004 | (word32) a4_680->b0005 << 8) | (word32) a4_680->b0007 << 24;
										Eq_2 a1_710 = s3_113->t0000;
										Eq_2 a4_712 = (word32) a4_680->ptr0010->w0008 + a5_708 - a1_710;
										if (a4_712 > 0x00)
										{
											Eq_2 a1_716 = (word32) (word16) (a1_710 - a5_708);
											*((word32) *((word32) a0_687 + 4) + 8) = (word16) a1_716;
											word32 s5_2918;
											word32 s6_2919;
											word32 a3_2914;
											word32 a2_2913;
											word32 s1_2912;
											word32 a4_2915;
											word32 s8_2920;
											word32 s2_2917;
											word32 a5_2916;
											ra = pbuf_realloc(ra, a0_687, a1_716, a3_679, a4_712, s4_114, mstatus, dwArgE8, out s1_2912, out a2_2913, out a3_2914, out a4_2915, out a5_2916, out s2_2917, out s3_113, out s4_114, out s5_2918, out s6_2919, out s8_2920, out mstatus);
										}
										Eq_2 a4_751 = s3_113->t0000;
										s0_531 = *((word32) a4_751 + 36);
										Eq_2 a4_757 = (word32) *((word32) s0_531 + 40);
										struct Eq_216463 * a5_758 = (word32) a4_751 + (word32) (*s4_114) - a4_751 - a4_757;
										if (a5_758 > null)
										{
											struct Eq_216604 * a5_760 = a5_758->ptr0010;
											struct Eq_216608 * a5_766;
											Eq_2 a0_765 = lwip_htons((word32) a5_760->b000C | (word32) a5_760->b000D << 8, out a5_766);
											Eq_2 a0_767 = a0_765 & 0x01;
											if ((a0_765 & 0x01) != 0x00)
											{
												struct Eq_216710 * a5_769 = a5_766->ptr0010;
												Eq_2 s2_773 = (word32) a5_769->b000D << 8 | (word32) a5_769->b000C;
												word32 a5_2939;
												word32 a5_2938;
												uint32 a0_787 = (word32) (word16) (s2_773 & 0xFC0000FF | lwip_htons(lwip_htons(s2_773, out a5_2938) & 62, out a5_2939));
												((word32) a4_757 + 0x0C)->u1 = (byte) a0_787;
												*((word32) a4_757 + 0x0D) = (byte) (a0_787 >> 8);
												a0_767 = a0_787 >> 8;
											}
											Eq_2 a3_793 = s3_113->t0000;
											s0_531 = *((word32) a3_793 + 36);
											struct Eq_216637 * a5_800 = (word32) a3_793 + ((word32) (*((word32) s0_531 + 40)) - a3_793);
											*((word32) a4_757 + 8) = (word16) a5_800;
											word32 a2_2929;
											struct Eq_216649 * a5_813;
											word16 * s4_827;
											word32 s1_2928;
											word32 a4_2931;
											word32 a3_2930;
											word32 s5_2934;
											word32 s6_2935;
											word32 s8_2936;
											word32 s2_2932;
											word32 s3_2933;
											ra = pbuf_realloc(ra, a0_767, (word32) a5_800->w0008, a3_793, a4_757, s4_114, mstatus, dwArgE8, out s1_2928, out a2_2929, out a3_2930, out a4_2931, out a5_813, out s2_2932, out s3_2933, out s4_827, out s5_2934, out s6_2935, out s8_2936, out mstatus);
											struct Eq_216677 * a5_839 = a5_813->ptr0010;
											word32 a5_2937;
											*s4_827 = (word16) ((word32) a5_813->w0008 + (word32) ((lwip_htons((word32) a5_839->b000C | (word32) a5_839->b000D << 8, out a5_2937) & 0x03) != 0x00));
										}
									}
								}
							}
						}
					}
				}
l23042FFC:
				0x00 = (uint16) dwArg0128;
				Eq_2 a0_1053;
				Eq_2 a3_1056;
				struct Eq_215354 * a4_1057;
				ptr32 mstatus_1061;
				Eq_2 s1_1063;
				Eq_2 s2_1064;
				struct Eq_215356 * s3_1065;
				Eq_2 s4_1066;
				Eq_2 s5_1067;
				ptr32 s6_1068;
				Eq_2 s7_1069;
				Eq_2 s8_1070;
				union Eq_2 * s9_1071;
				word32 a5_2945;
				word32 a2_2944;
				Eq_2 ra_1062 = tcp_send_empty_ack(ra, dwArgE4, s0_531, s7, mstatus, s5, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s1_1063, out a0_1053, out a2_2944, out a3_1056, out a4_1057, out a5_2945, out s2_1064, out s3_1065, out s4_1066, out s5_1067, out s6_1068, out s7_1069, out s8_1070, out s9_1071, out mstatus_1061);
				s0Out.u0 = <invalid>;
				s1Out = s1_1063;
				a0Out = a0_1053;
				a3Out = a3_1056;
				a4Out = a4_1057;
				s2Out = s2_1064;
				s3Out = s3_1065;
				s4Out = s4_1066;
				s5Out = s5_1067;
				s6Out = s6_1068;
				s7Out = s7_1069;
				s8Out = s8_1070;
				s9Out = s9_1071;
				mstatusOut = mstatus_1061;
				return ra_1062;
			}
		}
		if (a5_450 - a3 < 0x00)
			((word32) s0_1434 + 26)->u0 = (word16) ((word32) *((word32) s0_1434 + 26) | 2);
		goto l23042A90;
	}
	struct Eq_215395 * a0_33 = (a5_5 & 0x10)->ptr0054;
	Eq_2 a1_32 = g_t4200DF94;
	up32 a6_35 = (word32) a0_33->b0014;
	a3 = (word32) a0_33->w0060;
	a0 = (a5_5 & 0x10) - a1_32;
	Eq_2 a4_105 = g_t4200DF84;
	s1.u0 = 0x4200DF84;
	if (a0 >= 0x00 && ((a5_5 & 0x10) != a1_32 || a2 - a4_105 >= 0x00))
	{
		if (a2 != a4_105)
			goto l2304292E;
		a0 = g_t4200DF9C;
		if (a3 >= ((word32) (*((word32) a0 + 0x0F)) << 8 | (word32) (*((word32) a0 + 0x0E))))
		{
l2304292E:
			Eq_2 a5_106;
			Eq_2 s0_319 = *((word32) a1_32 + 0x0044);
			int32 a5_77 = a4_105 - a1_32;
			if (a5_77 <= 0x00)
			{
				a5_106 = (word32) g_w4200DFAA;
				if (a5_106 == 0x00)
				{
					s0_319 = *((word32) a0 + 88);
					a3 += a2;
					a5_106 = (word32) a0 + (word32) (*((word32) s0_319 + 96));
					if (a5_106 == a3)
					{
						a5_106 = (int32) *((word32) s0_319 + 48);
						if (a5_106 >= 0x00 && a1_32 == a4_105)
						{
							int32 a5_328 = (word32) *((word32) s0_319 + 67);
