pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
							if (a5_328 != 0x00FF)
								((word32) s0_319 + 67)->u1 = (byte) (a5_328 + 0x01);
							a4_105 = (word32) *((word32) s0_319 + 67);
							a5_106.u0 = 0x03;
							if (a4_105 > 0x03)
							{
								Eq_2 a4_336 = (word32) *((word32) s0_319 + 72);
								a5_106 = (word32) (word16) ((word32) a4_336 + (word32) (*((word32) s0_319 + 50)));
								if (a5_106 < a4_336)
									a5_106.u0 = 0x0FFFFFFF;
								((word32) s0_319 + 72)->u0 = (word16) a5_106;
							}
							else
							{
								s5_115 = s5;
								if (a4_105 != 0x03)
									goto l2304299C;
							}
							s1 = tcp_rexmit_fast(0x4200DF84, a5_106, out a0, out a2, out a3, out a4_105, out a5_106, out s2, out s3_113, out s4_114);
							s5_115 = s5;
l2304299C:
							if (a2 != 0x00)
							{
								Eq_2 s0_379 = *((word16) a5_106.u0 + 56);
								s1 = *a4_105;
								if (a5_106 - a4_105 < 0x00)
								{
									int32 a3_384 = (int32) *((word32) s0_379 + 60);
									uint32 a4_386 = (word32) g_t4201FEA4;
									uint32 a2_387 = a2 << 16;
									uint32 a1_390 = a3_384 >> 0x03 << 16;
									word32 a5_395 = (word32) (word16) (a4_386 - (a2_387 >> 16) - (a1_390 >> 16));
									int32 a5_399 = (int32) (word16) (a5_395 + a3_384);
									*((word32) s0_379 + 60) = (word16) a5_399;
									a0 = (int32) (word16) a5_395;
									if (a0 < 0x00)
										a0 = (int32) (word16) ((a2_387 >> 16) - a4_386 + (a1_390 >> 16));
									a3 = (int32) *((word32) s0_379 + 62);
									((word32) s0_379 + 52)->u0 = 0x00;
									word32 a4_417 = CONVERT(SLICE(a3 - (a3 >> 0x02) + a0, word16, 0), word16, word32);
									*((word32) s0_379 + 62) = (word16) a4_417;
									*((word32) s0_379 + 64) = (word16) ((a5_399 >> 3) + a4_417);
								}
							}
							goto l23042A0C;
						}
					}
				}
				((word32) s0_319 + 67)->u1 = 0x00;
				s5_115 = s5;
				goto l2304299C;
			}
			Eq_2 s0_81 = *((word32) a3 + 80);
			if (a4_105 - a3 > 0x00)
			{
				word32 s8_2946;
				ra = tcp_send_empty_ack(ra, s0_81, s0_81, s7, mstatus, dwArg28, dwArg38, s5, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, out s1, out a0, out a2, out a3, out a4_105, out a5_106, out s2, out s3_113, out s4_114, out s5_115, out s6, out s7, out s8_2946, out s9, out mstatus);
				goto l2304299C;
			}
			ui32 a3_127 = (word32) *((word32) s0_81 + 26);
			if ((a3_127 & 4) != 0x00)
			{
				((word32) s0_81 + 26)->u0 = (word16) (a3_127 & ~0x04);
				word32 a3_131 = (word32) *((word32) s0_81 + 74);
				((word32) s0_81 + 0x006A)->u0 = 0x00;
				((word32) s0_81 + 72)->u0 = (word16) a3_131;
			}
			int32 a3_136 = (int32) *((word32) s0_81 + 60);
			word32 a2_137 = (word32) *((word32) s0_81 + 62);
			*((word32) a4_105 + 0x0044) = s0_81;
			*((word32) s0_81 + 64) = (word16) ((a3_136 >> 3) + a2_137);
			*((word32) s0_81 + 66) = 0x00;
			struct Eq_215195 * a4_144 = (struct Eq_215195 *) 0x03;
			if (a6_35 > 0x03)
			{
				uint32 a5_167;
				struct Eq_215195 * a3_150 = (word32) *((word32) s0_81 + 72);
				struct Eq_215195 * a5_154 = (word32) (word16) a5_77;
				if (a3_150 < (word32) (*((word32) s0_81 + 74)))
				{
					struct Eq_215195 * a4_176 = (word32) (((word32) *((word32) s0_81 + 26) & 0x00FFF800) < 1) + 0x01 + (word32) (*((word32) s0_81 + 50));
					struct Eq_215195 * a2_177 = a4_176;
					a4_144 = (word32) (word16) a4_176;
					if (a5_154 < a4_144)
						a2_177 = a5_154;
					a5_167 = a3_150 + a2_177;
				}
				else
				{
					a4_144 = (word32) *((word32) s0_81 + 0x006A);
					word32 a5_158 = CONVERT(SLICE(a5_154 + a4_144, word16, 0), word16, word32);
					if (a5_158 >= a4_144)
					{
						if (a5_158 < a3_150)
						{
							((word32) s0_81 + 0x006A)->u0 = (word16) a5_158;
							goto l23042CF8;
						}
					}
					else
						a5_158 = (struct Eq_215195 *) 0x0FFFFFFF;
					((word32) s0_81 + 0x006A)->u0 = (word16) (a5_158 - a3_150);
					a5_167 = a3_150 + (word32) (*((word32) s0_81 + 50)) / 11;
				}
				uint32 a5_185 = a5_167 << 16;
				uint32 a5_186 = a5_185 >> 16;
				if (a5_185 >> 16 < a3_150)
					a5_186 = ~0x00;
				((word32) s0_81 + 72)->u0 = (word16) a5_186;
			}
l23042CF8:
			struct Eq_217239 * a0_227;
			uint16 * s2_231;
			Eq_2 a1_237;
			struct Eq_215195 * a4_239;
			word32 s3_2949;
			word32 s5_2951;
			word32 a2_2947;
			word32 a5_2948;
			word32 s4_2950;
			tcp_free_acked_segments.isra.3(ra, (word32) *((word32) a1_32 + 112) + 0x0066, a1_32, a4_144, mstatus, dwArgB8, out a0_227, out a1_237, out a2_2947, out a4_239, out a5_2948, out s2_231, out s3_2949, out s4_2950, out s5_2951);
			a0_227->t0070 = *((word32) a1_237 + 0x006C);
			word32 a4_2953;
			word32 a1_2952;
			s1 = tcp_free_acked_segments.isra.3(ra, s2_231, a1_237, a4_239, mstatus, dwArgB8, out a0, out a1_2952, out a2, out a4_2953, out a5_106, out s2, out s3_113, out s4_114, out s5_115);
			Eq_2 s0_262 = *((word16) a5_106.u0 + 112);
			*((word32) a0 + 0x006C) = s0_262;
			((word32) s0_262 + 28)->u1 = 0x00;
			*((word32) s0_262 + 48) = (word16) (0x00 - (word32) (a5_106 < 1));
			if (a0 == 0x00)
				((word32) s0_262 + 0x0068)->u0 = 0x00;
			((word32) s0_262 + 100)->u0 = (uint16) ((word32) *((word32) s0_262 + 100) + g_w4200DF8A);
			a4_105 = (word32) *((word32) s0_262 + 26);
			a3 = a4_105 << 0x14;
			if (a4_105 << 0x14 >= 0x00)
				goto l2304299C;
			if (a5_106 == 0x00)
			{
				if (a0 == 0x00)
					goto l23042D4A;
				s2 = *((word32) s0_262 + 76);
			}
			else
				s2 = *((word32) s0_262 + 76);
			a0 = s2 - lwip_htonl((word32) (*((word16) a4_105.u0 + 7)) << 24 | ((word32) (*((word16) a4_105.u0 + 6)) << 16 | ((word32) (*((word16) a4_105.u0 + 5)) << 8 | (word32) (*((word16) a4_105.u0 + 4)))), out a3, out a4_105, out a5_106);
			if (a0 > 0x00)
				goto l2304299C;
l23042D4A:
			ui32 a5_305 = (word32) *((word32) s0_262 + 26);
			((word32) s0_262 + 26)->u0 = (word16) (a5_305 & ~0x00FFF800);
			a4_105.u0 = ~0x00FFF800;
			a5_106 = a5_305 & ~0x00FFF800;
			goto l2304299C;
		}
	}
	Eq_2 a0_55 = g_t4200DF9C;
	a0 = (word32) *((word32) a0 + 98);
	Eq_2 a5_62 = (word32) *((word32) a0_55 + 0x0F) << 8 | (word32) (*((word32) a0_55 + 0x0E));
	*((word32) a0 + 96) = (word16) a5_62;
	if (a0 < a5_62)
		*((word32) a0 + 98) = (word16) a5_62;
	*((word32) a1_32 + 84) = a0;
	*((word32) a4_105 + 88) = a0;
	goto l2304292E;
}

