pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304325C: Register Eq_2 tcp_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgEC, Stack word32 dwArg010C, Stack Eq_2 dwArg0128, Stack word32 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack word32 dwArg01A8)
// Called from:
//      ip4_input
Eq_2 tcp_input(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, word32 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArgEC, word32 dwArg010C, Eq_2 dwArg0128, word32 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, word32 dwArg01A8)
{
	struct Eq_217564 * a5_32 = (word32) g_w4201FE2E;
	g_w4201FE2E = (word16) ((char *) a5_32 + 1);
	Eq_2 a0_37 = a5_32->t0005;
	g_ptr4200EF9C = (char *) a5_32 + 1;
	struct Eq_217580 * sp_1303 = fp + -80;
	Eq_2 a4_120 = 1107426712;
	struct Eq_217586 * s10_1133 = &g_t4201FD98;
	if ((word32) *((word32) a0_37 + 0x0A) <= 0x13)
	{
l230432A4:
		g_w4201FE36 = (word16) ((word32) g_w4201FE36 + 0x01);
		goto l230432E4;
	}
	word32 a5_5641;
	word32 a3_5640;
	if (ip4_addr_isbroadcast_u32(g_t4201FED4, g_t4201FEC0, out a3_5640, out a4_120, out a5_5641) != null)
	{
l230432DA:
		g_w4201FE3C = (word16) ((word32) g_w4201FE3C + 0x01);
		goto l230432E4;
	}
	a4_120.u0 = 224;
	if ((g_t4201FED4 & 0x00F0) == 224)
		goto l230432DA;
	word32 s6_1000 = 0x42020000;
	word32 a0_62;
	struct Eq_217641 * s2_71;
	Eq_2 s4_73;
	word32 s5_5646;
	word32 a3_5643;
	word32 s3_5645;
	word32 a2_5642;
	word32 a6_5644;
	Eq_2 s1_123;
	Eq_2 s0_69 = ip_chksum_pseudo(a0_37, 0x06, (word32) *((word32) a0_37 + 8), 1107427024, 1107427028, out s1_123, out a0_62, out a2_5642, out a3_5643, out a4_120, out a6_5644, out s2_71, out s3_5645, out s4_73, out s5_5646);
	if (a0_62 != 0x00)
	{
		g_w4201FE34 = (word16) ((word32) g_w4201FE34 + 0x01);
l230432E4:
		g_w4201FE32 = (word16) ((word32) g_w4201FE32 + 0x01);
		goto l23043728;
	}
	Eq_2 a5_80 = s2_71->tFFFFFF9C;
	int32 * s2_1097 = &s2_71->tFFFFFF9C;
	word32 a5_5647;
	Eq_2 a1_88 = lwip_htons((word32) *((word32) a5_80 + 0x0C) | (word32) (*((word32) a5_80 + 0x0D)) << 8, out a5_5647) >> 0x0A & 252;
	if (s0_69 >= a1_88)
		goto l230432A4;
	a4_120 = (word32) (word16) a1_88;
	if ((word32) *((word32) s1_123 + 8) < a4_120)
		goto l230432A4;
	uint32 a5_94 = (word32) a4_120 - 20 << 16;
	Eq_2 a3_96 = (word32) *((word32) s1_123 + 0x0A);
	g_w4200DFA8 = (word16) (a5_94 >> 16);
	g_t4200DFA4.u0 = 0x00;
	dwLoc4C.u0 = 1107353512;
	if (a3_96 >= a4_120)
	{
		g_w4200DFA0 = (word16) (a5_94 >> 16);
		word32 a3_5671;
		word32 a1_5670;
		word32 a4_5672;
		word32 a5_5673;
		pbuf_remove_header(s1_123, a1_88, 1107353512, out a1_5670, out a3_5671, out a4_5672, out a5_5673);
	}
	else
	{
		word32 a3_5664;
		word32 a4_5665;
		word32 a5_5666;
		word32 a1_5663;
		pbuf_remove_header(s1_123, 0x14, 1107353512, out a1_5663, out a3_5664, out a4_5665, out a5_5666);
		Eq_2 s0_113 = (word32) *((word32) s1_123 + 0x0A);
		word32 s7_115 = (word32) g_w4200DFA8;
		g_w4200DFA0 = (word16) s0_113;
		word32 a1_5667;
		word32 a5_5669;
		word32 a3_5668;
		Eq_2 a0_118 = pbuf_remove_header(s1_123, s0_113, 1107353512, out a1_5667, out a3_5668, out a4_120, out a5_5669);
		s1_123 = *a0_118;
		Eq_2 a5_126 = (word32) *((word32) a0_118 + 0x0A);
		Eq_2 s3_127 = (word32) (word16) (s7_115 - s0_113);
		if (a5_126 < s3_127)
			goto l230432A4;
		Eq_2 a0_128 = *((word32) a5_126 + 4);
		g_t4200DFA4 = a5_126;
		word32 a5_5846;
		word32 a4_5845;
		word32 a3_5844;
		word32 a1_5843;
		pbuf_remove_header(a0_128, s3_127, 1107353512, out a1_5843, out a3_5844, out a4_5845, out a5_5846);
		((word32) s1_123 + 8)->u0 = (word16) ((word32) s0_113 + (word32) (*((word32) s1_123 + 8)) - s7_115);
	}
	Eq_2 s0_149 = s2_71->tFFFFFF9C;
	word32 a5_5847;
	Eq_2 a0_157 = lwip_htons((word32) *s0_149 | (word32) (*((word32) s0_149 + 1)) << 8, out a5_5847);
	s0_149->u1 = (byte) a0_157;
	((word32) s0_149 + 1)->u1 = (byte) (a0_157 >> 8);
	Eq_2 s0_162 = s2_71->tFFFFFF9C;
	word32 a5_5848;
	Eq_2 a0_167 = lwip_htons((word32) *((word32) s0_162 + 2) | (word32) (*((word32) s0_162 + 3)) << 8, out a5_5848);
	((word32) s0_162 + 2)->u1 = (byte) a0_167;
	*((word32) s0_162 + 3) = (byte) (a0_167 >> 8);
	Eq_2 s0_172 = s2_71->tFFFFFF9C;
	word32 a3_5849;
	word32 a5_5851;
	word32 a4_5850;
	Eq_2 a0_183 = lwip_htonl((word32) *((word32) s0_172 + 7) << 24 | ((word32) (*((word32) s0_172 + 6)) << 16 | ((word32) (*((word32) s0_172 + 5)) << 8 | (word32) (*((word32) s0_172 + 4)))), out a3_5849, out a4_5850, out a5_5851);
	((word32) s0_172 + 5)->u1 = (byte) (a0_183 >> 0x08);
	*((word32) s0_172 + 6) = (byte) (a0_183 >> 0x10);
	((word32) s0_172 + 4)->u1 = (byte) a0_183;
	*((word32) s0_172 + 7) = (byte) (a0_183 >> 0x18);
	Eq_2 s0_194 = s2_71->tFFFFFF9C;
	g_t4200EF94 = a0_183;
	word32 a4_5853;
	word32 a3_5852;
	word32 a5_5854;
	Eq_2 a0_207 = lwip_htonl((word32) *((word32) s0_194 + 11) << 24 | ((word32) (*((word32) s0_194 + 0x0A)) << 16 | ((word32) (*((word32) s0_194 + 9)) << 8 | (word32) (*((word32) s0_194 + 8)))), out a3_5852, out a4_5853, out a5_5854);
	((word32) s0_194 + 9)->u1 = (byte) (a0_207 >> 0x08);
	((word32) s0_194 + 0x0A)->u1 = (byte) (a0_207 >> 0x10);
	((word32) s0_194 + 8)->u1 = (byte) a0_207;
	((word32) s0_194 + 11)->u1 = (byte) (a0_207 >> 0x18);
	Eq_2 s0_218 = s2_71->tFFFFFF9C;
	g_t4200EF84 = a0_207;
	word32 a5_5855;
	Eq_2 a0_225 = lwip_htons((word32) *((word32) s0_218 + 0x0E) | (word32) (*((word32) s0_218 + 0x0F)) << 8, out a5_5855);
	Eq_2 a5_227 = s2_71->tFFFFFF9C;
	*((word32) s0_218 + 0x0E) = (byte) a0_225;
	((word32) s0_218 + 0x0F)->u1 = (byte) (a0_225 >> 8);
	word32 a5_5856;
	Eq_2 a0_235 = lwip_htons((word32) *((word32) a5_227 + 0x0C) | (word32) (*((word32) a5_227 + 0x0D)) << 8, out a5_5856);
	g_b4200EF88 = (byte) (a0_235 & 0x00FF & 63);
	union Eq_2 * s11_1134 = &g_t4200DF94;
	Eq_2 s5_1100 = 0x4200DF84;
	a4_120 = a0_235 & 0x00FF;
	uint32 a3_243 = (word32) *((word32) s1_123 + 8);
	Eq_2 s7_1001 = 0x4200DF88;
	if ((a0_235 & 0x00FF & 3) != 0x00)
	{
		uint32 a5_248 = a3_243 + 1 << 16;
		g_w4200DFAA = (word16) (a5_248 >> 16);
		if (a5_248 >> 16 < a3_243)
			goto l230432A4;
	}
	else
		g_w4200DFAA = (word16) a3_243;
	Eq_2 a6_253 = g_t4201FEAC;
	Eq_2 s3_1098 = 0x42020000;
	struct Eq_217855 * t4_256 = *((word32) s4_73 + 4);
	Eq_2 a3_1014 = s2_71->tFFFFFF9C;
	Eq_217862 t6_259 = *((word32) s4_73 + 16);
	Eq_217862 t5_260 = *((word32) s4_73 + 20);
	Eq_2 s0_2313 = a6_253;
	Eq_2 a0_262 = 0x00;
	while (s0_2313 != 0x00)
	{
		ui32 t3_265 = (word32) *((word32) s0_2313 + 8);
		if ((t3_265 == 0x00 || t3_265 == ((word32) t4_256->b0044 + 0x01 & 0x00FF)) && (word32) (*((word32) s0_2313 + 24)) == ((word32) (*((word32) a3_1014 + 1)) << 8 | (word32) (*a3_1014)))
		{
			Eq_217862 a5_283 = (word32) *((word32) a3_1014 + 3) << 8 | (word32) (*((word32) a3_1014 + 2));
			if ((word32) *((word32) s0_2313 + 22) != a5_283)
				goto l23043672;
			s0_2313 = *((word32) a5_283 + 4);
			if (a5_283 != t6_259)
				goto l23043672;
			s0_2313 = *a5_283;
			if (a5_283 != t5_260)
				goto l23043672;
			if (a0_262 != 0x00)
			{
				Eq_2 s0_304 = *((word32) a5_283 + 0x0C);
				*(union Eq_2 *) 0x42020EAC = s0_304;
				*((word32) a5_283 + 0x0C) = a0_262;
				*((word32) s0_304 + 0x0C) = a6_253;
			}
			else
				g_w4201FE42 = (word16) ((word32) g_w4201FE42 + 0x01);
			Eq_2 a0_1085 = (word32) *((word32) s1_123 + 8);
			g_ptr4200EF8C = null;
			g_b4200EF90 = 0x00;
			g_w4200EF8A = 0x00;
			g_dw42015270 = 0x00;
			g_w42015278 = (word16) a0_1085;
			*((word32) s1_123 + 4) = 0x42015270;
			*((word16) a3_1014.u0 + 16) = 0x42015270;
			struct Eq_217965 * a5_322 = &g_dw42015270;
			Eq_2 s4_1033 = 0x4200DF90;
			uint16 * s8_1102 = &g_w4200DF8A;
			union Eq_2 * s9_1002 = &g_t4200DF8C;
			if ((a0_235 & 0x00FF & 0x08) != 0x00)
			{
				ui32 a5_350 = (word32) *((word32) s1_123 + 0x0D);
				*((word32) s1_123 + 0x0D) = (byte) (a5_350 | 1);
				a5_322 = a5_350 | 1;
			}
			Eq_2 a4_1015;
			Eq_2 s0_1041 = a5_322->t0078;
			Eq_2 s1_1096 = 0x42020000;
			if (a5_322 != null)
			{
				word32 a2_5675;
				ra = tcp_process_refused_data(ra, 0x42020000, s0_1041, 0x42020000, 0x4200DF90, 0x4200DF88, mstatus, s6, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg28, dwArg38, s11, s5, s3, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, out s0_1041, out s1_1096, out a0_1085, out a2_5675, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out s10_1133, out s11_1134, out mstatus);
				if (a0_1085 != ~0x0C)
				{
					s0_1041 = *(union Eq_2 *) 0x6B;
					a4_1015.u0 = 0x4200E000;
					if (true && (word32) g_w4200DFAA != 0x00)
						goto l2304361A;
					goto l2304391A;
				}
l2304361A:
				if ((word32) *((word32) s0_1041 + 42) == 0x00)
				{
					word32 s3_5679;
					word32 s2_5678;
					word32 a2_5676;
					word32 a5_5677;
					word32 s6_5681;
					word32 s5_5680;
					word32 s7_5682;
					word32 s8_5683;
					ra = tcp_send_empty_ack(ra, s0_1041, s0_1041, s7_1001, mstatus, dwArg08, dwArg18, dwArg38, s5, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, out s1_1096, out a0_1085, out a2_5676, out a3_1014, out a4_1015, out a5_5677, out s2_5678, out s3_5679, out s4_1033, out s5_5680, out s6_5681, out s7_5682, out s8_5683, out s9_1002, out mstatus);
				}
				s10_1133->w009A = (word16) ((word32) s10_1133->w009A + 0x01);
				goto l23043630;
			}
l2304391A:
			Eq_2 s0_1966;
			ui32 a5_1346;
			ui32 a5_1344;
			a4_1015 = (word32) *s7_1001.u0;
			*((word32) s1_1096 + 0x0EB8) = s0_1041;
			if ((a4_1015 & 4) != 0x00)
			{
				a4_1015 = (word32) *((word32) s0_1041 + 20);
				if (a4_1015 == 0x02)
				{
					s0_1041 = *((word32) a4_1015 + 80);
					if (a4_1015 == *s5_1100)
						goto l2304393C;
					goto l23043952;
				}
				s0_1041 = *((word32) a4_1015 + 36);
				Eq_2 a5_1338 = *s11_1134;
				if (a4_1015 != a5_1338)
				{
					int32 a5_1339 = a5_1338 - a4_1015;
					if (a5_1339 < 0x00)
						goto l23043952;
					a4_1015 = (word32) *((word32) s0_1041 + 40);
					if (a5_1339 - a4_1015 > 0x00)
						goto l23043952;
l23043994:
					a5_1344 = (word32) *((word32) s0_1041 + 26);
					goto l230439B6;
				}
l2304393C:
				s4_1033->u1 = (byte) ((word32) *s4_1033 | 8);
				a5_1346 = (word32) *((word32) s0_1041 + 26) & ~0x01;
				goto l2304394E;
			}
			s10_1133 = a4_1015 & 2;
			a5_1344 = (word32) *((word32) s0_1041 + 26);
			if ((a4_1015 & 2) != 0x00)
			{
				a0_1085.u0 = 0x01;
				a3_1014 = (word32) *((word32) s0_1041 + 20) + ~0x01 & 0x00FF;
				if (a3_1014 <= 0x01)
					goto l230439BC;
l230439B6:
				a5_1346 = a5_1344 | 2;
l2304394E:
				((word32) s0_1041 + 26)->u0 = (word16) a5_1346;
			}
			else
			{
l230439BC:
				Eq_210739 a5_431 = a5_1344 & 0x10;
				if ((a5_1344 & 0x10) == 0x00)
				{
					a5_431 = g_t4201FEA4;
					*((word32) a5_431 + 32) = s0_1041;
				}
				*((word32) dwArg94 + 0x00A2) = 0x00;
				s0_1041 = dwArg94;
				if ((word32) *a5_431 != 0x00)
				{
					tcp_parseopt.isra.0.part.1((word32) dwArg94 + 50, dwArgD8, out s1_1096, out a0_1085, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102);
					dwLoc4C = a4_1015;
					s0_1041 = dwArg74;
				}
				a3_1014.u0 = 0x07;
				uint32 a5_474 = (word32) *((word32) s0_1041 + 20) + ~0x01 & 0x00FF;
				if (a5_474 <= 0x07)
				{
					word32 a5_1045;
					Eq_2 a3_590;
					Eq_2 s1_591;
					Eq_2 a5_593;
					Eq_2 a5_597;
					Eq_2 a4_585;
					a3_1014.u0 = 587752556;
					struct Eq_219142 * a5_479 = *((char *) g_a2308646C + a5_474 * 0x04);
					switch (a5_479)
					{
					case 0x00:
						struct Eq_219147 * a5_1050 = a4_1015 & 18;
						a3_1014.u0 = 0x12;
						if (a5_1050 == (struct Eq_219147 *) 0x12)
						{
							s0_1041 = a5_1050->t0044;
							a3_1014 = *s5_1100;
							if ((char *) a5_1050 + 1 != a3_1014)
								goto l23043AE6;
							Eq_2 a4_1145 = *s11_1134;
							a5_1050->t0045 = s0_1041;
							*((word32) a4_1145 + 37) = s0_1041;
							*((word32) a4_1145 + 45) = s0_1041;
							struct Eq_220025 * a3_1150 = *s2_1097;
							s2_1097 = (word32) *((word32) s0_1041 + 50);
							ui32 a5_1153 = (word32) a3_1150->b000F;
							ui32 a2_1154 = (word32) a3_1150->b000E;
							*((word32) a4_1145 + 83) = s0_1041;
							ui32 a5_1157 = a5_1153 << 8 | a2_1154;
							*((word32) s0_1041 + 96) = (word16) a5_1157;
							*((word32) s0_1041 + 98) = (word16) a5_1157;
							((word32) s0_1041 + 20)->u1 = 0x04;
							word32 a3_5832;
							word32 a5_5834;
							word32 a3_5835;
							word32 a4_5833;
							word32 a2_5831;
							ui32 a0_1174 = tcp_eff_send_mss_netif(s2_1097, ip4_route((word32) s0_1041 + 4, 0x04, out a2_5831, out a3_5832, out a4_5833, out a5_5834), out a3_5835);
							((word32) s0_1041 + 50)->u0 = (word16) a0_1174;
							struct Eq_220084 * a0_1181 = (struct Eq_220084 *) 0x0100011C;
							Eq_2 a3_1182 = a0_1174 << 0x01;
							if (a0_1174 << 0x01 < 0x0100011C)
								a3_1182.u0 = 0x0100011C;
							uint32 a0_1188;
							if (a0_1174 << 0x02 >= a3_1182)
							{
								if (a0_1174 << 0x01 > 0x0100011C)
								{
									a0_1188 = a0_1174 << 0x11;
l23043A8C:
									a0_1181 = a0_1188 >> 16;
								}
								Eq_2 a0_1204;
								struct Eq_220183 * a5_1198 = (word32) *((word32) s0_1041 + 0x0066);
								*((word32) s0_1041 + 72) = (word16) a0_1181;
								struct Eq_220188 * s0_1201 = a0_1181->ptr0070;
								s0_1201->w0066 = (word16) &a5_1198->tFFFFFFFF;
								if (a0_1181 == null)
								{
									a0_1204 = a5_1198->tFFFFFFFF;
									a5_1198->dw006B = a0_1181->dw006C;
								}
								else
								{
									a0_1204 = a5_1198->tFFFFFFFF;
									a5_1198->ptr006F = s0_1201;
								}
								word32 a1_5838;
								word32 a2_5839;
								struct Eq_220253 * a5_1238;
								s1_1096 = tcp_seg_free(ra, a0_1204, a3_1182, a0_1174 << 0x01, s4_1033, mstatus, dwArgB8, out a0_1085, out a1_5838, out a2_5839, out a3_1014, out a4_1015, out a5_1238);
								s0_1041 = a5_1238->t0070;
								if (a5_1238 == null)
									*((word32) s0_1041 + 48) = ~0x00;
								else
								{
									*((word32) s0_1041 + 48) = 0x00;
									((word32) s0_1041 + 66)->u1 = 0x00;
								}
								Eq_2 a5_1248 = *((word32) s0_1041 + 0x0088);
								if (a5_1248 == 0x00)
									goto l23043994;
								word32 s0_1250 = *((word16) a0_1085.u0 + 16);
								word32 t2_1331;
								a5_1248();
								if (a0_1085 == ~0x0C)
									goto l23043630;
								goto l23043994;
							}
							else
							{
								a0_1188 = a0_1174 << 0x12;
								goto l23043A8C;
							}
						}
l23043AE6:
						a4_1015 &= 0x10;
						if (a4_1015 != 0x00)
						{
							word32 a4_5840;
							word32 a5_5841;
							ra = tcp_rst(ra, s0_1041, *s5_1100, (char *) *s11_1134 + (word32) g_w4200DFAA, s7_1001, mstatus, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_5840, out a5_5841, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
							a4_1015 = (word32) *((word32) s0_1041 + 66);
							if (a4_1015 <= 0x05)
							{
								*((word32) s0_1041 + 48) = 0x00;
								ra = tcp_rexmit_rto(ra, s1_1096, a4_1015, 0x05, s7_1001, mstatus, s10, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out s10_1133, out s11_1134, out mstatus);
							}
						}
						break;
					case 0x01:
						a4_1015 &= 0x10;
						if (a4_1015 != 0x00)
						{
							Eq_2 a1_839 = *s5_1100;
							Eq_2 s0_840 = *((word16) a4_1015.u0 + 0x0044);
							struct Eq_219950 * a5_842 = (word32) a1_839 - 1 - a4_1015;
							if (a5_842 >= null)
							{
								s0_840 = a5_842->t0050;
								if (a1_839 - a5_842 > 0x00)
									goto l23043BEA;
								((word32) s0_840 + 20)->u1 = 0x04;
								s0_1966 = *(union Eq_2 *) 0x80;
								if (false)
									goto l23043B68;
								Eq_2 a5_922 = *(union Eq_2 *) 0x1C;
								if (a5_922 == 0x00)
									goto l23043B68;
								word32 s0_928 = *((word16) a0_1085.u0 + 16);
								Eq_2 s5_958;
								Eq_2 a2_968;
								word32 t2_977;
								a5_922();
								if (a0_1085 != 0x00)
								{
									if (a0_1085 != ~0x0C)
										goto l23043B68;
									goto l23043630;
								}
								word32 a4_5837;
								word32 a3_5836;
								ra = tcp_receive(ra, s1_1096, s0_1966, a2_968, a3_1014, s5_958, s7_1001, mstatus, sp_1303->t0028, sp_1303->t0038, sp_1303->t0068, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00D8, sp_1303->t00E4, sp_1303->t00E8, sp_1303->t0108, sp_1303->t0118, sp_1303->t0128, out s0_1041, out s1_1096, out a0_1085, out a3_5836, out a4_5837, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
								word32 a5_1008 = (word32) *s8_1102;
								if (a5_1008 != 0x00)
									*s8_1102 = (word16) (a5_1008 + ~0x00);
								ui32 a5_1013 = (word32) *((word32) s0_1041 + 50);
								a3_1014 = a5_1013 << 0x01;
								a4_1015 = a5_1013 << 0x02;
								uint32 a5_1017 = 0x0100011C;
								uint32 a2_1018 = a5_1013 << 0x01;
								if (a5_1013 << 0x01 < 0x0100011C)
									a2_1018 = 0x0100011C;
								uint32 a5_1024;
								if (a5_1013 << 0x02 >= a2_1018)
								{
									if (a5_1013 << 0x01 > 0x0100011C)
									{
										a5_1024 = a5_1013 << 0x11;
l23043BBA:
										a5_1017 = a5_1024 >> 16;
									}
									*((word32) s0_1041 + 72) = (word16) a5_1017;
									goto l23043BC0;
								}
								else
								{
									a5_1024 = a5_1013 << 0x12;
									goto l23043BBA;
								}
							}
l23043BEA:
							word32 a5_5830;
							ra = tcp_rst(ra, s0_840, a1_839, (char *) *s11_1134 + (word32) g_w4200DFAA, s7_1001, mstatus, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out a5_5830, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						}
						else if ((a4_1015 & 2) != 0x00)
						{
							s0_1041 = a5_479->t0024;
							a4_1015 = *s11_1134;
							if ((char *) a5_479 - 1 == a4_1015)
							{
								word32 a5_5842;
								s0_1041 = tcp_rexmit(s1_1096, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out a5_5842, out s2_1097, out s3_1098, out s4_1033, out s8_1102);
							}
						}
						break;
					case 0x02:
					case 0x05:
						ra = tcp_receive(ra, s1_1096, s0_1041, 0x4200DFAA, 587752556, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgB8, dwArgC8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
l23043BC0:
						if (((word32) *s4_1033 & 32) != 0x00)
						{
							((word32) s0_1041 + 26)->u0 = (word16) ((word32) *((word32) s0_1041 + 26) | 2);
							a5_1045 = 0x07;
							goto l23043BDA;
						}
						break;
					case 0x03:
						ra = tcp_receive(ra, s1_1096, s0_1041, 0x4200DFAA, 587752556, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgB8, dwArgC8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s4_1033 & 32) != 0x00)
						{
							ui32 a4_685 = (word32) *s7_1001.u0;
							ui32 a5_686 = (word32) *((word32) s0_1041 + 26);
							a4_1015 = a4_685 & 0x10;
							if ((a4_685 & 0x10) != 0x00)
							{
								s0_1041 = *((word16) a3_1014.u0 + 80);
								a4_1015 = *s5_1100;
								if (a3_1014 == a4_1015)
								{
									s0_1041 = *((word16) a4_1015.u0 + 0x006C);
									if (a4_1015 == 0x00)
									{
										((word32) s0_1041 + 26)->u0 = (word16) (a5_686 | 2);
										word32 a5_5818;
										word32 a2_5817;
										word32 a0_5815;
										word32 a1_5816;
										s1_591 = tcp_pcb_purge(ra, s0_1041, a3_1014, s4_1033, mstatus, dwArg88, dwArg98, dwArgC8, out a0_5815, out a1_5816, out a2_5817, out a3_590, out a4_585, out a5_5818);
										a5_593 = *((word32) s3_1098 - 340);
										if (s0_1041 == a5_593)
											goto l23043C86;
										while (a5_593 != 0x00)
										{
											a5_597 = *((word32) a4_585 + 0x0C);
											if (s0_1041 == a4_585)
												goto l23043C94;
											a5_593 = a4_585;
										}
										goto l23043C9E;
									}
								}
							}
							((word32) s0_1041 + 26)->u0 = (word16) (a5_686 | 2);
							a5_1045 = 0x08;
							goto l23043BDA;
						}
						if (((word32) *s7_1001.u0 & 0x10) != 0x00)
						{
							s0_1041 = *((word16) a4_1015.u0 + 80);
							Eq_2 a5_682 = *s5_1100;
							if (a4_1015 == a5_682)
							{
								s0_1041 = *((word32) a5_682 + 0x006C);
								if (a5_682 == 0x00)
								{
									a5_1045 = 0x06;
l23043BDA:
									((word32) s0_1041 + 20)->u1 = (byte) a5_1045;
								}
							}
						}
						break;
					case 0x04:
						ra = tcp_receive(ra, s1_1096, s0_1041, 0x4200DFAA, 587752556, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgB8, dwArgC8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s4_1033 & 32) != 0x00)
						{
							((word32) s0_1041 + 26)->u0 = (word16) ((word32) *((word32) s0_1041 + 26) | 2);
							word32 a5_5802;
							word32 a2_5801;
							word32 a0_5799;
							word32 a1_5800;
							s1_591 = tcp_pcb_purge(ra, s0_1041, a3_1014, s4_1033, mstatus, dwArg88, dwArg98, dwArgC8, out a0_5799, out a1_5800, out a2_5801, out a3_590, out a4_585, out a5_5802);
							a5_593 = *((word32) s3_1098 - 340);
							if (s0_1041 == a5_593)
								goto l23043C86;
							while (a5_593 != 0x00)
							{
								a5_597 = *((word32) a4_585 + 0x0C);
								if (s0_1041 == a4_585)
									goto l23043C94;
								a5_593 = a4_585;
							}
							goto l23043C9E;
						}
						break;
					case 0x06:
