pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
						ra = tcp_receive(ra, s1_1096, s0_1041, 0x4200DFAA, 587752556, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgB8, dwArgC8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s7_1001.u0 & 0x10) != 0x00)
						{
							s0_1041 = *((word16) a4_1015.u0 + 80);
							Eq_2 a5_582 = *s5_1100;
							if (a4_1015 == a5_582)
							{
								s0_1041 = *((word32) a5_582 + 0x006C);
								if (a5_582 == 0x00)
								{
									word32 a5_5814;
									word32 a0_5811;
									word32 a2_5813;
									word32 a1_5812;
									s1_591 = tcp_pcb_purge(ra, s0_1041, a3_1014, s4_1033, mstatus, dwArg88, dwArg98, dwArgC8, out a0_5811, out a1_5812, out a2_5813, out a3_590, out a4_585, out a5_5814);
									a5_593 = *((word32) s3_1098 - 340);
									if (s0_1041 != a5_593)
									{
										while (a5_593 != 0x00)
										{
											a5_597 = *((word32) a4_585 + 0x0C);
											if (s0_1041 == a4_585)
											{
l23043C94:
												s0_1041 = *((word32) a4_585 + 0x0C);
												*((word32) a4_585 + 0x0C) = a5_597;
												break;
											}
											a5_593 = a4_585;
										}
									}
									else
									{
l23043C86:
										s0_1041 = *((word32) a5_593 + 0x0C);
										*((word32) s3_1098 + 0x0EAC) = a5_593;
									}
l23043C9E:
									*(byte *) 0x42020EB4 = 0x01;
									((word32) s0_1041 + 20)->u1 = 0x0A;
									Eq_2 a4_731 = g_t4201FEA0;
									*(union Eq_2 *) 0x42020EA0 = s0_1041;
									*((word32) a4_731 + 0x0C) = s0_1041;
									word32 a2_5803;
									s0_1041 = tcp_timer_needed(s1_591, a3_590, mstatus, dwLoc0C, out s1_1096, out a0_1085, out a2_5803, out a3_1014, out a4_1015, out s8_1102);
								}
							}
						}
						break;
					case 0x07:
						ra = tcp_receive(ra, s1_1096, s0_1041, 0x4200DFAA, 587752556, s5_1100, s7_1001, mstatus, dwLoc28, dwLoc18, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgB8, dwArgC8, dwArgD8, out s0_1041, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1097, out s3_1098, out s4_1033, out s5_1100, out s6_1000, out s7_1001, out s8_1102, out s9_1002, out mstatus);
						if (((word32) *s7_1001.u0 & 0x10) != 0x00)
						{
							s0_1041 = *((word32) a4_1015 + 80);
							Eq_2 a5_546 = *s5_1100;
							if (a4_1015 == a5_546)
							{
								s0_1041 = *((word32) a5_546 + 0x006C);
								if (a5_546 == 0x00)
									s4_1033->u1 = (byte) ((word32) *s4_1033 | 16);
							}
						}
						break;
					}
				}
			}
l23043952:
			if (((word32) *s4_1033 & 0x08) != 0x00)
			{
				Eq_2 a5_2029 = *((word32) s0_1041 + 144);
				if (a5_2029 != 0x00)
				{
					word32 t2_2060;
					a5_2029();
				}
				word32 s11_5775;
				word32 s10_5774;
				word32 s6_5771;
				word32 s8_5773;
				word32 s5_5770;
				word32 s3_5769;
				word32 s7_5772;
				word32 s1_5766;
				word32 a0_5767;
				word32 s2_5768;
				Eq_2 a3_2079;
				Eq_2 a4_2080;
				ra = tcp_pcb_remove(ra, s0_1041, a3_1014, a4_1015, a5_2029, s4_1033, s7_1001, mstatus, sp_1303->t0048, sp_1303->t0058, sp_1303->t0078, sp_1303->t0084, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00BC, sp_1303->t00C8, sp_1303->t00D8, sp_1303->t00F8, sp_1303->t00FC, sp_1303->t0108, out s1_5766, out a0_5767, out a3_2079, out a4_2080, out s2_5768, out s3_5769, out s4_1033, out s5_5770, out s6_5771, out s7_5772, out s8_5773, out s9_1002, out s10_5774, out s11_5775, out mstatus);
				word32 a5_5778;
				word32 a2_5777;
				word32 a1_5776;
				s1_1096 = tcp_free(s0_1041, a3_2079, a4_2080, mstatus, out a0_1085, out a1_5776, out a2_5777, out a3_1014, out a4_1015, out a5_5778);
				goto l23043630;
			}
			if ((word32) *s8_1102 != 0x00)
			{
				Eq_2 a5_1392 = *((word32) s0_1041 + 0x0080);
				if (a5_1392 != 0x00)
				{
					word32 s0_1406 = *((word16) a0_1085.u0 + 16);
					word32 t2_1643;
					a5_1392();
					if (a0_1085 == ~0x0C)
						goto l23043630;
				}
				*s8_1102 = 0x00;
				goto l23043D9C;
			}
l23043D9C:
			word32 a2_5779;
			word32 s2_1705;
			word32 s10_1703;
			word32 s3_1706;
			word32 s5_1708;
			word32 s6_1709;
			word32 s8_1711;
			word32 s11_1704;
			ra = tcp_input_delayed_close(ra, s0_1041, a3_1014, a4_1015, s4_1033, s7_1001, mstatus, sp_1303->t0038, sp_1303->t0048, sp_1303->t0068, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, out s1_1096, out a0_1085, out a2_5779, out a3_1014, out a4_1015, out s2_1705, out s3_1706, out s4_1033, out s5_1708, out s6_1709, out s7_1001, out s8_1711, out s9_1002, out s10_1703, out s11_1704, out mstatus);
			if (a0_1085 != 0x00)
				goto l23043630;
			Eq_2 a2_1720 = *s9_1002;
			if (a2_1720 != 0x00)
			{
				if (((word32) *((word32) s0_1041 + 26) & 0x10) != 0x00)
				{
					word32 a7_5785;
					word32 s5_5787;
					word32 s2_5786;
					word32 a1_5781;
					word32 a0_5780;
					word32 s6_5788;
					word32 s8_5789;
					word32 a2_5782;
					word32 a5_5784;
					word32 a4_5783;
					ra = pbuf_free(ra, a2_1720, a3_1014, a4_1015, s4_1033, mstatus, sp_1303->t0128, out s0_1966, out s1_1096, out a0_5780, out a1_5781, out a2_5782, out a3_1014, out a4_5783, out a5_5784, out a7_5785, out s2_5786, out s3_1098, out s4_1033, out s5_5787, out s6_5788, out s8_5789, out mstatus);
l23043B68:
					word32 s5_5794;
					word32 s11_5798;
					word32 s6_5795;
					word32 s10_5797;
					word32 s3_5793;
					word32 s7_5796;
					word32 s0_5790;
					word32 a5_5791;
					word32 s2_5792;
					ra = tcp_abort(ra, s1_1096, s0_1966, a3_1014, s3_1098, s4_1033, s7_1001, mstatus, sp_1303->t0000, sp_1303->t0004, sp_1303->t0028, sp_1303->t0038, sp_1303->t0048, sp_1303->t0058, sp_1303->t0074, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t009C, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00D8, sp_1303->t00DC, sp_1303->t00E8, sp_1303->t0108, out s0_5790, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out a5_5791, out s2_5792, out s3_5793, out s4_1033, out s5_5794, out s6_5795, out s7_5796, out s9_1002, out s10_5797, out s11_5798, out mstatus);
					goto l23043630;
				}
				Eq_2 a5_1723 = *((word32) s0_1041 + 0x0084);
				if (a5_1723 != 0x00)
				{
					word32 t2_1783;
					a5_1723();
				}
				else
					ra = tcp_recv_null(ra, s1_1096, s0_1041, a2_1720, 0x00, s4_1033, s7_1001, mstatus, sp_1303->t0000, sp_1303->t0010, sp_1303->t0038, sp_1303->t0048, sp_1303->t0058, sp_1303->t0068, sp_1303->t0078, sp_1303->t0084, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00BC, sp_1303->t00C8, sp_1303->t00D8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, sp_1303->t00FC, sp_1303->t0108, sp_1303->t0118, out s1_1096, out a0_1085, out a3_1014, out a4_1015, out s2_1705, out s3_1706, out s4_1033, out s5_1708, out s6_1709, out s7_1001, out s8_1711, out s9_1002, out s10_1703, out s11_1704, out mstatus);
				if (a0_1085 == ~0x0C)
					goto l23043630;
				if (a0_1085 != 0x00)
					*((char *) *s9_1002 + 0x0078) = (union Eq_2 *) s0_1041;
			}
			ui32 a5_1796 = (word32) *s4_1033;
			if ((a5_1796 & 32) != 0x00)
			{
				s0_1041 = (a5_1796 & 32)->t0078;
				if ((a5_1796 & 32) != 0x00)
				{
					ui32 a4_1884 = (word32) (a5_1796 & 32)->b000D;
					(a5_1796 & 32)->b000D = (byte) (a4_1884 | 32);
					a4_1015 = a4_1884 | 32;
				}
				else
				{
					word32 a5_1799 = (word32) *((word32) s0_1041 + 40);
					a4_1015.u0 = 0x00FFF810;
					if (a5_1799 != 0x00FFF810)
						((word32) s0_1041 + 40)->u0 = (word16) (a5_1799 + 0x01);
					Eq_2 a5_1806 = *((word32) s0_1041 + 0x0084);
					if (a5_1806 != 0x00)
					{
						word32 s0_1809 = *((word16) a0_1085.u0 + 16);
						word32 t2_1880;
						a5_1806();
						if (a0_1085 == ~0x0C)
						{
l23043630:
							((word32) s1_1096 + 0x0EB8)->u0 = 0x00;
							*s9_1002 = (union Eq_2 *) 0x00;
							if (a0_1085 != 0x00)
							{
								word32 mstatus_5711;
								word32 a4_5703;
								word32 s5_5708;
								word32 s6_5709;
								word32 s4_5707;
								word32 s8_5710;
								word32 s3_5706;
								word32 a1_5700;
								word32 a3_5702;
								word32 s2_5705;
								word32 a0_5699;
								word32 a7_5704;
								word32 a2_5701;
								word32 s0_5697;
								word32 s1_5698;
								struct Eq_218240 * a5_2190;
								pbuf_free(ra, a0_1085, a3_1014, a4_1015, s4_1033, mstatus, dwArgD8, out s0_5697, out s1_5698, out a0_5699, out a1_5700, out a2_5701, out a3_5702, out a4_5703, out a5_2190, out a7_5704, out s2_5705, out s3_5706, out s4_5707, out s5_5708, out s6_5709, out s8_5710, out mstatus_5711);
								a5_2190->dw0004 = 0x00;
							}
							0x00 = dwArg010C;
							return dwLoc4C;
						}
					}
				}
			}
			((word32) s1_1096 + 0x0EB8)->u0 = 0x00;
			word32 s11_5810;
			word32 s10_5809;
			word32 s8_5808;
			word32 s5_5806;
			word32 s2_5804;
			word32 s6_5807;
			word32 s3_5805;
			Eq_2 a2_1908;
			Eq_2 s7_1923;
			ra = tcp_input_delayed_close(ra, s0_1041, a3_1014, a4_1015, s4_1033, s7_1001, mstatus, sp_1303->t0038, sp_1303->t0048, sp_1303->t0068, sp_1303->t0078, sp_1303->t0088, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00AC, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00E8, sp_1303->t00EC, sp_1303->t00F8, out s1_1096, out a0_1085, out a2_1908, out a3_1014, out a4_1015, out s2_5804, out s3_5805, out s4_1033, out s5_5806, out s6_5807, out s7_1923, out s8_5808, out s9_1002, out s10_5809, out s11_5810, out mstatus);
			if (a0_1085 == 0x00)
			{
				word32 s7_5826;
				word32 s8_5827;
				word32 s5_5824;
				word32 s6_5825;
				word32 s10_5828;
				word32 s11_5829;
				word32 a5_5821;
				word32 s0_5819;
				word32 a2_5820;
				word32 s2_5822;
				word32 s3_5823;
				ra = tcp_output(ra, s1_1096, s0_1041, a2_1908, s7_1923, mstatus, sp_1303->t0058, sp_1303->t0068, sp_1303->t0088, sp_1303->t0094, sp_1303->t0098, sp_1303->t00A8, sp_1303->t00B8, sp_1303->t00C8, sp_1303->t00CC, sp_1303->t00D8, sp_1303->t00E8, sp_1303->t0108, sp_1303->t010C, sp_1303->t0118, out s0_5819, out s1_1096, out a0_1085, out a2_5820, out a3_1014, out a4_1015, out a5_5821, out s2_5822, out s3_5823, out s4_1033, out s5_5824, out s6_5825, out s7_5826, out s8_5827, out s9_1002, out s10_5828, out s11_5829, out mstatus);
			}
			goto l23043630;
		}
l23043672:
		a0_262 = s0_2313;
		s0_2313 = *((word32) s0_2313 + 0x0C);
	}
	Eq_2 a0_2225 = g_t4201FEA0;
	while (true)
	{
		Eq_2 a2_2296;
		Eq_2 a1_2290;
		Eq_2 a2_2264;
		if (a0_2225 == 0x00)
			break;
		ui32 a6_2228 = (word32) *((word32) a0_2225 + 8);
		if ((a6_2228 == 0x00 || a6_2228 == ((word32) t4_256->b0044 + 0x01 & 0x00FF)) && ((word32) (*((word32) a0_2225 + 24)) == ((word32) (*((word32) a3_1014 + 1)) << 8 | (word32) (*a3_1014)) && ((word32) (*((word32) a0_2225 + 22)) == ((word32) (*((word32) a3_1014 + 3)) << 8 | (word32) (*((word32) a3_1014 + 2))) && (t6_259 == *((word32) a0_2225 + 4) && t5_260 == *a0_2225))))
		{
			if ((a0_235 & 0x00FF & 4) != 0x00)
				goto l23043728;
			a2_2264 = (word32) g_w4200DFAA;
			if ((a0_235 & 0x00FF & 2) != 0x00)
			{
				Eq_2 a7_2272 = g_t4200DF94;
				a0_2225 = (a0_235 & 0x00FF)->t0024;
				a4_120 = a7_2272 - (a0_235 & 0x00FF);
				if (a4_120 >= 0x00)
				{
					a4_120 -= (word32) *((word32) a0_2225 + 40);
					if (a4_120 <= 0x00)
					{
						a1_2290 = g_t4200DF84;
						a2_2296 = a2_2264 + a7_2272;
						goto l23043702;
					}
				}
			}
			else
			{
				a4_120 = a0_235 & 0x00FF & 0x01;
				if (a4_120 != 0x00)
					*((word32) g_t4201FEA4 + 32) = a0_2225;
			}
			if (a2_2264 == 0x00)
				goto l23043728;
			((word32) a0_2225 + 26)->u0 = (word16) ((word32) *((word32) a0_2225 + 26) | 2);
			goto l23043724;
		}
		a0_2225 = *((word32) a0_2225 + 0x0C);
	}
	Eq_2 t0_2298 = g_t4201FEA8;
	s7_1001.u0 = 0x00;
	Eq_2 t6_2300 = 0x00;
	Eq_2 a5_2301 = t0_2298;
	while (a5_2301 != 0x00)
	{
		ui32 t2_2304 = (word32) *((word32) a5_2301 + 8);
		if (t2_2304 == 0x00 || t2_2304 == ((word32) t4_256->b0044 + 0x01 & 0x00FF))
		{
			s0_2313 = (word32) *((word32) a3_1014 + 2);
			if ((word32) *((word32) a5_2301 + 22) == ((word32) (*((word32) a3_1014 + 3)) << 8 | s0_2313))
			{
				Eq_217862 a6_2318 = *a5_2301;
				if (t5_260 == a6_2318)
				{
					s7_1001 = a5_2301;
					goto l230437AA;
				}
				if (a6_2318 == 0x00)
				{
					s7_1001 = a5_2301;
					t6_2300 = a0_2225;
				}
			}
		}
		a0_2225 = a5_2301;
		a5_2301 = *((word32) a5_2301 + 0x0C);
	}
	if (s7_1001 != 0x00)
	{
		a0_2225 = t6_2300;
l230437AA:
		if (a0_2225 != 0x00)
		{
			Eq_2 a5_2400 = *((word16) s7_1001.u0 + 0x0C);
			*(union Eq_2 *) 0x42020EA8 = s7_1001;
			*((word32) a5_2400 + 0x0C) = a0_2225;
			*((word16) s7_1001.u0 + 0x0C) = t0_2298;
		}
		else
			g_w4201FE42 = (word16) ((word32) g_w4201FE42 + 0x01);
		if ((a0_235 & 0x00FF & 4) != 0x00)
		{
l23043728:
			0x00 = dwArg010C;
			word32 s6_5660;
			word32 a7_5655;
			word32 mstatus_5662;
			word32 s8_5661;
			word32 s5_5659;
			word32 s4_5658;
			word32 s2_5656;
			word32 a5_5654;
			word32 s3_5657;
			word32 a3_5652;
			word32 a4_5653;
			word32 a2_5651;
			word32 a1_5650;
			word32 s0_5648;
			word32 a0_5649;
			Eq_2 s1_2873;
			pbuf_free(dwLoc08, dwLoc4C, s2, a4_120, dwArg0168, mstatus, dwArg0128, out s0_5648, out s1_2873, out a0_5649, out a1_5650, out a2_5651, out a3_5652, out a4_5653, out a5_5654, out a7_5655, out s2_5656, out s3_5657, out s4_5658, out s5_5659, out s6_5660, out s8_5661, out mstatus_5662);
			return s1_2873;
		}
		if ((a0_235 & 0x00FF & 16) == 0x00)
		{
			a4_120 = a0_235 & 0x00FF & 0x02;
			if (a4_120 != 0x00)
			{
				word32 a5_5713;
				word32 a3_5712;
				Eq_2 s1_2478;
				struct Eq_218266 * s4_2479;
				word32 s8_2480;
				Eq_2 a0_2485;
				struct Eq_218269 * s10_2488;
				struct Eq_218347 ** s11_2489;
				struct Eq_218271 * s3_2491;
				word32 s5_2492;
				word32 s6_2493;
				word32 s9_2495;
				struct Eq_218303 ** s2_2490;
				Eq_2 ra_2476 = tcp_alloc(ra, s1_123, (word32) *((word16) s7_1001.u0 + 21), a3_1014, a4_120, 0x42020000, s4_73, s7_1001, mstatus, dwLoc48, s6, dwLoc28, dwLoc18, dwArg04, dwArg08, dwArg28, dwArg2C, dwArg38, s5, s3, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, out s1_2478, out a0_2485, out a3_5712, out a4_120, out a5_5713, out s2_2490, out s3_2491, out s4_2479, out s5_2492, out s6_2493, out s7_1001, out s8_2480, out s9_2495, out s10_2488, out s11_2489, out mstatus);
				if (a0_2485 == 0x00)
				{
					s10_2488->w00A0 = (word16) ((word32) s10_2488->w00A0 + 0x01);
					<anonymous> * a5_2711 = *((word16) s7_1001.u0 + 24);
					if (a5_2711 != null)
					{
						word32 t2_2743;
						a5_2711();
					}
				}
				else
				{
					struct Eq_218303 * a4_2501 = *s2_2490;
					*s4_2479->ptr0014 = (union Eq_2 *) a0_2485;
					s4_2479->ptr0010->t0004 = a0_2485;
					*((word32) a0_2485 + 22) = (word16) (word32) *((word16) s7_1001.u0 + 22);
					Eq_2 a3_2508 = (word32) a4_2501->b0000;
					*((word32) a0_2485 + 24) = (word16) ((word32) a4_2501->b0001 << 8 | a3_2508);
					((word32) a0_2485 + 20)->u1 = 0x03;
					struct Eq_218347 * a5_2514 = *s11_2489;
					a5_2514->t0025 = a0_2485;
					a5_2514->t002D = a0_2485;
					struct Eq_210862 * a0_2518 = tcp_next_iss(a0_2485);
					struct Eq_218347 * a5_2521 = *s11_2489;
					a0_2518->t0058 = a0_2485;
					a0_2518->t0050 = a0_2485;
					a0_2518->t0044 = a0_2485;
					a0_2518->t005C = a0_2485;
					a5_2521->t0053 = a0_2485;
					struct Eq_218379 * a5_2528 = *((word16) s7_1001.u0 + 16);
					*((word32) a0_2485 + 0x007C) = s7_1001;
					a5_2528->t0010 = a0_2485;
					((word32) a0_2485 + 9)->u1 = (byte) ((word32) *((word16) s7_1001.u0 + 9) & 0x0C);
					((word32) a0_2485 + 8)->u1 = (byte) (word32) *((word16) s7_1001.u0 + 8);
					struct Eq_218407 * a5_2536 = s3_2491->ptrFFFFFEAC;
					s3_2491->t0EAC = a0_2485;
					a5_2536->t000C = a0_2485;
					word32 s8_5719;
					word32 a4_5718;
					word32 a2_5716;
					word32 a3_5717;
					word32 a0_5715;
					word32 s1_5714;
					tcp_timer_needed(s1_2478, a3_2508, mstatus, dwLoc0C, out s1_5714, out a0_5715, out a2_5716, out a3_5717, out a4_5718, out s8_5719);
					*(byte *) 0x42020EB4 = 0x01;
					Eq_2 s0_2553 = dwArg94;
					if ((word32) g_t42020000 != 0x00)
					{
						word32 s3_5730;
						word32 a0_5728;
						word32 s4_5731;
						word32 s8_5734;
						word32 a4_5729;
						word32 s6_5733;
						word32 s5_5732;
						word32 s1_5727;
						s0_2553 = tcp_parseopt.isra.0.part.1((word32) dwArg94 + 50, dwArgD8, out s1_5727, out a0_5728, out a4_5729, out s2_2490, out s3_5730, out s4_5731, out s5_5732, out s6_5733, out s7_1001, out s8_5734);
					}
					struct Eq_218303 * a4_2575 = *s2_2490;
					int32 * s2_2581 = (word32) *((word32) s0_2553 + 50);
					Eq_2 a5_2583 = (word32) a4_2575->b000F << 8 | (word32) a4_2575->b000E;
					*((word32) s0_2553 + 96) = (word16) a5_2583;
					*((word32) s0_2553 + 98) = (word16) a5_2583;
					word32 a4_5722;
					word32 a5_5723;
					word32 a2_5720;
					word32 a3_5721;
					Eq_2 a3_2598;
					((word32) s0_2553 + 50)->u0 = (word16) tcp_eff_send_mss_netif(s2_2581, ip4_route((word32) s0_2553 + 4, a5_2583, out a2_5720, out a3_5721, out a4_5722, out a5_5723), out a3_2598);
					word32 a5_5725;
					word32 s5_5726;
					word32 a4_5724;
					word32 a0_2605;
					Eq_2 a3_2608;
					Eq_2 s0_2615;
					Eq_2 s3_2618;
					Eq_2 s4_2619;
					ra = tcp_enqueue_flags(ra_2476, s0_2553, 0x12, a3_2598, mstatus, s0, dwArg38, s5, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_2615, out s1_123, out a0_2605, out a2_2264, out a3_2608, out a4_5724, out a5_5725, out s3_2618, out s4_2619, out s5_5726, out mstatus);
					if (a0_2605 != 0x00)
					{
						word32 s9_5747;
						word32 s7_5746;
						word32 s6_5745;
						word32 a1_5738;
						word32 s2_5741;
						word32 s5_5744;
						word32 s4_5743;
						word32 s3_5742;
						word32 s11_5749;
						word32 s10_5748;
						word32 a5_5740;
						word32 a0_5737;
						word32 s1_5736;
						word32 s0_5735;
						word32 a3_5739;
						tcp_abandon(ra, s1_123, s0_2615, a3_2608, s3_2618, s4_2619, s7_1001, mstatus, dwLoc50, 1107353512, dwLoc28, dwLoc18, dwLoc08, dwArg08, dwArg24, dwArg28, dwArg38, s5, s3, dwArg58, dwArg68, dwArg88, dwArg8C, dwArg98, dwArgB8, out s0_5735, out s1_5736, out a0_5737, out a1_5738, out a3_5739, out a4_120, out a5_5740, out s2_5741, out s3_5742, out s4_5743, out s5_5744, out s6_5745, out s7_5746, out s9_5747, out s10_5748, out s11_5749, out mstatus);
					}
					else
					{
						a0_2225 = s0_2615;
l23043724:
						word32 s8_5762;
						word32 s7_5761;
						word32 s10_5764;
						word32 s11_5765;
						word32 a2_5753;
						word32 a5_5755;
						word32 s9_5763;
						word32 a3_5754;
						word32 s4_5758;
						word32 s5_5759;
						word32 s6_5760;
						word32 s3_5757;
						word32 s2_5756;
						word32 s0_5750;
						word32 s1_5751;
						word32 a0_5752;
						tcp_output(ra, s1_123, a0_2225, a2_2264, s7_1001, mstatus, dwArg08, dwArg18, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, out s0_5750, out s1_5751, out a0_5752, out a2_5753, out a3_5754, out a4_120, out a5_5755, out s2_5756, out s3_5757, out s4_5758, out s5_5759, out s6_5760, out s7_5761, out s8_5762, out s9_5763, out s10_5764, out s11_5765, out mstatus);
					}
				}
			}
			goto l23043728;
		}
		a2_2296 = (word32) g_t4200DF94 + (word32) g_w4200DFAA;
		a1_2290 = g_t4200DF84;
	}
	else
	{
		word32 a5_5674;
		if ((lwip_htons((word32) *((word32) a3_1014 + 0x0C) | (word32) (*((word32) a3_1014 + 0x0D)) << 8, out a5_5674) & 0x04) != 0x00)
			goto l23043728;
		word32 a0_2356 = (word32) g_w4200DFAA;
		g_w4201FE3C = (word16) ((word32) g_w4201FE3C + 0x01);
		Eq_2 a2_2363 = g_t4200DF94;
		a1_2290 = g_t4200DF84;
		g_w4201FE32 = (word16) ((word32) g_w4201FE32 + 0x01);
		a2_2296 = (word32) a2_2363 + a0_2356;
	}
l23043702:
	word32 s8_5695;
	word32 a3_5687;
	word32 s5_5692;
	word32 s6_5693;
	word32 s9_5696;
	word32 s7_5694;
	word32 s4_5691;
	word32 s0_5684;
	word32 s2_5689;
	word32 a5_5688;
	word32 s3_5690;
	word32 a0_5686;
	word32 s1_5685;
	tcp_rst(ra, s0_2313, a1_2290, a2_2296, s7_1001, mstatus, dwLoc08, dwArg08, dwArg28, dwArg38, s7, s5, dwArg68, dwArg78, dwArgA8, dwArgD8, out s0_5684, out s1_5685, out a0_5686, out a3_5687, out a4_120, out a5_5688, out s2_5689, out s3_5690, out s4_5691, out s5_5692, out s6_5693, out s7_5694, out s8_5695, out s9_5696, out mstatus);
	goto l23043728;
}

