pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23043EBE: void tcp_trigger_input_pcb_close()
// Called from:
//      tcp_shutdown
void tcp_trigger_input_pcb_close()
{
	g_b4200DF90 = (byte) ((word32) g_b4200DF90 | 16);
}

// 23043ED4: Register Eq_2 tcp_seg_add_chksum(Register word32 a0, Register Eq_2 a1, Register (ptr32 word16) a2, Register (ptr32 byte) a3, Register out (ptr32 Eq_220718) a4Out, Register out (ptr32 Eq_220719) a5Out)
// Called from:
//      tcp_write
//      tcp_split_unsent_seg
Eq_2 tcp_seg_add_chksum(word32 a0, Eq_2 a1, word16 * a2, byte * a3, struct Eq_220718 & a4Out, struct Eq_220719 & a5Out)
{
	uint32 a0_9 = a0 + (word32) (*a2);
	struct Eq_220719 * a5_10 = a0_9 >> 0x10;
	uint32 a0_13 = (word32) (word16) (a0_9 + (a0_9 >> 0x10));
	if ((a1 & 0x01) != 0x00)
	{
		a4 = (word32) *a3;
		*a3 = (byte) (0x01 - a4);
		a5_10 = a0_13 << 0x08;
		a0_13 = (word32) (word16) (a0_13 >> 8 | a0_13 << 0x08);
	}
	*a2 = (word16) a0_13;
	a4Out = a4;
	a5Out = a5_10;
	return a1 & 0x01;
}

// 23043F06: Register Eq_2 tcp_create_segment(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_210939) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_220772) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_220779) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_210939) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_220784 s6Out, Register out Eq_220785 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_write
//      tcp_split_unsent_seg
//      tcp_send_fin
Eq_2 tcp_create_segment(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_210939 * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0128, struct Eq_220772 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_220779 & a5Out, union Eq_2 & s2Out, struct Eq_210939 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_220784 & s6Out, union Eq_220785 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s1_112;
	ptr32 a1_107;
	ptr32 a3_109;
	ptr32 a4_110;
	struct Eq_220779 * a5_111;
	ptr32 s0_103;
	Eq_2 s5_130 = a0;
	Eq_2 s2_125 = a1;
	struct Eq_210939 * s3_126 = a2;
	Eq_2 a0_31;
	Eq_2 a3_34;
	Eq_2 a4_35;
	word32 a2_216;
	word32 a5_217;
	Eq_2 s1_36 = memp_malloc(a4 << 0x02, 0x04, a3, a4, mstatus, out a0_31, out a2_216, out a3_34, out a4_35, out a5_217);
	if (a0_31 == 0x00)
	{
		word32 a0_220;
		word32 a2_221;
		word32 a7_222;
		word32 s4_223;
		word32 s8_224;
		ra = pbuf_free(ra, a1, a3_34, a4_35, a3, mstatus, dwArgF8, out s0_103, out s1_112, out a0_220, out a1_107, out a2_221, out a3_109, out a4_110, out a5_111, out a7_222, out s2_125, out s3_126, out s4_223, out s5_130, out s6, out s8_224, out mstatus);
	}
	else
	{
		*((word32) a0_31 + 0x0D) = (byte) a4_35;
		*a0_31 = 0x00;
		*((word32) a0_31 + 4) = a1;
		word32 a5_43 = (word32) *((word32) a1 + 8);
		*((word32) a0_31 + 0x0A) = 0x00;
		*((word32) a0_31 + 8) = (word16) (a5_43 - (s1_36 & 0x04));
		((word32) a0_31 + 0x0C)->u1 = 0x00;
		s1_112 = s1_36 & 0x04;
		Eq_2 a3_54;
		struct Eq_220847 * a5_56;
		word32 a2_218;
		word32 a4_219;
		if (pbuf_add_header(a1, 0x14, out a1_107, out a2_218, out a3_54, out a4_219, out a5_56) != 0x00)
		{
			word32 a4_101 = (word32) g_w4201FE40;
			g_w4201FE40 = (word16) (a4_101 + 0x01);
			s0_103 = 0x00;
			word32 a0_228;
			word32 a2_229;
			s1_112 = tcp_seg_free(ra, a0_31, a3_54, a4_101 + 0x01, a3, mstatus, dwArgD8, out a0_228, out a1_107, out a2_229, out a3_109, out a4_110, out a5_111);
		}
		else
		{
			Eq_2 s0_57 = a5_56->t0004;
			Eq_2 s2_58 = a5_56->t0004;
			*((word32) s0_57 + 16) = s2_58;
			word32 a5_225;
			Eq_2 a0_61 = lwip_htons((word32) *((word32) a0 + 22), out a5_225);
			s2_58->u1 = (byte) a0_61;
			((word32) s2_58 + 1)->u1 = (byte) (a0_61 >> 8);
			Eq_2 s2_67 = *((word32) s0_57 + 16);
			word32 a5_226;
			Eq_2 a0_68 = lwip_htons((word32) *((word32) a0 + 24), out a5_226);
			((word32) s2_67 + 2)->u1 = (byte) a0_68;
			*((word32) s2_67 + 3) = (byte) (a0_68 >> 8);
			Eq_2 s2_73 = *((word32) s0_57 + 16);
			word32 a5_227;
			Eq_2 a0_75 = lwip_htonl(a3, out a3_109, out a4_110, out a5_227);
			((word32) s2_73 + 4)->u1 = (byte) a0_75;
			((word32) s2_73 + 5)->u1 = (byte) (a0_75 >> 0x08);
			*((word32) s2_73 + 7) = (byte) (a0_75 >> 24);
			*((word32) s2_73 + 6) = (byte) (a0_75 >> 0x10);
			s2_125 = *((word32) s0_57 + 16);
			Eq_2 a0_91 = lwip_htons(((s1_36 & 0x04) >> 0x02) + 0x05 << 0x0C | a2, out a5_111);
			((word32) s2_125 + 0x0C)->u1 = (byte) a0_91;
			*((word32) s2_125 + 0x0D) = (byte) (a0_91 >> 8);
			s0_103 = a5_111->ptr0010;
			a5_111->b0012 = 0x00;
			a5_111->b0013 = 0x00;
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_112;
	a0Out = s0_103;
	a1Out = a1_107;
	a2Out = dwArg0100;
	a3Out = a3_109;
	a4Out = a4_110;
	a5Out = a5_111;
	s2Out = s2_125;
	s3Out = s3_126;
	s4Out = dwArg78;
	s5Out = s5_130;
	s6Out = s6;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 23044010: Register Eq_2 tcp_output_alloc_header_common.constprop.6(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_221049 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_output_alloc_header.constprop.5
//      tcp_rst
Eq_2 tcp_output_alloc_header_common.constprop.6(Eq_2 ra, Eq_2 s0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_221049 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a0_39;
	struct Eq_221061 * s0_44;
	Eq_2 s3_51;
	ui32 s4_52;
	ptr32 mstatus_55;
	Eq_2 s5_57;
	Eq_2 s6_58;
	word32 a1_188;
	word32 a2_189;
	word32 a7_190;
	word32 s2_191;
	word32 s8_192;
	Eq_221049 s1_167;
	ptr32 a5_107;
	ptr32 a4_162;
	Eq_2 a3_161;
	Eq_2 ra_56 = pbuf_alloc(ra, s0, a2, 0x00A2, (word32) (word16) (a1 + 0x14), 640, a3, a4, mstatus, dwLoc2C, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_44, out s1_167, out a0_39, out a1_188, out a2_189, out a3_161, out a4_162, out a5_107, out a7_190, out s2_191, out s3_51, out s4_52, out s5_57, out s6_58, out s8_192, out mstatus_55);
	if (a0_39 != 0x00)
	{
		word32 a5_193;
		Eq_2 a0_68 = lwip_htons(a3_161, out a5_193);
		s0_44->b0000 = (byte) a0_68;
		s0_44->b0001 = (byte) (a0_68 >> 8);
		word32 a5_194;
		Eq_2 a0_74 = lwip_htons(s6_58, out a5_194);
		s0_44->b0002 = (byte) a0_74;
		s0_44->b0004 = (byte) s1_167;
		s0_44->b0005 = (byte) (s1_167 >> 0x08);
		s0_44->b0003 = (byte) (a0_74 >> 8);
		s0_44->b0006 = (byte) (s1_167 >> 0x10);
		s0_44->b0007 = (byte) (s1_167 >> 24);
		word32 a5_195;
		Eq_2 a0_87 = lwip_htonl(s5_57, out a3_161, out a4_162, out a5_195);
		s0_44->b0008 = (byte) a0_87;
		s0_44->b0009 = (byte) (a0_87 >> 0x08);
		s0_44->b000B = (byte) (a0_87 >> 24);
		s0_44->b000A = (byte) (a0_87 >> 0x10);
		word32 a5_196;
		Eq_2 a0_100 = lwip_htons(s4_52 | 0x05000000, out a5_196);
		s0_44->b000C = (byte) a0_100;
		s0_44->b000D = (byte) (a0_100 >> 8);
		Eq_2 a0_106 = lwip_htons(s3_51, out a5_107);
		s0_44->b000E = (byte) a0_106;
		s0_44->b000F = (byte) (a0_106 >> 8);
		s0_44->b0010 = 0x00;
		s0_44->b0011 = 0x00;
		s0_44->b0012 = 0x00;
		s0_44->b0013 = 0x00;
		s1_167 >>= 24;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_167;
	a3Out = a3_161;
	a4Out = a4_162;
	a5Out = a5_107;
	s2Out = a0_39;
	s3Out = s3_51;
	s4Out = dwArg78;
	s5Out = s5_57;
	s6Out = s6_58;
	s8Out = s5;
	mstatusOut = mstatus_55;
	return ra_56;
}

