pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230440EC: Register Eq_2 tcp_output_alloc_header.constprop.5(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_221254) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_send_empty_ack
//      tcp_keepalive
//      tcp_zero_window_probe
Eq_2 tcp_output_alloc_header.constprop.5(Eq_2 ra, Eq_2 a0, ui32 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_221254 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_13 = *((word32) a0 + 36);
	ptr32 a3_20;
	ptr32 mstatus_25;
	struct Eq_221268 * s0_27;
	ptr32 s1_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s8_34;
	ptr32 a4_21;
	struct Eq_221254 * a5_22;
	Eq_2 ra_26 = tcp_output_alloc_header_common.constprop.6(ra, a0, a1, a2, (word32) *((word32) a0 + 22), (word32) *((word32) a0 + 24), mstatus, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_27, out s1_28, out a3_20, out a4_21, out a5_22, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s8_34, out mstatus_25);
	if (a0_13 != 0x00)
	{
		a4_21 = (word32) s0_27->w002A;
		a5_22 += a4_21 / 48;
		a5_22->dw002C = a5_22->dw0024;
	}
	s1Out = s1_28;
	a0Out = a0_13;
	a3Out = a3_20;
	a4Out = a4_21;
	a5Out = a5_22;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s8Out = s8_34;
	mstatusOut = mstatus_25;
	return ra_26;
}

// 2304411C: Register Eq_2 tcp_output_control_segment(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_rst
//      tcp_send_empty_ack
//      tcp_keepalive
//      tcp_zero_window_probe
Eq_2 tcp_output_control_segment(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a3_110;
	Eq_2 a4_111;
	Eq_2 a0_30;
	Eq_2 s0_116 = a1;
	Eq_2 s4_120 = a2;
	if (a0 != 0x00)
	{
		Eq_2 a0_24 = (word32) *((word32) a0 + 8);
		if (a0_24 != 0x00)
		{
			word32 a5_249;
			a0_30 = netif_get_by_index(a0_24, out a4_111, out a5_249);
			a3_110 = a3;
l2304413E:
			if (a0_30 != 0x00)
			{
				Eq_2 a4_106;
				Eq_2 a3_105;
				uint32 a0_54;
				Eq_2 a6_60;
				Eq_2 s1_62;
				Eq_2 s2_63;
				struct Eq_221413 * s3_64;
				Eq_2 s4_65;
				Eq_2 s5_66;
				word32 a2_256;
				word32 a4_258;
				word32 a3_257;
				Eq_2 s0_61 = ip_chksum_pseudo(a1, 0x06, (word32) *((word32) a1 + 8), a2, a3, out s1_62, out a0_54, out a2_256, out a3_257, out a4_258, out a6_60, out s2_63, out s3_64, out s4_65, out s5_66);
				s3_64->b0010 = (byte) a0_54;
				s3_64->b0011 = (byte) (a0_54 >> 8);
				if (s1_62 != 0x00)
				{
					a3_105 = (word32) *((word32) s1_62 + 11);
					a4_106 = (word32) *((word32) s1_62 + 0x0A);
				}
				else
				{
					a4_106.u0 = 0x00;
					a3_105.u0 = 0x00FF;
				}
				g_w4201FE2C = (word16) ((word32) g_w4201FE2C + 0x01);
				word32 s1_259;
				word32 a0_260;
				word32 a5_261;
				word32 a7_262;
				word32 s2_263;
				word32 s3_264;
				word32 s5_265;
				word32 s6_266;
				word32 s8_267;
				ra = ip4_output_if(ra, s0_61, s1_62, s0_61, s4_65, s2_63, a3_105, a4_106, 0x06, a6_60, s4_65, s5_66, s6, s7, out s0_116, out s1_259, out a0_260, out a3_110, out a4_111, out a5_261, out a7_262, out s2_263, out s3_264, out s4_120, out s5_265, out s6_266, out s7, out s8_267, out s9);
			}
			word32 s0_250;
			word32 a1_252;
			word32 a0_251;
			word32 a7_254;
			word32 a2_253;
			word32 s8_255;
			ptr32 a3_156;
			ptr32 a4_157;
			ptr32 a5_158;
			ptr32 s1_159;
			ptr32 s2_160;
			ptr32 s3_161;
			ptr32 s4_164;
			ptr32 s5_165;
			ptr32 s6_166;
			ptr32 mstatus_173;
			Eq_2 ra_174 = pbuf_free(ra, s0_116, a3_110, a4_111, s4_120, mstatus, dwArgF8, out s0_250, out s1_159, out a0_251, out a1_252, out a2_253, out a3_156, out a4_157, out a5_158, out a7_254, out s2_160, out s3_161, out s4_164, out s5_165, out s6_166, out s8_255, out mstatus_173);
			0x00 = (uint16) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_159;
			a0Out = s3_161;
			a3Out = a3_156;
			a4Out = a4_157;
			a5Out = a5_158;
			s2Out = s2_160;
			s3Out = s3_161;
			s4Out = s4_164;
			s5Out = s5_165;
			s6Out = s6_166;
			s7Out = s7;
			s8Out = dwArg58;
			s9Out = s9;
			mstatusOut = mstatus_173;
			return ra_174;
		}
	}
	word32 a5_248;
	word32 a2_247;
	a0_30 = ip4_route(a2, a5, out a2_247, out a3_110, out a4_111, out a5_248);
	goto l2304413E;
}

// 230441B6: Register Eq_2 tcp_write(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register ptr32 mstatus, Stack word32 dwArg04, Stack Eq_2 dwArg19, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_191650) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_191653) a3Out, Register out (ptr32 Eq_191654) a5Out, Register out (ptr32 Eq_191650) s2Out, Register out Eq_2 s3Out, Register out Eq_191657 s4Out, Register out ptr32 s5Out, Register out (ptr32 byte) s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_write
//      lwip_netconn_do_write
Eq_2 tcp_write(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, ui32 a3, ptr32 mstatus, word32 dwArg04, Eq_2 dwArg19, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, struct Eq_191650 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, struct Eq_191653 & a3Out, struct Eq_191654 & a5Out, struct Eq_191650 & s2Out, union Eq_2 & s3Out, union Eq_191657 & s4Out, ptr32 & s5Out, byte & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	struct Eq_191650 * s2_30 = (struct Eq_191650 *) ~0x0F;
	if (a0 != 0x00)
	{
		uint32 a5_32 = (word32) *((word32) a0 + 98);
		Eq_2 a4_33 = (word32) *((word32) a0 + 50);
		a5 = a5_32 >> 1;
		Eq_2 a7_35 = a5_32 >> 1;
		if (a4_33 < a5_32 >> 1)
			a7_35 = a4_33;
		uint32 s8_38 = a7_35 << 0x10;
		Eq_2 s8_162 = s8_38 >> 0x10;
		if (s8_38 >> 0x10 == 0x00)
			s8_162 = a4_33;
		s2_30 = (struct Eq_191650 *) ~0x0F;
		if (a1 == 0x00)
			goto l2304422A;
		a5 = (word32) *((word32) a0 + 20);
		uint32 a4_101 = 0x07;
		if (a5 != (struct Eq_191654 *) 0x07)
		{
			a5 = (char *) a5 - 2 & 0x00FF;
			a4_101 = 0x02;
			s2_30 = (struct Eq_191650 *) ~0x0A;
			if (a5 > (struct Eq_191654 *) 0x02)
				goto l2304422A;
		}
		if (a2 != 0x00)
		{
			if ((word32) *((word32) a0 + 100) < a2)
			{
l2304421C:
				ui32 a5_504 = (word32) *((word32) a0 + 26);
				*((word32) a0 + 26) = (word16) (a5_504 | 0x0080);
				a5 = a5_504 | 0x0080;
l23044228:
				s2_30 = (struct Eq_191650 *) ~0x00;
				goto l2304422A;
			}
			a4_101 = (word32) *((word32) a0 + 0x0066);
			a5 = (struct Eq_191654 *) 0x0F;
			if (a4_101 > 0x0F)
			{
				g_w4201FE38 = (word16) ((word32) g_w4201FE38 + 0x01);
				goto l2304421C;
			}
		}
		Eq_2 s1_114;
		Eq_2 s11_356;
		Eq_2 s2_106;
		Eq_2 a0_70 = *((word32) s1 + 0x006C);
		word32 s5_270 = (word32) *((word32) a0_70 + 0x0066);
		s1_114 = s1;
		if (s1 != 0x00)
		{
			do
			{
				s11_356 = s1_1179;
				s1_114 = *s1_1179;
				s1_1179 = s1_114;
			} while (s1_114 != 0x00);
			s7 = (word32) *((word32) a0_70 + 0x0068);
			ui32 t1_81 = (word32) *((word32) s1_1179 + 0x0D);
			a4_101 = (word32) *((word32) s1_1179 + 8);
			s2_106.u0 = 0x00;
			if (s7 != 0x00)
			{
				Eq_2 a4_91 = s8_162 - a4_101 - (t1_81 << 2 & 4);
				Eq_2 t1_92 = s7;
				if (a2 < s7)
					t1_92 = a2;
				Eq_2 s2_103 = a4_91;
				a4_101 = (word32) (word16) a4_91;
				if ((word32) (word16) t1_92 < a4_101)
					s2_103 = t1_92;
				uint32 s2_105 = s2_103 << 16;
				s2_106 = s2_105 >> 0x10;
				s7 = (word32) (word16) (s7 - (s2_105 >> 0x10));
				s1_114 = s1_1179;
			}
		}
		else
		{
			s11_356.u0 = 0x00;
			s7.u0 = 0x00;
			s2_106.u0 = 0x00;
			s1_114 = s1;
		}
		word16 wLoc5C_894 = (word16) a3;
		s3 = a2;
		Eq_2 s0_147 = a0_70;
		Eq_2 s10_149 = s2_106;
		Eq_2 s4_150 = 0x00;
		Eq_2 s9_151 = 0x00;
		word16 wLoc5A_577 = (word16) s8_162;
		while (s10_149 < s3)
		{
			Eq_2 a3_158 = s3 - s10_149;
			Eq_2 a4_159 = a3_158;
			Eq_2 a3_161 = (word32) (word16) a3_158;
			Eq_2 dwLoc5C_592 = SEQ(wLoc5A_577, wLoc5C_894);
			if (s8_162 < a3_161)
				a4_159 = (word32) wLoc5A_577;
			struct Eq_221711 * a0_185;
			word32 a4_188;
			word32 a5_189;
			word32 s5_203;
			uint32 s6_204;
			word32 s2_1156;
			word32 s1_1153;
			word32 a2_1154;
			word32 s8_1157;
			word32 a7_1155;
			Eq_2 a3_187;
			ra = pbuf_alloc(ra, s0_147, s1_114, 0x00B6, s8_162, 640, a3_161, a4_159, mstatus, dwLoc5C_592, dwLoc1C, s1, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_147, out s1_1153, out a0_185, out a1, out a2_1154, out a3_187, out a4_188, out a5_189, out a7_1155, out s2_1156, out s3, out s4_150, out s5_203, out s6_204, out s8_1157, out mstatus);
			s6 = s6_204 >> 0x10;
			if (a0_185 == null)
			{
l23044362:
				((word32) s0_147 + 26)->u0 = (word16) ((word32) *((word32) s0_147 + 26) | 0x0080);
				word32 a4_336 = (word32) g_w4201FE38;
				g_w4201FE38 = (word16) (a4_336 + 0x01);
				a5 = (struct Eq_191654 *) &g_t4201FD98;
				if (s4_150 != 0x00)
				{
					word32 a3_1177;
					word32 a0_1176;
					word32 a4_1178;
					tcp_segs_free(ra, s0_147, s4_150, a3_187, a4_336 + 0x01, s4_150, mstatus, dwArg98, out a0_1176, out a1, out a3_1177, out a4_1178, out a5);
				}
				goto l23044228;
			}
			0x00 = (uint16) dwArg84;
			word32 a6_213 = (word32) a0_185->w000A;
			a0_185->w0008 = (word16) a4_188;
			a0_185->w000A = (word16) a4_188;
			word32 a0_222;
			word32 a2_1161;
			word32 a4_1162;
			Eq_2 s1_230 = lwip_chksum_copy(a0_185->t0004, (word32) s10_149 + a5_189, s6_204 >> 0x10, out a0_222, out a2_1161, out a4_1162);
			Eq_2 a4_244;
			word32 a5_1163;
			tcp_seg_add_chksum(a0_222, s6_204 >> 0x10, fp + -66, fp + -67, out a4_244, out a5_1163);
			s7 = (word32) (word16) (a6_213 - (s6_204 >> 0x10));
			if ((word32) (word16) (s5_203 + pbuf_clen(s1_230)) > 0x10)
			{
				word32 s1_1167;
				word32 a7_1172;
				word32 a0_1168;
				word32 a2_1169;
				word32 a4_1170;
				word32 a5_1171;
				word32 s2_1173;
				word32 s8_1175;
				word32 s5_1174;
				ra = pbuf_free(ra, s1_230, fp + -67, a4_244, s4_150, mstatus, dwArgC8, out s0_147, out s1_1167, out a0_1168, out a1, out a2_1169, out a3_187, out a4_1170, out a5_1171, out a7_1172, out s2_1173, out s3, out s4_150, out s5_1174, out s6, out s8_1175, out mstatus);
				goto l23044362;
			}
			Eq_2 a0_259;
			word32 a4_1166;
			word32 s1_1164;
			word32 a2_1165;
			ra = tcp_create_segment(ra, dwArg19, s1_230, null, (word32) s10_149 + (fp + -67), 0x00, mstatus, dwArg78, dwArg98, dwArgC8, out s0_147, out s1_1164, out a0_259, out a1, out a2_1165, out a3_187, out a4_1166, out a5, out s2_106, out s3, out s4_150, out s5_270, out s6, out s8_162, out mstatus);
			s1_114 = a0_259;
			if (a0_259 == 0x00)
				goto l23044362;
			*((word32) a0_259 + 0x0A) = 0x00;
			((word32) a0_259 + 0x0C)->u1 = 0x00;
			ui32 a4_289 = (word32) *((word32) a0_259 + 0x0D);
			*((word32) a0_259 + 0x0D) = (byte) (a4_289 | 4);
			a4_101 = a4_289 | 4;
			if (s4_150 != 0x00)
				*s9_151 = a0_259;
			else
				s4_150 = a0_259;
			s10_149 = CONVERT(SLICE(s10_149 + s6, word16, 0), word16, word32);
			s9_151 = a0_259;
		}
		if (s2_106 != 0x00)
		{
			struct Eq_221679 * s10_359;
			s6 = (byte *) ((word16) s11_356.u0 + 0x0C);
			word16 * s9_361 = (word16) s11_356.u0 + 0x0A;
			for (s10_359 = *((word16) s11_356.u0 + 4); s10_359 != null; s10_359 = s10_359->ptr0000)
			{
				s10_359->w0008 = (word16) ((word16) s2_106.u0 + (word32) s10_359->w0008);
				if (s10_359->ptr0000 == null)
				{
					word32 a4_369 = (word32) s10_359->w000A;
					int32 a0_370 = s10_359->dw0004;
					0x00 = dwArg04;
					word32 a0_375;
					word32 a2_1158;
					word32 a4_1159;
					s1_114 = lwip_chksum_copy(a0_370 + a4_369, a1, s2_106, out a0_375, out a2_1158, out a4_1159);
					word32 a4_1160;
					a1 = tcp_seg_add_chksum(a0_375, s2_106, s9_361, s6, out a4_1160, out a5);
					*((word16) s11_356.u0 + 0x0D) = (byte) ((word32) *((word16) s11_356.u0 + 0x0D) | 4);
					s10_359->w000A = (word16) ((word16) s2_106.u0 + (word32) s10_359->w000A);
				}
			}
			a4_101 = (word32) *((word16) s11_356.u0 + 8);
			((word16) s11_356.u0 + 8)->u0 = (word16) ((word16) s2_106.u0 + a4_101);
		}
		*((word32) s0_147 + 0x0068) = (word16) s7;
		if (s11_356 == 0x00)
			*((word32) s0_147 + 0x006C) = s4_150;
		else
			*s11_356.u0 = s4_150;
		struct Eq_221838 * s0_444 = a5->ptr005C;
		word32 a2_445 = (word32) s0_444->w0064;
		s0_444->w0066 = (word16) s5_270;
		a5 += s3;
		a5->ptr005C = s0_444;
		s3 = a2_445 - s3;
		s0_444->w0064 = (word16) s3;
		s2_30 = null;
		if (s1_114 != 0x00 && a5 != null)
		{
			s7 = a4_101 & 2;
			if (s7 == 0x00)
			{
				uint32 a0_493 = (word32) (word16) (lwip_htons(0x08, out a5) | ((word32) a5->b000D << 8 | (word32) a5->b000C));
				a5->b000C = (byte) a0_493;
				a5->b000D = (byte) (a0_493 >> 8);
			}
		}
	}
l2304422A:
	a0Out = s2_30;
	a1Out = a1;
	a2Out = dwArg011C;
	a3Out = dwArg08;
	a5Out = a5;
	s2Out = s2_30;
	s3Out = s3;
	s4Out = dwArgDC;
	s5Out = s4;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgBC;
	mstatusOut = mstatus;
	return dwArg68;
}

// 230444AC: void tcp_split_unsent_seg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108)
// Called from:
//      tcp_tmr
void tcp_split_unsent_seg(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108)
{
	if (s0 == 0x00)
		return;
	if (a1 == 0x00)
		return;
	Eq_2 s6_29 = (word32) *((word32) s0 + 8);
	if (a1 >= s6_29)
		return;
	Eq_2 s7_36 = (word32) (word16) (s6_29 - a1);
	Eq_2 a0_47;
	word32 s1_53;
	word32 s3_59;
	word32 a4_636;
	word32 a1_634;
	word32 a2_635;
	word32 s0_633;
	word32 a5_637;
	word32 a7_638;
	word32 s2_639;
	word32 s5_640;
	word32 s6_641;
	word32 s8_642;
	ptr32 mstatus_197;
	Eq_2 a3_183;
	Eq_2 s4_205;
	Eq_2 ra_198 = pbuf_alloc(ra, s0, a1, 0x00B6, (word32) (word16) ((word32) s7_36 + (((word32) (*((word32) s0 + 0x0D)) & 0x00FB) << 0x02 & 4)), 640, a3, a4, mstatus, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_633, out s1_53, out a0_47, out a1_634, out a2_635, out a3_183, out a4_636, out a5_637, out a7_638, out s2_639, out s3_59, out s4_205, out s5_640, out s6_641, out s8_642, out mstatus_197);
	Eq_2 s5_191 = a0_47;
	if (a0_47 != 0x00)
	{
		Eq_2 a0_83;
		word32 s1_90;
		Eq_2 s2_91;
		Eq_2 a4_94;
		word32 s3_97;
		word32 a1_643;
		word32 a2_644;
		word32 a5_645;
		word32 s8_646;
		pbuf_copy_partial(a0_47, (word32) *((word32) a0_47 + 4) + s3_59, s7_36, (word32) (word16) ((uint16) (*((word32) a0_47 + 8) - *((word32) (*((word32) a0_47 + 4)) + 8)) + s1_53), out s1_90, out a0_83, out a1_643, out a2_644, out a3_183, out a4_94, out a5_645, out s2_91, out s3_97, out s4_205, out s8_646);
		if (a0_83 == s7_36)
		{
			ui32 s3_132;
			struct Eq_222154 * a5_121;
			struct Eq_222155 * a4_122;
			word32 a2_647;
			word32 a4_649;
			word32 a5_650;
			word32 a3_648;
			tcp_seg_add_chksum((word32) (word16) ~inet_chksum((word32) *((word32) a0_47 + 4) + s3_97, a0_83, a4_94, out a2_647, out a3_648, out a4_649, out a5_650), a0_83, fp + -50, fp + -0x0033, out a4_122, out a5_121);
			word32 a5_651;
			Eq_2 a0_128 = lwip_htons((word32) a5_121->b000C | (word32) a5_121->b000D << 8, out a5_651);
			struct Eq_210939 * a2_131 = a0_128 & 0x00FF & 8;
			if (a2_131 == null)
				s3_132 = a0_128 & 0x00FF & 63;
			else
			{
				s3_132 = a0_128 & 0x00FF & 55;
				a2_131 = (struct Eq_210939 *) 0x08;
			}
			if ((s3_132 & 1) != 0x00)
				a2_131 |= 1;
			Eq_2 a0_180;
			Eq_2 a4_184;
			word32 s1_187;
			struct Eq_222215 * s2_188;
			word32 s6_199;
			word32 a3_652;
			word32 a4_653;
			word32 s0_655;
			word32 a5_654;
			word32 a1_656;
			word32 a2_657;
			word32 a5_658;
			word32 s3_659;
			word32 s4_660;
			word32 s8_661;
			ra_198 = tcp_create_segment(ra_198, s2_91, a0_47, a2_131, (word32) lwip_htonl((word32) a4_122->b0007 << 24 | ((word32) a4_122->b0006 << 16 | ((word32) a4_122->b0005 << 8 | (word32) a4_122->b0004)), out a3_652, out a4_653, out a5_654) + s1_90, s4_205, mstatus_197, dwArg88, dwArgA8, dwArgD8, out s0_655, out s1_187, out a0_180, out a1_656, out a2_657, out a3_183, out a4_184, out a5_658, out s2_188, out s3_659, out s4_660, out s5_191, out s6_199, out s8_661, out mstatus_197);
			s4_205 = a0_180;
			if (a0_180 != 0x00)
			{
				*((word32) a0_180 + 0x0A) = 0x00;
				((word32) a0_180 + 0x0C)->u1 = 0x00;
				*((word32) a0_180 + 0x0D) = (byte) ((word32) *((word32) a0_180 + 0x0D) | 4);
				Eq_2 a0_258 = (word32) s2_188->w0066 - pbuf_clen(a0_180);
				s2_188->w0066 = (word16) a0_258;
				struct Eq_222309 * s0_260 = *((word32) a0_258 + 4);
				word32 a2_662;
				word32 a3_663;
				word32 a5_664;
				word32 s5_665;
				word32 mstatus_668;
				word32 s6_666;
				word32 s8_667;
				word32 s1_269;
				struct Eq_222321 * s2_277;
				Eq_2 s3_278;
				struct Eq_222323 * s4_279;
				Eq_2 a4_268;
				pbuf_realloc(ra_198, a0_258, (word32) (uint16) ((word32) *((word32) a0_258 + 8) + (word16) (s1_187 - s6_199)), a3_183, a4_184, a0_180, mstatus_197, dwArgC8, out s1_269, out a2_662, out a3_663, out a4_268, out a5_664, out s2_277, out s3_278, out s4_279, out s5_665, out s6_666, out s8_667, out mstatus_668);
				*((word32) *((word32) a4_268 + 16) + 8) = (word16) (s1_269 + (word32) s0_260->w0008);
				ui32 s1_296 = (word32) *((word32) a4_268 + 0x0D) << 8 | (word32) (*((word32) a4_268 + 0x0C));
				word32 a5_669;
				Eq_2 a0_298 = lwip_htons(s3_278, out a5_669);
				uint32 a5_303 = (word32) (word16) (s1_296 | a0_298);
				((word32) a4_268 + 0x0C)->u1 = (byte) a5_303;
				*((word32) a4_268 + 0x0D) = (byte) (a5_303 >> 8);
				struct Eq_222390 * s0_307 = *((word32) a0_298 + 4);
				s2_277->w0066 = (word16) (pbuf_clen(a0_298) + (word32) s2_277->w0066);
				struct Eq_222405 * s3_313 = s0_307->ptr0004;
				s0_307->w000A = 0x00;
				s0_307->b000C = 0x00;
				up32 s1_320 = (word32) (uint16) (s3_313->w0008 - s0_307->w0008);
				do
				{
					up32 a1_323 = (word32) s3_313->w000A;
					if (a1_323 >= s1_320)
					{
						do
						{
							word32 a2_670;
							word32 a4_672;
							word32 a3_671;
							word32 a5_673;
							word32 a5_674;
							tcp_seg_add_chksum((word32) (word16) ~inet_chksum(s3_313->dw0004 + s1_320, (word32) (word16) ((word32) s3_313->w000A - s1_320), a4_268, out a2_670, out a3_671, out a4_672, out a5_673), (word32) (word16) ((word32) s3_313->w000A - s1_320), &s0_307->w000A, &s0_307->b000C, out a4_268, out a5_674);
							s3_313 = s3_313->ptr0000;
							s1_320 = 0x00;
						} while (s3_313 != null);
						break;
					}
					s3_313 = s3_313->ptr0000;
					s1_320 = (word32) (word16) (s1_320 - a1_323);
				} while (s3_313 != null);
				word32 a0_370 = pbuf_clen(s4_279->t0004);
				struct Eq_222488 * a5_375 = (word32) s2_277->w0066;
				s2_277->w0066 = (word16) (a5_375 + a0_370 / 4);
				struct Eq_222498 * s0_378 = a5_375->ptr0000;
				s4_279->ptr0000 = a5_375;
				s0_378->ptr0000 = s4_279;
				if (s4_279->ptr0000 != null)
					return;
				s2_277->w0068 = 0x00;
				return;
			}
		}
	}
	word32 a4_209 = (word32) g_w4201FE38;
	g_w4201FE38 = (word16) (a4_209 + 0x01);
	if (s5_191 != 0x00)
	{
		word32 s0_675;
		word32 s1_676;
		word32 a0_677;
		word32 a1_678;
		word32 a2_679;
		word32 a3_680;
		word32 a4_681;
		word32 a5_682;
		word32 a7_683;
		word32 s2_684;
		word32 s3_685;
		word32 s4_686;
		word32 s5_687;
		word32 s6_688;
		word32 s8_689;
		word32 mstatus_690;
		pbuf_free(ra_198, s5_191, a3_183, a4_209 + 0x01, s4_205, mstatus_197, dwArgD8, out s0_675, out s1_676, out a0_677, out a1_678, out a2_679, out a3_680, out a4_681, out a5_682, out a7_683, out s2_684, out s3_685, out s4_686, out s5_687, out s6_688, out s8_689, out mstatus_690);
	}
}

