pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304472C: Register Eq_2 tcp_enqueue_flags(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_210938) s0Out, Register out (ptr32 Eq_210939) s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 (ptr32 Eq_222642)) a4Out, Register out (ptr32 Eq_210944) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_connect
//      tcp_input
//      tcp_send_fin
Eq_2 tcp_enqueue_flags(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, struct Eq_210938 & s0Out, struct Eq_210939 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, struct Eq_222642 & a4Out, struct Eq_210944 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a0_117;
	struct Eq_210944 * a5_114;
	struct Eq_222642 ** a4_127;
	Eq_2 a4_6 = a1 >> 0x01 & 0x01;
	Eq_2 a0_25;
	Eq_2 a4_28;
	word32 s4_304;
	word32 s6_305;
	word32 s8_306;
	word32 a2_300;
	word32 a5_301;
	word32 a7_302;
	word32 s2_303;
	word32 a1_299;
	Eq_2 a3_197;
	ptr32 mstatus_214;
	struct Eq_210938 * s0_101;
	struct Eq_210939 * s1_100;
	ptr32 s3_234;
	ptr32 s5_240;
	Eq_2 ra_220 = pbuf_alloc(ra, a0, a1, 0x00B6, a4_6 << 0x02, 640, a3, a4_6, mstatus, dwLoc1C, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_101, out s1_100, out a0_25, out a1_299, out a2_300, out a3_197, out a4_28, out a5_301, out a7_302, out s2_303, out s3_234, out s4_304, out s5_240, out s6_305, out s8_306, out mstatus_214);
	ptr32 a2_191 = dwArgA4;
	if (a0_25 != 0x00)
	{
		struct Eq_222636 * a0_55;
		word32 s2_63;
		word32 s4_308;
		word32 s6_309;
		word32 s8_310;
		word32 a1_307;
		struct Eq_222642 * a5_60;
		ra_220 = tcp_create_segment(ra_220, *((word32) a3_197 + 92), a0_25, s1_100, a3_197, a4_28, mstatus_214, dwArgB8, dwArgD8, dwArg0108, out s0_101, out s1_100, out a0_55, out a1_307, out a2_191, out a3_197, out a4_127, out a5_60, out s2_63, out s3_234, out s4_308, out s5_240, out s6_309, out s8_310, out mstatus_214);
		if (a0_55 != null)
		{
			s0_101 = a5_60->ptr006C;
			if (a5_60 == null)
				a0_55->ptr006C = s0_101;
			else
			{
				do
					a5_60 = (struct Eq_222642 *) *a4_127;
				while (a4_127 != null);
				a0_55->ptr0000 = a5_60;
			}
			s0_101->w0068 = 0x00;
			if (s2_63 != 0x00)
			{
				s0_101 = a5_60->ptr005C;
				a5_60->ptr005D = s0_101;
			}
			s1_100 &= 0x01;
			if ((s1_100 & 0x01) != 0x00)
				s0_101->w001A = (word16) ((word32) s0_101->w001A | 32);
			word32 a0_111 = pbuf_clen(a0_55->t0004);
			a5_114 = (word32) s0_101->w0066;
			s0_101->w0066 = (word16) (a5_114 + a0_111 / 8);
			a0_117 = 0x00;
l2304477A:
			s0Out = s0_101;
			s1Out = s1_100;
			a0Out = a0_117;
			a2Out = a2_191;
			a3Out = a3_197;
			a4Out = a4_127;
			a5Out = a5_114;
			s3Out = s3_234;
			s4Out = dwArg04;
			s5Out = s5_240;
			mstatusOut = mstatus_214;
			return ra_220;
		}
	}
	s0_101->w001A = (word16) ((word32) s0_101->w001A | 0x0080);
	word32 a4_126 = (word32) g_w4201FE38;
	g_w4201FE38 = (word16) (a4_126 + 0x01);
	a0_117 = ~0x00;
	a5_114 = (struct Eq_210944 *) &g_t4201FD98;
	a4_127 = a4_126 + 0x01;
	goto l2304477A;
}

// 230447D6: void tcp_send_fin(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register (ptr32 Eq_209869) a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138)
// Called from:
//      tcp_shutdown
void tcp_send_fin(Eq_2 ra, Eq_2 s1, Eq_2 a3, struct Eq_209869 * a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138)
{
	Eq_2 a0_12 = *((word32) s1 + 0x006C);
	if (s1 != 0x00)
	{
		do
			;
		while (a5 != null);
		struct Eq_222733 * a5_24;
		if ((lwip_htons((word32) a5->b000C | (word32) a5->b000D << 8, out a5_24) & 0x07) == 0x00)
		{
			struct Eq_222752 * a5_33;
			uint32 a0_37 = (word32) (word16) (lwip_htons(0x01, out a5_33) | ((word32) a5_24->b000D << 8 | (word32) a5_24->b000C));
			a5_33->b000C = (byte) a0_37;
			a5_33->b000D = (byte) (a0_37 >> 8);
			((word32) a0_12 + 26)->u0 = (word16) ((word32) *((word32) a0_12 + 26) | 32);
			0x00 = (uint16) dwArg38;
			return;
		}
	}
	0x00 = (uint16) dwArg38;
	word32 mstatus_202;
	word32 s5_201;
	word32 s4_200;
	word32 s3_199;
	word32 a5_198;
	word32 a4_197;
	word32 a3_196;
	word32 a2_195;
	word32 a0_194;
	word32 s1_193;
	word32 s0_192;
	tcp_enqueue_flags(ra, a0_12, 0x01, a3, mstatus, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_192, out s1_193, out a0_194, out a2_195, out a3_196, out a4_197, out a5_198, out s3_199, out s4_200, out s5_201, out mstatus_202);
}

// 23044854: Register Eq_2 tcp_rexmit_rto_prepare(Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 s1Out, Register out (ptr32 Eq_214436) a0Out, Register out Eq_214437 a2Out, Register out Eq_214438 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_214436) a5Out, Register out (ptr32 Eq_214441) s2Out, Register out (ptr32 Eq_214442) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      tcp_tmr
//      tcp_rexmit_rto
Eq_2 tcp_rexmit_rto_prepare(Eq_2 s1, Eq_2 a4, Eq_2 a5, union Eq_2 & s1Out, struct Eq_191560 & a0Out, union Eq_214437 & a2Out, union Eq_214438 & a3Out, union Eq_2 & a4Out, struct Eq_191560 & a5Out, struct Eq_214441 & s2Out, struct Eq_214442 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_191560 * a5_25;
	Eq_214438 a3_109 = 0x01;
	if (s1 != 0x00)
	{
		do
		{
			s1 = *a5;
			a4 = (word32) *((word32) a4 + 0x0E);
			if (a5 == 0x00)
			{
				a3_109.u0 = 0x01;
				a5_25 = (struct Eq_191560 *) ~0x05;
				if (a4 == 0x01)
				{
					*(union Eq_2 *) ~0x05 = s1;
					Eq_2 a0_30 = *(union Eq_2 *) 0x6A;
					((word32) a0_30 + 112)->u0 = 0x00;
					*(union Eq_2 *) 0x66 = a0_30;
					((word32) a0_30 + 26)->u0 = (word16) ((word32) *((word32) a0_30 + 26) | 0x00FFF800);
					struct Eq_222866 * a5_51;
					Eq_2 a0_48 = lwip_htonl((word32) *(byte *) 0x00FFF807 << 24 | ((word32) (*((byte *) 0x00FFF806)) << 16 | ((word32) (*((byte *) 0x00FFF805)) << 8 | (word32) (*((byte *) 0x00FFF804)))), out a3_109, out a4, out a5_51);
					s1 = a5_51->t0010;
					s3 = (word32) *((word32) s1 + 8);
					s2 = a0_48 + s3;
					word32 a5_134;
					(s2 + (word32) ((lwip_htons((word32) a5_51->b000C | (word32) a5_51->b000D << 8, out a5_134) & 0x03) != 0x00))[76] = (struct Eq_214441) a0_30;
					((word32) a0_30 + 52)->u0 = 0x00;
					s0 = a0_30;
					a5_25 = null;
				}
				goto l230448EC;
			}
			s1 = a5;
		} while (a4 == 0x01);
	}
	a5_25 = (struct Eq_191560 *) ~0x05;
l230448EC:
	s1Out = s1;
	a0Out = a5_25;
	a2Out = dwArg48;
	a3Out = a3_109;
	a4Out = a4;
	a5Out = a5_25;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0;
}

