pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230448FC: Register Eq_2 tcp_rexmit(Register Eq_2 s1, Register out Eq_2 s1Out, Register out (ptr32 Eq_220413) a0Out, Register out (ptr32 Eq_220414) a3Out, Register out (ptr32 Eq_220415) a4Out, Register out (ptr32 Eq_220413) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 uint16) s8Out)
// Called from:
//      tcp_input
//      tcp_rexmit_fast
Eq_2 tcp_rexmit(Eq_2 s1, union Eq_2 & s1Out, struct Eq_220413 & a0Out, struct Eq_220414 & a3Out, struct Eq_220415 & a4Out, struct Eq_220413 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, byte & s4Out, uint16 & s8Out)
{
	Eq_2 a0_14 = *((word32) s1 + 112);
	struct Eq_220413 * a5_15 = (struct Eq_220413 *) ~0x05;
	if (s1 != 0x00)
	{
		s1 = *(union Eq_2 *) ~0x01;
		a4 = (struct Eq_220415 *) 0x01;
		a3 = (word32) *(union Eq_2 *) 0x08;
		a5_15 = (struct Eq_220413 *) ~0x05;
		if (a3 == (struct Eq_220414 *) 0x01)
		{
			Eq_2 s1_20 = *(union Eq_2 *) ~0x05;
			*(union Eq_2 *) 0x6A = a0_14;
			s0 = a0_14;
			s2 = (word32) a0_14 + 0x006C;
			while (*s2 != 0x00)
			{
				struct Eq_222962 * a4_41;
				word32 a5_161;
				word32 a3_160;
				Eq_2 a0_39 = lwip_htonl((word32) a4->t0007 << 24 | ((word32) a4->t0006 << 16 | ((word32) a4->b0005 << 8 | (word32) a4->b0004)), out a3_160, out a4_41, out a5_161);
				s1_20 = a4_41->t0010;
				s3 = a0_39;
				word32 a5_162;
				if (a0_39 - lwip_htonl((word32) a4_41->b0007 << 24 | ((word32) a4_41->b0006 << 16 | ((word32) a4_41->b0005 << 8 | (word32) a4_41->b0004)), out a3, out a4, out a5_162) >= 0x00)
					break;
				s2 = *s2;
			}
			Eq_2 a5_63 = *s2;
			*a5_63 = s1_20;
			*s2 = s1_20;
			s1 = *a5_63;
			if (a5_63 == 0x00)
				((word32) a0_14 + 0x0068)->u0 = 0x00;
			int32 a5_74 = (word32) *((word32) a0_14 + 66);
			a4 = (struct Eq_220415 *) 0x00FF;
			if (a5_74 != 0x00FF)
				((word32) a0_14 + 66)->u1 = (byte) (a5_74 + 0x01);
			((word32) a0_14 + 52)->u0 = 0x00;
			a5_15 = null;
		}
	}
	s1Out = s1;
	a0Out = a5_15;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_15;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0;
}

// 230449BA: Register Eq_2 tcp_rexmit_fast(Register Eq_2 s1, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_217356 a2Out, Register out (ptr32 Eq_217357) a3Out, Register out (ptr32 Eq_217358) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 uint16) s4Out)
// Called from:
//      tcp_receive
Eq_2 tcp_rexmit_fast(Eq_2 s1, Eq_2 a5, union Eq_2 & a0Out, union Eq_217356 & a2Out, struct Eq_217357 & a3Out, struct Eq_217358 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, uint16 & s4Out)
{
	Eq_2 a0_15 = *((word32) a5 + 112);
	if (a5 == 0x00)
	{
		a0Out = a0_15;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s1;
	}
	else
	{
		ui32 a5_11 = (word32) *((word32) a0_15 + 26);
		Eq_2 a5_13 = a5_11 & 0x04;
		if ((a5_11 & 0x04) == 0x00)
		{
			word32 s8_128;
			Eq_2 s0_25 = tcp_rexmit(s1, out s1, out a0_15, out a3, out a4, out a5_13, out s2, out s3, out s4, out s8_128);
			if (a0_15 == 0x00)
			{
				up32 a4_28 = (word32) *((word32) s0_25 + 72);
				up32 a5_29 = (word32) *((word32) s0_25 + 96);
				if (a4_28 < a5_29)
					a5_29 = a4_28;
				ui32 a4_35 = (word32) *((word32) s0_25 + 50);
				Eq_223134 a5_37 = (word32) (word16) a5_29 >> 1;
				((word32) s0_25 + 74)->u0 = (word16) a5_37;
				a3 = a4_35 << 0x01;
				if (a5_37 < a4_35 << 0x01)
					((word32) s0_25 + 74)->u0 = (word16) (a4_35 << 0x01);
				word32 a5_46 = (word32) *((word32) s0_25 + 74);
				*((word32) s0_25 + 48) = 0x00;
				a4 = a4_35 + 0x03 + a5_46;
				ui32 a5_49 = (word32) *((word32) s0_25 + 26);
				((word32) s0_25 + 72)->u0 = (word16) a4;
				((word32) s0_25 + 26)->u0 = (word16) (a5_49 | 4);
				a5_13 = a5_49 | 4;
			}
		}
		a0Out = a0_15;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_13;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s1;
	}
}

// 23044A26: Register Eq_2 tcp_rst(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_211677) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_211680) a3Out, Register out (ptr32 Eq_211681) a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_211684) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out (ptr32 uint16) s8Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_abort
//      tcp_shutdown
//      tcp_tmr
//      tcp_input
Eq_2 tcp_rst(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0128, struct Eq_211677 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, struct Eq_211680 & a3Out, struct Eq_211489 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_211684 & s3Out, byte & s4Out, byte & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, uint16 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 a3_29;
	Eq_2 a4_30;
	struct Eq_211680 * a3_43;
	struct Eq_211489 * a4_44;
	Eq_2 a5_45;
	ptr32 mstatus_48;
	Eq_2 s0_50;
	Eq_2 s1_51;
	Eq_2 s2_52;
	struct Eq_211684 * s3_53;
	byte * s4_54;
	byte * s5_55;
	Eq_2 s6_56;
	uint16 * s8_57;
	word32 a5_173;
	Eq_2 ra_49 = tcp_output_alloc_header_common.constprop.6(ra, dwArg94, 0x00, lwip_htonl(a1, out a3_29, out a4_30, out a5_173), a3_29, a4_30, mstatus, s0, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_50, out s1_51, out a3_43, out a4_44, out a5_45, out s2_52, out s3_53, out s4_54, out s5_55, out s6_56, out s8_57, out mstatus_48);
	if (a2 == 0x00)
	{
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_51;
		a0Out = a2;
		a3Out = a3_43;
		a4Out = a4_44;
		a5Out = a5_45;
		s2Out = s2_52;
		s3Out = s3_53;
		s4Out = s4_54;
		s5Out = s5_55;
		s6Out = s6_56;
		s7Out = s7;
		s8Out = s8_57;
		s9Out = s9;
		mstatusOut = mstatus_48;
		return ra_49;
	}
	else
	{
		0x00 = (uint16) dwArg0128;
		Eq_2 a0_80;
		struct Eq_211680 * a3_83;
		struct Eq_211489 * a4_84;
		Eq_2 a5_85;
		ptr32 mstatus_88;
		struct Eq_211677 * s0_90;
		Eq_2 s1_91;
		Eq_2 s2_92;
		struct Eq_211684 * s3_93;
		byte * s4_94;
		byte * s5_95;
		Eq_2 s6_96;
		uint16 * s8_97;
		Eq_2 s7_105;
		union Eq_2 * s9_106;
		Eq_2 ra_89 = tcp_output_control_segment(ra_49, s0_50, a2, s1_51, s2_52, a5_45, s6_56, s7, mstatus_48, dwArgF8, dwArg0128, out s0_90, out s1_91, out a0_80, out a3_83, out a4_84, out a5_85, out s2_92, out s3_93, out s4_94, out s5_95, out s6_96, out s7_105, out s8_97, out s9_106, out mstatus_88);
		s0Out = s0_90;
		s1Out = s1_91;
		a0Out = a0_80;
		a3Out = a3_83;
		a4Out = a4_84;
		a5Out = a5_85;
		s2Out = s2_92;
		s3Out = s3_93;
		s4Out = s4_94;
		s5Out = s5_95;
		s6Out = s6_96;
		s7Out = s7_105;
		s8Out = s8_97;
		s9Out = s9_106;
		mstatusOut = mstatus_88;
		return ra_89;
	}
}

// 23044A80: Register Eq_2 tcp_send_empty_ack(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_217024) s1Out, Register out (ptr32 Eq_217025) a0Out, Register out Eq_217026 a2Out, Register out (ptr32 Eq_217027) a3Out, Register out (ptr32 Eq_217028) a4Out, Register out Eq_217029 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out (ptr32 uint16) s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_receive
//      tcp_input
//      tcp_output
Eq_2 tcp_send_empty_ack(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_217024 & s1Out, struct Eq_217025 & a0Out, union Eq_217026 & a2Out, struct Eq_217027 & a3Out, struct Eq_217028 & a4Out, union Eq_217029 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, uint16 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_217029 a5_116;
	struct Eq_217025 * a0_108;
	Eq_2 a0_19;
	Eq_2 a5_24;
	word32 a5_175;
	word32 a4_174;
	word32 a3_173;
	struct Eq_217027 * a3_112;
	struct Eq_217028 * a4_114;
	ptr32 mstatus_121;
	struct Eq_217024 * s1_125;
	ptr32 s2_127;
	union Eq_2 * s3_129;
	uint16 * s4_131;
	ptr32 s5_133;
	Eq_2 s6_135;
	ptr32 s8_139;
	Eq_2 ra_123 = tcp_output_alloc_header.constprop.5(ra, a0, 0x00, lwip_htonl(*((word32) a0 + 80), out a3_173, out a4_174, out a5_175), mstatus, s0, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s1_125, out a0_19, out a3_112, out a4_114, out a5_24, out s2_127, out s3_129, out s4_131, out s5_133, out s6_135, out s8_139, out mstatus_121);
	if (a0_19 == 0x00)
	{
		ui32 a5_81 = (word32) *((word32) a0 + 26);
		((word32) a0 + 26)->u0 = (word16) (a5_81 | 3);
		a0_108 = (struct Eq_217025 *) ~0x01;
		a5_116 = a5_81 | 3;
	}
	else
	{
		struct Eq_223300 * s0_58;
		word32 a5_176;
		ra_123 = tcp_output_control_segment(ra_123, a0, a0_19, a0, (word32) a0 + 4, a5_24, s6_135, s7, mstatus_121, dwArgE8, dwArg0118, out s0_58, out s1_125, out a0_108, out a3_112, out a4_114, out a5_176, out s2_127, out s3_129, out s4_131, out s5_133, out s6_135, out s7, out s8_139, out s9, out mstatus_121);
		ui32 a5_75 = (word32) s0_58->w001A;
		if (a0_108 != null)
			a5_116 = a5_75 | 3;
		else
			a5_116 = a5_75 & ~0x03;
		s0_58->w001A = (word16) a5_116;
	}
	s1Out = s1_125;
	a0Out = a0_108;
	a2Out = dwArg10;
	a3Out = a3_112;
	a4Out = a4_114;
	a5Out = a5_116;
	s2Out = s2_127;
	s3Out = s3_129;
	s4Out = s4_131;
	s5Out = s5_133;
	s6Out = s6_135;
	s7Out = s7;
	s8Out = s8_139;
	s9Out = s9;
	mstatusOut = mstatus_121;
	return ra_123;
}

