pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23044AD2: Register Eq_2 tcp_output(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_191560) a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_191566) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out ptr32 s10Out, Register out Eq_191574 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_tcp_output
//      tcp_recved
//      tcp_connect
//      tcp_pcb_remove
//      tcp_fasttmr
//      tcp_shutdown
//      tcp_tmr
//      tcp_input
//      tcp_rexmit_rto
//      lwip_netconn_do_write
Eq_2 tcp_output(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_191560 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_191566 & s3Out, byte & s4Out, byte & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out, union Eq_191574 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = g_t4201FEB8;
	if (a5_5 == a0)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = null;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a5_1514;
	struct Eq_191560 * a0_1478;
	Eq_2 s2_1570;
	Eq_2 a0_35 = *((word32) s1 + 0x006C);
	Eq_2 s0_36 = a0_35;
	if (s1 == 0x00)
	{
		s2_1570 = s2;
		if (((word32) *((word32) a0_35 + 26) & 0x02) != 0x00)
			goto l23044B0A;
	}
	else
	{
		Eq_2 a0_43;
		s6 = (word32) *((word32) a0_35 + 72);
		s2_1570 = (word32) *((word32) a0_35 + 96);
		s5 = (word32) a0_35 + 4;
		Eq_2 a0_40 = (word32) *((word32) a0_35 + 8);
		if (a0_40 != 0x00)
			a0_43 = netif_get_by_index(a0_40, out a4, out a5_1514);
		else
		{
			word32 a2_1745;
			word32 a3_1746;
			a0_43 = ip4_route(a2, a5_5, out a2_1745, out a3_1746, out a4, out a5_1514);
		}
		Eq_2 s4_226 = a0_43;
		if (a0_43 == 0x00)
		{
			a0_1478 = (struct Eq_191560 *) ~0x03;
l23044DE4:
			0x00 = (uint16) dwArg010C;
			s0Out = dwArgCC;
			s1Out = dwLoc4C;
			a0Out = a0_1478;
			a2Out = dwArg01A8;
			a3Out = s2;
			a4Out = a4;
			a5Out = a5_1514;
			s2Out = s2_1570;
			s3Out = s3;
			s4Out = dwArg0168;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwArg0148;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			mstatusOut = mstatus;
			return dwLoc08;
		}
		word32 s0_56 = *a5_1514;
		if (a5_1514 == 0x00)
			*a5_1514 = s0_56;
		Eq_2 s3_61 = s6;
		if (s2_1570 < s6)
			s3_61 = s2_1570;
		Eq_2 s1_70 = *((word32) a4 + 16);
		uint32 s3_72 = s3_61 << 16;
		word32 a5_1748;
		word32 a3_1747;
		Eq_2 a0_84 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1747, out a4, out a5_1748);
		s3 = s3_72 >> 0x10;
		s0_36 = *((word32) a4 + 0x0044);
		if (s3_72 >> 0x10 < (word32) a0_84 + ((word32) (*((word32) s1_70 + 8)) - a4))
		{
			struct Eq_223546 * a5_665 = (word32) *((word32) s0_36 + 96);
			if (a5_665 == s3_72 >> 0x10)
			{
				s0_36 = a5_665->t0070;
				if (a5_665 == null && (word32) (*((word32) s0_36 + 161)) == 0x00)
				{
					*((word32) s0_36 + 0x00A0) = 0x0100;
					((word32) s0_36 + 0x00A2)->u1 = 0x00;
				}
			}
			if (((word32) *((word32) s0_36 + 26) & 0x02) != 0x00)
			{
				a0_35 = s0_36;
l23044B0A:
				0x00 = (uint16) dwArg010C;
				struct Eq_191560 * a0_736;
				Eq_2 a2_738;
				Eq_2 a3_739;
				Eq_2 a4_740;
				Eq_2 a5_741;
				ptr32 mstatus_744;
				Eq_2 s1_746;
				Eq_2 s2_747;
				struct Eq_191566 * s3_748;
				byte * s4_749;
				byte * s5_750;
				Eq_2 s6_751;
				Eq_2 s7_752;
				ptr32 s8_753;
				Eq_2 s9_754;
				Eq_2 ra_745 = tcp_send_empty_ack(dwLoc08, dwArgCC, a0_35, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, out s1_746, out a0_736, out a2_738, out a3_739, out a4_740, out a5_741, out s2_747, out s3_748, out s4_749, out s5_750, out s6_751, out s7_752, out s8_753, out s9_754, out mstatus_744);
				s0Out = dwArgCC;
				s1Out = s1_746;
				a0Out = a0_736;
				a2Out = a2_738;
				a3Out = a3_739;
				a4Out = a4_740;
				a5Out = a5_741;
				s2Out = s2_747;
				s3Out = s3_748;
				s4Out = s4_749;
				s5Out = s5_750;
				s6Out = s6_751;
				s7Out = s7_752;
				s8Out = s8_753;
				s9Out = s9_754;
				s10Out = s10;
				s11Out = s11;
				mstatusOut = mstatus_744;
				return ra_745;
			}
		}
		else
		{
			s2_1570 = *((word32) s0_36 + 112);
			((word32) s0_36 + 161)->u1 = 0x00;
			if (s2_1570 != 0x00)
			{
				while (true)
				{
					Eq_2 a5_96 = *s2_1570;
					if (a5_96 == 0x00)
						break;
					s2_1570 = a5_96;
				}
			}
			s9.u0 = 0x0F;
			s7.u0 = 0x02;
			struct Eq_223588 * s8_101 = (struct Eq_223588 *) 0x01;
			s6.u0 = 1107426712;
			s10 = 0x42020000;
			s11.u0 = 0x02040000;
			do
			{
				Eq_2 s1_107 = *((word32) a4 + 16);
				union Eq_2 * a3_119;
				word32 a5_121;
				up32 a0_123 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_119, out a4, out a5_121) - a5_121;
				struct Eq_223631 * a5_124 = (word32) *((word32) s1_107 + 8);
				if (s3 < a5_124 + a0_123 / 112)
				{
l23044FE2:
					s0_36 = a5_124->t006C;
					if (a5_124 == null)
						break;
					goto l23044FEA;
				}
				struct Eq_223643 * a5_133;
				Eq_2 a0_132 = lwip_htons((word32) a5_124->b000C | (word32) a5_124->b000D << 8, out a5_133);
				Eq_2 s0_134 = a5_133->t0070;
				if (a5_133 != null)
				{
					ui32 a5_135 = (word32) *((word32) s0_134 + 26);
					a4 = a5_135 & 0x0044;
					if ((a5_135 & 0x0044) != 0x00)
						goto l23044BEE;
					s0_134 = (a5_135 & 0x0044)->t006C;
					if ((a5_135 & 0x0044) != 0x00)
					{
						a4 = *a3_119;
						if (a3_119 != null)
							goto l23044BEE;
						a4 = (word32) *((word32) s0_134 + 50);
						if ((word32) *((word32) a4 + 8) < a4)
							goto l23044FCA;
						goto l23044BEE;
					}
l23044FCA:
					a4 = (word32) *((word32) s0_134 + 100);
					if (a4 == 0x00)
						goto l23044BEE;
					a4 = (word32) *((word32) s0_134 + 0x0066);
					if (s9 < a4)
						goto l23044BEE;
					a5_124 = a5_135 & 0x00A0;
					if ((a5_135 & 0x00A0) == 0x00)
						goto l23044FE2;
				}
l23044BEE:
				Eq_2 a5_167;
				Eq_2 a5_151 = (word32) *((word32) s0_134 + 20);
				if (a5_151 != s7)
				{
					uint32 a0_172 = (word32) (word16) (lwip_htons(0x10, out a5_167) | a5_167);
					((word32) a4 + 0x0C)->u1 = (byte) a0_172;
					*((word32) a4 + 0x0D) = (byte) (a0_172 >> 8);
					s0_134 = dwArg94;
					a0_132 = a0_172 >> 8;
					a5_151 = a5_167;
				}
				struct Eq_223588 * a5_179 = (word32) *((word32) a5_151 + 0x0E);
				if (a5_179 == s8_101)
				{
					struct Eq_223756 * a5_194;
					word32 a4_1749;
					struct Eq_223758 * a3_192;
					Eq_2 a0_191 = lwip_htonl(a0_132, out a3_192, out a4_1749, out a5_194);
					a5_194->b0008 = (byte) a0_191;
					a5_194->b0009 = (byte) (a0_191 >> 0x08);
					a5_194->b000A = (byte) (a0_191 >> 0x10);
					a5_194->b000B = (byte) (a0_191 >> 24);
					struct Eq_223787 * s1_203 = a5_194->ptr0010;
					struct Eq_223791 * a5_207;
					Eq_2 a0_206 = lwip_htons((word32) *((word32) dwArg94 + 42), out a5_207);
					a5_207->b000E = (byte) a0_206;
					a5_207->b000F = (byte) (a0_206 >> 8);
					struct Eq_223810 * a4_212 = (word32) *((word32) dwArg94 + 42);
					Eq_2 s0_213 = a5_207->t0024;
					Mem215[a5_207 + a4_212 + 44:word32] = s0_213;
					if (((word32) s1_203->b000D & 0x01) != 0x00)
					{
						word32 a5_243;
						word32 a3_1750;
						*((word32) lwip_htonl(tcp_eff_send_mss_netif((int32 *) 688, s4_226, out a3_1750) | 0x02040000, out a3_192, out a4_212, out a5_243) + 20) = a5_243;
						s0_213 = dwArg94;
					}
					struct Eq_223831 * a5_248 = (int32) *((word32) s0_213 + 48);
					if (a5_248 < null)
						*((word32) s0_213 + 48) = 0x00;
					Eq_2 s0_252 = a5_248->t0034;
					if (a5_248 == null)
					{
						*((word32) g_t4201FEA4 + 52) = s0_252;
						word32 a4_1753;
						*((word32) lwip_htonl((word32) a4_212->b0007 << 24 | ((word32) a4_212->b0006 << 16 | ((word32) a4_212->b0005 << 8 | (word32) a4_212->b0004)), out a3_192, out a4_1753, out a5_248) + 56) = s0_252;
					}
					Eq_223986 a4_287 = a3_192->t0004;
					word32 a5_291 = (word32) (word16) (a5_248 - a3_192);
					struct Eq_223994 * a3_292 = (word32) *((word32) a4_287 + 0x0A) - a5_291;
					*((word32) a4_287 + 0x0A) = (word16) a3_292;
					struct Eq_224004 * a4_295 = (word32) a3_292->w0008;
					struct Eq_224009 * a5_296 = a4_295 - a5_291;
					a3_292->w0008 = (word16) a5_296;
					struct Eq_224015 * s1_299 = a4_295->ptr0004;
					a5_296->ptr0004 = a4_295;
					a5_296->b0010 = 0x00;
					a5_296->b0011 = 0x00;
					ui32 a5_303 = (word32) s1_299->b000D;
					struct Eq_224035 * a5_304 = a5_303 & 0x04;
					if ((a5_303 & 0x04) == 0x00)
					{
						s1_299 = (a5_303 & 0x04)->ptr0010;
						lwip_htons((word32) (a5_303 & 0x04)->b000C | (word32) (a5_303 & 0x04)->b000D << 8, out a5_304);
					}
					Eq_2 a6_314 = s1_299->t0004;
					word32 a0_342;
					struct Eq_224193 * s1_350;
					Eq_2 s4_353;
					Eq_2 s5_354;
					Eq_2 s6_355;
					word32 s3_1764;
					word32 a5_1763;
					struct Eq_224199 * a4_346;
					Eq_2 s0_349 = ip_chksum_pseudo_partial(a6_314, 0x06, dwLoc48, lwip_htons((word32) a5_304->b000C | (word32) a5_304->b000D << 8, out a5_1763) >> 0x0A & 252, a6_314, dwArgD8, out s1_350, out a0_342, out a4_346, out s3_1764, out s4_353, out s5_354, out s6_355);
					Eq_2 a7_360 = 0x00;
					if ((word32) s1_350->b000C != 0x00)
					{
						uint32 a5_361 = (word32) s1_350->w000A;
						s1_350->b000C = 0x00;
						s1_350->w000A = (word16) (a5_361 >> 8 | a5_361 << 0x08);
						a7_360.u0 = 0x01;
						a4_346 = a5_361 << 0x08;
					}
					Eq_2 a0_377 = (uint16) (s1_350->w000A + (word16) (~a0_342));
					uint32 a5_382 = (word32) (word16) ~((word32) a0_377 + (a0_377 >> 0x10));
					a4_346->b0010 = (byte) a5_382;
					a4_346->b0011 = (byte) (a5_382 >> 8);
					((word32) s6_355 + 0x0094)->u0 = (word16) ((word32) *((word32) s6_355 + 0x0094) + 0x01);
					dwLoc4C = a7_360;
					word32 a7_425;
					struct Eq_224300 * s1_428;
					word32 s0_1765;
					word32 a3_1766;
					ra = ip4_output_if(ra, s0_349, *((word32) a0_377 + 4), a0_377, s0_349, s5_354, (word32) *((word32) s0_349 + 11), (word32) *((word32) s0_349 + 0x0A), 0x06, s4_353, s4_353, s5_354, s6_355, s7, out s0_1765, out s1_428, out a0_1478, out a3_1766, out a4, out a5_179, out a7_425, out s2_1570, out s3, out s4_226, out s5, out s6, out s7, out s8_101, out s9);
					s0_134 = dwLoc28;
					if (a7_425 != 0x00)
					{
						uint32 a5_445 = (word32) s1_428->w000A;
						s1_428->b000C = (byte) s8_101;
						a5_179 = a5_445 >> 8 | a5_445 << 0x08;
						s1_428->w000A = (word16) a5_179;
						a4 = a5_445 << 0x08;
					}
					if (a0_1478 != null)
					{
						ui32 a5_657 = (word32) *((word32) dwLoc28 + 26);
						((word32) dwLoc28 + 26)->u0 = (word16) (a5_657 | 0x0080);
						a5_1514 = a5_657 | 0x0080;
						goto l23044DE4;
					}
				}
				a5_179->t006C = s0_134;
				if ((word32) *((word32) s0_134 + 20) != s7)
					((word32) s0_134 + 26)->u0 = (word16) ((word32) *((word32) s0_134 + 26) & ~0x03);
				Eq_2 s1_472 = *((word32) a4 + 16);
				struct Eq_223858 * a4_485;
				word32 a5_1752;
				word32 a3_1751;
				lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1751, out a4_485, out a5_1752);
				Eq_2 a3_487 = (word32) *((word32) s1_472 + 8);
				struct Eq_223896 * s1_488 = a4_485->ptr0010;
				struct Eq_223900 * a5_504 = (word32) a3_487 + a5_499;
				word32 a5_499;
				struct Eq_223903 * a0_505 = a5_504 + (word32) ((lwip_htons((word32) a4_485->b000C | (word32) a4_485->b000D << 8, out a5_499) & 0x03) != 0x00) / 84;
				word32 s0_506 = a5_504->dw0050;
				struct Eq_223928 * a5_507 = a5_504 - a0_505;
				if (a5_507 < null)
					a0_505->dw0050 = s0_506;
				a4 = (word32) s1_488->w0008;
				Eq_2 s1_513 = a5_507->t0010;
				dwLoc4C = a4;
				struct Eq_223960 * a5_521;
				if ((word32) a4 + (word32) ((lwip_htons((word32) a5_507->b000C | (word32) a5_507->b000D << 8, out a5_521) & 0x03) != 0x00) != 0x00)
				{
					s1_513->u0 = 0x00;
					Eq_2 s0_558 = a5_521->t0070;
					if (a5_521 == null)
					{
						*((word32) s1_513 + 112) = s0_558;
						goto l23044E9C;
					}
					s1_513 = *((word32) a4 + 16);
					word32 a5_1761;
					word32 a3_1759;
					word32 a4_1760;
					Eq_2 a0_570 = lwip_htonl((word32) *((word32) a4 + 7) << 24 | ((word32) (*((word32) a4 + 6)) << 16 | ((word32) (*((word32) a4 + 5)) << 8 | (word32) (*((word32) a4 + 4)))), out a3_1759, out a4_1760, out a5_1761);
					struct Eq_224140 * a4_582 = *((word32) s2_1570 + 16);
					dwLoc4C = a0_570;
					a3_604 = a3_595;
					struct Eq_224144 * a3_595;
					word32 a5_1762;
					if (a3_595 - lwip_htonl((word32) a4_582->b0007 << 24 | ((word32) a4_582->b0006 << 16 | ((word32) a4_582->b0005 << 8 | (word32) a4_582->b0004)), out a3_595, out a4, out a5_1762) >= 0x00)
					{
						*s2_1570 = s1_513;
l23044E9C:
						s2_1570 = s1_513;
					}
					else
					{
						do
						{
							struct Eq_224144 * a3_604;
							if (a4 == 0x00)
								break;
							struct Eq_224355 * a3_619;
							word32 a4_1767;
							word32 a5_1768;
							Eq_2 a0_618 = lwip_htonl((word32) a3_604->b0007 << 24 | ((word32) a3_604->b0006 << 16 | ((word32) a3_604->b0005 << 8 | (word32) a3_604->t0004)), out a3_619, out a4_1767, out a5_1768);
							s1_513 = a3_619->t0010;
							dwLoc4C = a0_618;
							word32 a5_1769;
						} while (dwArg94 - lwip_htonl((word32) a3_619->b0007 << 24 | ((word32) a3_619->b0006 << 16 | ((word32) a3_619->b0005 << 8 | (word32) a3_619->b0004)), out a3_604, out a4, out a5_1769) < 0x00);
						Eq_2 a5_644 = *a4;
						*a4 = s1_513;
						*s1_513 = a5_644;
					}
				}
				else
				{
					word32 a3_1757;
					word32 a1_1755;
					word32 a0_1754;
					word32 a2_1756;
					word32 a5_1758;
					s1_513 = tcp_seg_free(ra, s1_513, a3_487, a4, s4_226, mstatus, dwArgB8, out a0_1754, out a1_1755, out a2_1756, out a3_1757, out a4, out a5_1758);
				}
				s0_36 = *((word32) s1_513 + 0x006C);
			} while (s1_513 != 0x00);
			((word32) s0_36 + 0x0068)->u0 = 0x00;
		}
	}
l23044FEA:
	ui32 a5_680 = (word32) *((word32) s0_36 + 26);
	((word32) s0_36 + 26)->u0 = (word16) (a5_680 & -0x0081);
	a0_1478 = null;
	a5_1514 = a5_680 & -0x0081;
	goto l23044DE4;
}

// 2304500A: Register Eq_2 tcp_rexmit_rto_commit(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_214578) s0Out, Register out Eq_214579 s1Out, Register out (ptr32 Eq_214580) a0Out, Register out Eq_214581 a2Out, Register out Eq_214582 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_214584) s2Out, Register out (ptr32 Eq_214585) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 Eq_214588) s6Out, Register out (ptr32 Eq_214589) s7Out, Register out Eq_214590 s8Out, Register out ptr32 s9Out, Register out Eq_214592 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_tmr
//      tcp_rexmit_rto
Eq_2 tcp_rexmit_rto_commit(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, struct Eq_214578 & s0Out, union Eq_214579 & s1Out, struct Eq_191560 & a0Out, union Eq_214581 & a2Out, union Eq_214582 & a3Out, ptr32 & a4Out, struct Eq_214584 & s2Out, struct Eq_214585 & s3Out, ptr32 & s4Out, byte & s5Out, struct Eq_214588 & s6Out, struct Eq_214589 & s7Out, union Eq_214590 & s8Out, ptr32 & s9Out, union Eq_214592 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	int32 a5_5 = (word32) *((word32) a0 + 66);
	if (a5_5 != 0x00FF)
		((word32) a0 + 66)->u1 = (byte) (a5_5 + 0x01);
	struct Eq_191560 * a0_22;
	Eq_214581 a2_24;
	Eq_214582 a3_25;
	ptr32 a4_26;
	struct Eq_214578 * s0_29;
	Eq_214579 s1_30;
	struct Eq_214584 * s2_31;
	ptr32 s4_32;
	byte * s5_33;
	struct Eq_214588 * s6_34;
	Eq_214590 s8_35;
	Eq_214592 s10_39;
	ptr32 s11_40;
	struct Eq_214585 * s3_41;
	struct Eq_214589 * s7_42;
	ptr32 s9_43;
	ptr32 mstatus_50;
	word32 a5_96;
	Eq_2 ra_28 = tcp_output(ra, s1, a0, a2, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_29, out s1_30, out a0_22, out a2_24, out a3_25, out a4_26, out a5_96, out s2_31, out s3_41, out s4_32, out s5_33, out s6_34, out s7_42, out s8_35, out s9_43, out s10_39, out s11_40, out mstatus_50);
	s0Out = s0_29;
	s1Out = s1_30;
	a0Out = a0_22;
	a2Out = a2_24;
	a3Out = a3_25;
	a4Out = a4_26;
	s2Out = s2_31;
	s3Out = s3_41;
	s4Out = s4_32;
	s5Out = s5_33;
	s6Out = s6_34;
	s7Out = s7_42;
	s8Out = s8_35;
	s9Out = s9_43;
	s10Out = s10_39;
	s11Out = s11_40;
	mstatusOut = mstatus_50;
	return ra_28;
}

// 23045020: Register Eq_2 tcp_rexmit_rto(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_220357) s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_220359) a0Out, Register out (ptr32 Eq_220360) a3Out, Register out (ptr32 Eq_220361) a4Out, Register out (ptr32 int32) s2Out, Register out (ptr32 Eq_220363) s3Out, Register out (ptr32 byte) s4Out, Register out (ptr32 Eq_2) s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out (ptr32 uint16) s8Out, Register out (ptr32 Eq_2) s9Out, Register out (ptr32 Eq_220370) s10Out, Register out (ptr32 Eq_2) s11Out, Register out ptr32 mstatusOut)
// Called from:
//      tcp_input
Eq_2 tcp_rexmit_rto(Eq_2 ra, Eq_2 s1, Eq_2 a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118, struct Eq_220357 & s0Out, union Eq_2 & s1Out, struct Eq_220359 & a0Out, struct Eq_220360 & a3Out, struct Eq_220361 & a4Out, int32 & s2Out, struct Eq_220363 & s3Out, byte & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, uint16 & s8Out, union Eq_2 & s9Out, struct Eq_220370 & s10Out, union Eq_2 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_220359 * a0_13;
	struct Eq_220360 * a3_15;
	struct Eq_220361 * a4_16;
	Eq_2 s1_19;
	byte * s4_20;
	uint16 * s8_21;
	int32 * s2_24;
	struct Eq_220363 * s3_25;
	word32 a2_140;
	word32 a5_141;
	Eq_2 s0_23 = tcp_rexmit_rto_prepare(s1, a4, a5, out s1_19, out a0_13, out a2_140, out a3_15, out a4_16, out a5_141, out s2_24, out s3_25, out s4_20, out s8_21);
	if (a0_13 != null)
	{
		s0Out = s0;
		s1Out = s1_19;
		a0Out = a0_13;
		a3Out = a3_15;
		a4Out = a4_16;
		s2Out = s2_24;
		s3Out = s3_25;
		s4Out = s4_20;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8_21;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		struct Eq_220359 * a0_35;
		struct Eq_220360 * a3_38;
		struct Eq_220361 * a4_39;
		ptr32 mstatus_43;
		struct Eq_220357 * s0_45;
		Eq_2 s1_46;
		struct Eq_220370 * s10_47;
		union Eq_2 * s11_48;
		int32 * s2_49;
		struct Eq_220363 * s3_50;
		byte * s4_51;
		union Eq_2 * s5_52;
		ptr32 s6_53;
		Eq_2 s7_54;
		uint16 * s8_55;
		union Eq_2 * s9_56;
		word32 a2_142;
		Eq_2 ra_44 = tcp_rexmit_rto_commit(ra, s1_19, s0_23, dwArg10, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_45, out s1_46, out a0_35, out a2_142, out a3_38, out a4_39, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out s7_54, out s8_55, out s9_56, out s10_47, out s11_48, out mstatus_43);
		s0Out = s0_45;
		s1Out = s1_46;
		a0Out = a0_35;
		a3Out = a3_38;
		a4Out = a4_39;
		s2Out = s2_49;
		s3Out = s3_50;
		s4Out = s4_51;
		s5Out = s5_52;
		s6Out = s6_53;
		s7Out = s7_54;
		s8Out = s8_55;
		s9Out = s9_56;
		s10Out = s10_47;
		s11Out = s11_48;
		mstatusOut = mstatus_43;
		return ra_44;
	}
}

// 23045042: void tcp_keepalive(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      tcp_tmr
void tcp_keepalive(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a0_20;
	Eq_2 a5_25;
	ptr32 mstatus_28;
	Eq_2 s6_35;
	word32 a3_124;
	word32 a4_125;
	word32 a5_126;
	word32 s1_127;
	word32 a3_128;
	word32 a4_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s5_133;
	word32 s8_134;
	Eq_2 ra_29 = tcp_output_alloc_header.constprop.5(ra, a0, 0x00, lwip_htonl((word32) *((word32) a0 + 80) - 1, out a3_124, out a4_125, out a5_126), mstatus, s0, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s1_127, out a0_20, out a3_128, out a4_129, out a5_25, out s2_130, out s3_131, out s4_132, out s5_133, out s6_35, out s8_134, out mstatus_28);
	if (a0_20 == 0x00)
		return;
	word32 s0_135;
	word32 s1_136;
	word32 a0_137;
	word32 a3_138;
	word32 a4_139;
	word32 a5_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s7_146;
	word32 s8_147;
	word32 s9_148;
	word32 mstatus_149;
	tcp_output_control_segment(ra_29, a0, a0_20, dwArg10, (word32) a0 + 4, a5_25, s6_35, s7, mstatus_28, dwArgF8, dwArg0128, out s0_135, out s1_136, out a0_137, out a3_138, out a4_139, out a5_140, out s2_141, out s3_142, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147, out s9_148, out mstatus_149);
}

