pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304507C: void tcp_zero_window_probe(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      tcp_tmr
void tcp_zero_window_probe(Eq_2 ra, Eq_2 a0, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 s2_17 = *((word32) a0 + 0x006C);
	if (s2_17 == 0x00)
		return;
	int32 a5_19 = (word32) *((word32) a0 + 0x00A2);
	if (a5_19 != 0x00FF)
		((word32) a0 + 0x00A2)->u1 = (byte) (a5_19 + 0x01);
	struct Eq_224679 * a5_25 = *((word32) s2_17 + 16);
	word32 s0_28 = 0x00;
	word32 a5_353;
	if ((lwip_htons((word32) a5_25->b000C | (word32) a5_25->b000D << 8, out a5_353) & 0x01) != 0x00)
		s0_28 = (word32) ((word32) *((word32) s2_17 + 8) < 1);
	struct Eq_224679 * a4_40 = *((word32) s2_17 + 16);
	word32 a4_356;
	word32 s1_354;
	Eq_2 a0_62;
	ptr32 mstatus_70;
	Eq_2 s6_77;
	word32 a3_355;
	word32 a5_357;
	word32 s3_358;
	word32 s4_359;
	word32 s5_360;
	word32 s8_361;
	struct Eq_224725 * s2_114;
	Eq_2 ra_71 = tcp_output_alloc_header.constprop.5(ra, a0, s0_28 ^ 1, (word32) a4_40->b0007 << 24 | ((word32) a4_40->b0006 << 16 | ((word32) a4_40->b0005 << 8 | (word32) a4_40->b0004)), mstatus, s4, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s1_354, out a0_62, out a3_355, out a4_356, out a5_357, out s2_114, out s3_358, out s4_359, out s5_360, out s6_77, out s8_361, out mstatus_70);
	Eq_2 s3_120 = a0_62;
	if (a0_62 == 0x00)
		return;
	struct Eq_224778 * s4_97 = *((word32) a0_62 + 4);
	if (s0_28 != 0x00)
	{
		word32 a5_371;
		uint32 a5_140 = (word32) (word16) ((int32) (word16) (((word32) s4_97->b000D << 8 | (word32) s4_97->b000C) & 0xFC0000FF) | lwip_htons(0x11, out a5_371));
		s4_97->b000C = (byte) a5_140;
		s4_97->b000D = (byte) (a5_140 >> 8);
	}
	else
	{
		Eq_2 a0_98 = s2_114->t0004;
		word32 s1_362;
		word32 a0_363;
		word32 a1_364;
		word32 a2_365;
		word32 a3_366;
		word32 a4_367;
		word32 a5_368;
		word32 s4_369;
		word32 s8_370;
		pbuf_copy_partial(a0_98, &s4_97->b000D + 7, 0x01, (word32) (uint16) (*((word32) a0_98 + 8) - s2_114->w0008), out s1_362, out a0_363, out a1_364, out a2_365, out a3_366, out a4_367, out a5_368, out s2_114, out s3_120, out s4_369, out s8_370);
	}
	struct Eq_224861 * a4_146 = s2_114->ptr0010;
	struct Eq_224865 * a5_160;
	word32 a3_372;
	word32 a4_373;
	Eq_2 a0_157 = lwip_htonl((word32) a4_146->b0007 << 24 | ((word32) a4_146->b0006 << 16 | ((word32) a4_146->b0005 << 8 | (word32) a4_146->b0004)), out a3_372, out a4_373, out a5_160);
	Eq_2 s1_161 = a5_160->t0050;
	Eq_2 a5_163 = a5_160 - ((word32) a0_157 + 1);
	if (a5_163 < 0x00)
		*((word32) a0_157 + 81) = s1_161;
	word32 s0_374;
	word32 s1_375;
	word32 a0_376;
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 s2_380;
	word32 s3_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	word32 s9_387;
	word32 mstatus_388;
	tcp_output_control_segment(ra_71, s1_161, s3_120, dwArg48, (word32) s1_161 + 4, a5_163, s6_77, s7, mstatus_70, dwArgF8, dwArg0128, out s0_374, out s1_375, out a0_376, out a3_377, out a4_378, out a5_379, out s2_380, out s3_381, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out mstatus_388);
}

// 230451AC: Register (ptr32 Eq_224941) sys_timeout_abs(Register Eq_2 s1, Register (ptr32 Eq_224941) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_224949) a0Out, Register out Eq_2 a2Out, Register out (ptr32 Eq_224951) a3Out, Register out (ptr32 Eq_224949) a4Out, Register out (ptr32 Eq_224949) a5Out, Register out ptr32 s8Out)
// Called from:
//      lwip_cyclic_timer
//      sys_timeout
struct Eq_224941 * sys_timeout_abs(Eq_2 s1, struct Eq_224941 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, union Eq_2 & s1Out, struct Eq_224949 & a0Out, union Eq_2 & a2Out, struct Eq_224951 & a3Out, struct Eq_224949 & a4Out, struct Eq_224949 & a5Out, ptr32 & s8Out)
{
	struct Eq_224941 * s0_28 = a0;
	struct Eq_224949 * a0_19;
	struct Eq_224951 * a3_22;
	Eq_2 a2_21;
	struct Eq_224949 * a4_23;
	struct Eq_224949 * a5_20;
	Eq_2 s1_24 = memp_malloc(s1, 11, a3, a4, mstatus, out a0_19, out a2_21, out a3_22, out a4_23, out a5_20);
	if (a0_19 != null)
	{
		a4_23 = a5_20->ptr0000;
		a0_19->ptr0000 = null;
		a1->ptr0008 = a0_19;
		*((word32) dwArg44 + 0x0C) = a0_19;
		a1->ptr0004 = a0_19;
		a2_21 = dwArg44;
		s0_28 = a1;
		if (a5_20 == null)
		{
l230451DA:
			a0_19->ptr0000 = a4_23;
			goto l230451DC;
		}
		a5_20 = a3_22->ptr0004;
		a3_22 = a1 - a3_22;
		if (a3_22 < null)
		{
			a5_20->ptr0000 = a0_19;
			goto l230451DA;
		}
		do
		{
			a5_20 = a4_23->ptr0000;
			if (a4_23 == null)
				break;
			a4_23 = a3_22->ptr0004;
			a3_22 = a1 - a3_22;
		} while (a3_22 >= null);
		a4_23->ptr0000 = a0_19;
		a0_19->ptr0000 = a5_20;
	}
l230451DC:
	s1Out = s1_24;
	a0Out = a0_19;
	a2Out = a2_21;
	a3Out = a3_22;
	a4Out = a4_23;
	a5Out = a5_20;
	s8Out = a2;
	return s0_28;
}

// 23045208: void lwip_cyclic_timer(Register word32 ra, Register Eq_2 s1, Register (ptr32 Eq_225023) a5, Register ptr32 mstatus, Stack Eq_2 dwArg44)
void lwip_cyclic_timer(word32 ra, Eq_2 s1, struct Eq_225023 * a5, ptr32 mstatus, Eq_2 dwArg44)
{
	word32 a0_7 = a5->dw0004;
	Eq_2 a4_14;
	a5();
	word32 a5_64;
	Eq_2 a3_27 = (word32) a4_14 + g_dw4200DFAC - sys_now(out a5_64);
	word32 s1_65;
	word32 a0_66;
	word32 a2_67;
	word32 a3_68;
	word32 a4_69;
	word32 a5_70;
	word32 s8_71;
	sys_timeout_abs(s1, &g_t23045208, a3_27, a4_14, mstatus, dwArg44, out s1_65, out a0_66, out a2_67, out a3_68, out a4_69, out a5_70, out s8_71);
}

// 23045240: Register word32 sys_timeout(Register Eq_2 s1, Register (ptr32 Eq_224941) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s8Out)
// Called from:
//      lwip_init
//      tcp_timer_needed
//      tcpip_tcp_timer
//      ping_timeout
//      ping_api_init
//      sntp_recv
//      sntp_request
//      sntp_dns_found
//      sntp_init
word32 sys_timeout(Eq_2 s1, struct Eq_224941 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s8Out)
{
	word32 a5_49;
	sys_now(out a5_49);
	ptr32 a0_26;
	ptr32 a2_27;
	ptr32 a3_28;
	ptr32 a4_29;
	ptr32 a5_30;
	ptr32 s1_32;
	ptr32 s8_33;
	word32 s0_31 = sys_timeout_abs(s1, a1, a3, a4, mstatus, dwArg44, out s1_32, out a0_26, out a2_27, out a3_28, out a4_29, out a5_30, out s8_33);
	s1Out = s1_32;
	a0Out = a0_26;
	a2Out = a2_27;
	a3Out = a3_28;
	a4Out = a4_29;
	a5Out = a5_30;
	s8Out = s8_33;
	return s0_31;
}

// 23045260: Register word32 tcp_timer_needed(Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out Eq_2 s1Out, Register out (ptr32 Eq_210110) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 uint16) s8Out)
// Called from:
//      tcp_bind
//      tcp_listen_with_backlog_and_err
//      tcp_connect
//      tcp_input
word32 tcp_timer_needed(Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg44, union Eq_2 & s1Out, struct Eq_210110 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, uint16 & s8Out)
{
	Eq_2 a4_10 = g_t4200DFB4;
	if (a4_10 == 0x00)
	{
		if (g_t4201FEAC != 0x00)
		{
l23045282:
			((union Eq_2 *) 0x01)->u0 = 0x4200DFB4;
			struct Eq_210110 * a0_25;
			ptr32 a2_26;
			Eq_2 a3_27;
			Eq_2 a4_28;
			Eq_2 s1_31;
			uint16 * s8_32;
			word32 a5_74;
			word32 s0_30 = sys_timeout(s1, &g_t2304529A, a3, 0x01, mstatus, dwArg44, out s1_31, out a0_25, out a2_26, out a3_27, out a4_28, out a5_74, out s8_32);
			s1Out = s1_31;
			a0Out = a0_25;
			a2Out = a2_26;
			a3Out = a3_27;
			a4Out = a4_28;
			s8Out = s8_32;
			return s0_30;
		}
		a4_10 = g_t4201FEA0;
		if (a4_10 != 0x00)
			goto l23045282;
	}
	s1Out = s1;
	a0Out = a0;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4_10;
	s8Out = s8;
	return s0;
}

// 2304529A: void tcpip_tcp_timer(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack word32 dwArgFC)
void tcpip_tcp_timer(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 s3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, word32 dwArgFC)
{
	Eq_2 a3_14;
	Eq_2 a4_15;
	ptr32 mstatus_19;
	Eq_2 s1_22 = tcp_tmr(ra, s1, a2, s3, s7, mstatus, dwLoc08, dwArg00, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgFC, out a3_14, out a4_15, out mstatus_19);
	if (g_t4201FEAC != 0x00 || g_t4201FEA0 != 0x00)
	{
		word32 s8_154;
		word32 a4_152;
		word32 a5_153;
		word32 a2_150;
		word32 a3_151;
		word32 s1_148;
		word32 a0_149;
		sys_timeout(s1_22, &g_t2304529A, a3_14, a4_15, mstatus_19, dwArg44, out s1_148, out a0_149, out a2_150, out a3_151, out a4_152, out a5_153, out s8_154);
	}
	else
		g_dw4200EFB4 = 0x00;
}

// 230452DA: Register (ptr32 word32) sys_timeouts_init(Register (ptr32 word32) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      lwip_init
word32 * sys_timeouts_init(word32 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg38, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	do
	{
		a0_65 = a0;
		a4_66 = a4;
		a3_67 = a3;
		word32 s1_34;
		word32 a5_63;
		word32 a2_62;
		word32 s8_64;
	} while (s1_34 != sys_timeout(*a0_65 + 0x08, &g_t23045208, a3_67, a4_66, mstatus, dwArg34, out s1_34, out a0, out a2_62, out a3, out a4, out a5_63, out s8_64));
	0x00 = (uint16) dwArg38;
	a1Out = 587485704;
	a3Out = a3;
	a4Out = a4;
	return a0;
}

// 23045316: Register Eq_2 sys_untimeout(Register int32 a0, Register int32 a1, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      ping_timeout
//      sntp_recv
Eq_2 sys_untimeout(int32 a0, int32 a1, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_225238 * a5_19 = g_ptr4200DFB0;
	Eq_2 a2_17 = 0x00;
	if (a5_19 != null)
	{
		while (true)
		{
			Eq_2 a5_12 = g_t4200E000;
			if (a5_19->dw0008 == a0 && *((word32) a5_12 + 0x0C) == a1)
				break;
			a2_17 = a5_12;
			if (false)
				goto l23045326;
			a5_19 = (struct Eq_225238 *) &g_t4200E000;
		}
		if (a2_17 == 0x00)
			g_t4200E000.u0 = 0x4200DFB0;
		else
			g_t4200E000 = a2_17;
		ptr32 a3_37;
		ptr32 a4_38;
		word32 a2_81;
		word32 a5_82;
		word32 a0_80;
		Eq_2 s1_39 = memp_free(11, a5_12, 0x4200DFB0, 0x4200E000, mstatus, out a0_80, out a2_81, out a3_37, out a4_38, out a5_82);
		a3Out = a3_37;
		a4Out = a4_38;
		return s1_39;
	}
	else
	{
l23045326:
		a3Out = 0x4200DFB0;
		a4Out = 0x4200E000;
		return s1;
	}
}

// 23045350: Register Eq_2 sys_check_timeouts(Register word32 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_190355) a5Out, Register out Eq_190356 s2Out, Register out ptr32 s3Out)
// Called from:
//      tcpip_thread
Eq_2 sys_check_timeouts(word32 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, ptr32 mstatus, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_190355 & a5Out, union Eq_190356 & s2Out, ptr32 & s3Out)
{
	struct Eq_190355 * a5_17;
	Eq_190356 s2_18 = sys_now(out a5_17);
	ptr32 s3_19 = 0x4200E000;
	struct Eq_225290 * s4_20 = &g_t4200E000;
	s1_43 = s1;
	while (true)
	{
		ptr32 mstatus_74;
		Eq_2 a3_69;
		Eq_2 a1_67;
		Eq_2 s1_43;
		Eq_2 a4_23 = *a1;
		if (a1 == 0x00)
			break;
		a1 = a5_17->t0004;
		a3 = s2_18 - a5_17;
		if (a3 < 0x00)
			break;
		*a3 = a4_23;
		a1 = *((word32) s1_43 + 0x0C);
		s4_20->ptr0FAC = a5_17;
		word32 a2_123;
		word32 a4_124;
		word32 a0_122;
		s1_43 = memp_free(11, a1, a3, a4_23, mstatus, out a0_122, out a2_123, out a3, out a4_124, out a5_17);
		if (s0 != 0x00)
		{
			word32 tp_75;
			s0();
			a1 = a1_67;
			mstatus = mstatus_74;
			a3 = a3_69;
		}
	}
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_23;
	a5Out = a5_17;
	s2Out = s2_18;
	s3Out = s3_19;
	return s1;
}

