pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304561A: Register Eq_2 udp_bind(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      dns_server_init
//      dns_init
//      dhcp_inc_pcb_refcount
//      udp_sendto
//      udp_connect
//      lwip_netconn_do_bind
//      dhcp_server_start
//      iperf_server_udp
//      sntp_init
Eq_2 udp_bind(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a1 == 0x00)
		a1.u0 = 587783820;
	Eq_2 a0_109 = ~0x0F;
	if (a0 != 0x00)
	{
		a5 = g_t4201FEBC;
		a3 = 0x42020000;
		Eq_2 a0_14 = a5;
		while (true)
		{
			word32 t3_17;
			if (a0_14 == 0x00)
				break;
			if (a0_14 == a0)
			{
				t3_17 = 0x01;
				goto l23045638;
			}
			a0_14 = *((word32) a0_14 + 0x0C);
		}
		t3_17 = 0x00;
l23045638:
		if (a2 == null)
		{
			a2 = (word32) g_w4200D952;
			word32 a6_48 = 0x04000000;
l2304564C:
			if (a2 != (union Eq_2 *) 0x0FFFFFFF)
				a2 = (word32) (word16) ((char *) a2 + 1);
			else
				a2 = (union Eq_2 *) 0x0C000000;
			Eq_2 a7_59 = a5;
			while (a7_59 != 0x00)
			{
				if ((word32) *((word32) a7_59 + 18) == a2)
				{
					a6_48 = (word32) (word16) (a6_48 + ~0x00);
					if (a6_48 != 0x00)
						goto l2304564C;
					g_w4200D952 = (word16) a2;
					goto l230456A2;
				}
				a7_59 = *((word32) a7_59 + 0x0C);
			}
			g_w4200D952 = (word16) a2;
		}
		else
		{
			while (a5 != 0x00)
			{
				if (a5 != a0 && (((word32) (*((word32) a0 + 9)) & 0x04) == 0x00 || ((word32) (*((word32) a5 + 9)) & 0x04) == 0x00))
				{
					union Eq_2 * a0_34 = (word32) *((word32) a5 + 18);
					if (a0_34 == a2)
					{
						union Eq_2 * a6_39 = *a1.u0;
						a5 = *a0_34;
						if (a0_34 == a6_39 || (a6_39 == null || a0_34 == null))
						{
l230456A2:
							a3Out = 0x42020000;
							a4Out.u0 = <invalid>;
							a5Out = a5;
							return ~0x07;
						}
					}
				}
				a5 = *((word32) a5 + 0x0C);
			}
		}
		*((word32) a0 + 18) = (word16) a2;
		*a5 = a0;
		if (t3_17 == 0x00)
		{
			a5 = g_t4201FEBC;
			*(union Eq_2 *) 1107431100 = a0;
			*((word32) a5 + 0x0C) = a0;
		}
		a0_109.u0 = 0x00;
	}
	a3Out = a3;
	a4Out.u0 = <invalid>;
	a5Out = a5;
	return a0_109;
}

// 230456DE: Register Eq_2 udp_sendto_if_src_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_225870 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_225870 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_sendto_if_chksum
//      udp_sendto_if_src
Eq_2 udp_sendto_if_src_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_225870 a5, Eq_2 a6, Eq_2 a7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_225870 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s7Out, union Eq_2 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s5_176;
	Eq_2 s7_26 = ~0x0F;
	s5_176 = s5;
	if (a0 != 0x00)
	{
		s5_176 = s5;
		if (a1 == 0x00)
			goto l23045736;
		s5_176 = s5;
		if (a2 != 0x00)
		{
			s5_176 = s5;
			if (a7 == 0x00)
				goto l23045736;
			s5_176 = s5;
			if (a4 != 0x00)
			{
				Eq_225870 s8_154 = a5;
				s1 = a0;
				Eq_2 s4_159 = a7;
				Eq_2 s0_171 = a6;
				s5_176 = a4;
				s9 = a3;
				s3 = a2;
				s2 = a1;
				if ((word32) *((word32) a0 + 18) == 0x00)
				{
					Eq_2 a0_46 = udp_bind(a0, a0, null, out a3, out a4, out a5);
					s7_26 = a0_46;
					if (a0_46 != 0x00)
						goto l23045736;
				}
				a4 = (word32) *((word32) a1 + 8);
				a5.u0 = 0x0FFFFFF7;
				if (a4 > 0x0FFFFFF7)
				{
l23045726:
					s7_26.u0 = ~0x00;
					goto l23045736;
				}
				Eq_2 s6_102;
				Eq_2 a3_64;
				Eq_2 a4_65;
				word32 a1_590;
				word32 a2_591;
				word32 a5_592;
				if (pbuf_add_header(a1, 0x08, out a1_590, out a2_591, out a3_64, out a4_65, out a5_592) != 0x00)
				{
					word32 s6_596;
					Eq_2 a0_77;
					word32 a7_595;
					word32 a1_593;
					word32 a2_594;
					ra = pbuf_alloc(ra, a6, a0, 0x00A2, 0x08, 640, a3_64, a4_65, mstatus, s8, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_171, out s1, out a0_77, out a1_593, out a2_594, out a3, out a4, out a5, out a7_595, out s2, out s3, out s4_159, out s5_176, out s6_596, out s8_154, out mstatus);
					s6_102 = a0_77;
					if (a0_77 == 0x00)
						goto l23045726;
					if ((word32) *((word32) s2 + 8) != 0x00)
						pbuf_chain(a0_77, s2, a3, a4, mstatus);
				}
				else
					s6_102 = a1;
				Eq_2 s7_114 = *((word32) s6_102 + 4);
				word32 a5_597;
				Eq_2 a0_115 = lwip_htons((word32) *((word32) s1 + 18), out a5_597);
				s7_114->u1 = (byte) a0_115;
				((word32) s7_114 + 1)->u1 = (byte) (a0_115 >> 8);
				word32 a5_598;
				Eq_2 a0_123 = lwip_htons(a3, out a5_598);
				((word32) s7_114 + 2)->u1 = (byte) a0_123;
				*((word32) s7_114 + 3) = (byte) (a0_123 >> 8);
				((word32) s7_114 + 6)->u1 = 0x00;
				((word32) s7_114 + 7)->u1 = 0x00;
				if (((word32) *((word32) s1 + 16) & 0x08) != 0x00 && (*s3 & 0x00F0) == 224)
					*((word32) s6_102 + 0x0D) = (byte) ((word32) *((word32) s6_102 + 0x0D) | 4);
				word32 a5_599;
				Eq_2 a0_143 = lwip_htons((word32) *((word32) s6_102 + 8), out a5_599);
				((word32) s7_114 + 4)->u1 = (byte) a0_143;
				((word32) s7_114 + 5)->u1 = (byte) (a0_143 >> 8);
				if (((word32) *((word32) s1 + 16) & 0x01) == 0x00)
				{
					uint32 a0_164;
					Eq_2 a2_152 = (word32) *((word32) s6_102 + 8);
					if (s8_154 != 0x00)
					{
						word32 a0_191;
						word32 a4_600;
						Eq_2 s0_198 = ip_chksum_pseudo_partial(s6_102, 0x11, a2_152, 0x08, s4_159, dwArgF8, out s1, out a0_191, out a4_600, out s3, out s4_159, out s5_176, out s6_102);
						uint32 a0_209 = a0_191 + (s0_198 >> 16);
						s0_171 = s0_198 >> 16;
						a0_164 = (word32) (word16) (a0_209 + (a0_209 >> 0x10));
					}
					else
					{
						word32 a2_611;
						word32 a4_613;
						word32 a3_612;
						word32 s2_615;
						word32 a6_614;
						s0_171 = ip_chksum_pseudo(s6_102, 0x11, a2_152, s4_159, s3, out s1, out a0_164, out a2_611, out a3_612, out a4_613, out a6_614, out s2_615, out s3, out s4_159, out s5_176);
					}
					if (a0_164 == 0x00)
						a0_164 = 0x0FFFFFFF;
					*((word32) s7_114 + 6) = (byte) a0_164;
					*((word32) s7_114 + 7) = (byte) (a0_164 >> 8);
				}
				Eq_2 a3_233;
				if ((*s3 & 0x00F0) == 224)
					a3_233 = (word32) *((word32) s1 + 29);
				else
					a3_233 = (word32) *((word32) s1 + 11);
				Eq_2 a0_272;
				Eq_2 a4_276;
				Eq_2 s4_285;
				Eq_2 s6_287;
				ra = ip4_output_if_src(ra, s0_171, s1, s6_102, s4_159, s3, a3_233, (word32) *((word32) s1 + 0x0A), 0x11, s5_176, s4_159, s5_176, s6_102, s7_114, out s1, out a0_272, out a3, out a4_276, out s2, out s3, out s4_285, out s5_176, out s6_287);
				s7_26 = a0_272;
				if (s6_287 != s2)
				{
					word32 a2_604;
					word32 s8_610;
					word32 s6_609;
					word32 a7_607;
					word32 s4_608;
					word32 a5_606;
					word32 a4_605;
					word32 a0_602;
					word32 a1_603;
					word32 s0_601;
					ra = pbuf_free(ra, s6_287, a3, a4_276, s4_285, mstatus, dwArgF8, out s0_601, out s1, out a0_602, out a1_603, out a2_604, out a3, out a4_605, out a5_606, out a7_607, out s2, out s3, out s4_608, out s5_176, out s6_609, out s8_610, out mstatus);
				}
				word32 a4_338 = (word32) g_w4201FE14;
				g_w4201FE14 = (word16) (a4_338 + 0x01);
				a5.u0 = 1107426712;
				a4 = a4_338 + 0x01;
			}
		}
	}
l23045736:
	0x00 = (uint16) dwArg0128;
	s0Out = s4;
	s1Out = s1;
	a0Out = s7_26;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5_176;
	s7Out = s7_26;
	s8Out = s5;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

// 23045880: Register Eq_2 udp_sendto_if_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_225870 a5, Register Eq_2 a6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_225870 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_sendto_chksum
//      udp_sendto_if
Eq_2 udp_sendto_if_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_225870 a5, Eq_2 a6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_225870 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || (a2 == 0x00 || a4 == 0x00)))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a7_14;
		int32 a7_9 = *a0;
		if (a7_9 != 0x00 && (a7_9 & 0x00F0) != 224)
		{
			if (a7_9 != *((word32) a4 + 4))
			{
				s0Out = s0;
				s1Out = s1;
				a0Out = ~0x03;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s7Out = s7;
				s8Out = s8;
				s9Out = s9;
				mstatusOut = mstatus;
				return ra;
			}
			a7_14 = a0;
		}
		else
			a7_14 = (word32) a4 + 4;
		ptr32 a0_47;
		ptr32 s0_50;
		ptr32 s4_51;
		ptr32 s7_52;
		Eq_2 s8_53;
		Eq_2 a3_57;
		Eq_2 a4_58;
		Eq_225870 a5_59;
		ptr32 s1_60;
		ptr32 s2_61;
		ptr32 s3_62;
		ptr32 s5_63;
		ptr32 s9_64;
		ptr32 mstatus_73;
		Eq_2 ra_66 = udp_sendto_if_src_chksum(ra, a0, a1, a2, a3, a4, a5, a6, a7_14, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_50, out s1_60, out a0_47, out a3_57, out a4_58, out a5_59, out s2_61, out s3_62, out s4_51, out s5_63, out s7_52, out s8_53, out s9_64, out mstatus_73);
		s0Out = s0_50;
		s1Out = s1_60;
		a0Out = a0_47;
		a3Out = a3_57;
		a4Out = a4_58;
		a5Out = a5_59;
		s2Out = s2_61;
		s3Out = s3_62;
		s4Out = s4_51;
		s5Out = s5_63;
		s7Out = s7_52;
		s8Out = s8_53;
		s9Out = s9_64;
		mstatusOut = mstatus_73;
		return ra_66;
	}
}

