pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230458B8: Register Eq_2 udp_sendto_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_55976 a2, Register Eq_2 a3, Register Eq_225870 a4, Register (ptr32 Eq_226340) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_55976 s0Out, Register out Eq_55976 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_225870 a4Out, Register out (ptr32 Eq_226340) a5Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_226340) s5Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      udp_send_chksum
//      udp_sendto
//      lwip_netconn_do_send
Eq_2 udp_sendto_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_55976 a2, Eq_2 a3, Eq_225870 a4, struct Eq_226340 * a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_55976 & s0Out, union Eq_55976 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_225870 & a4Out, struct Eq_226340 & a5Out, union Eq_2 & s3Out, union Eq_2 & s4Out, struct Eq_226340 & s5Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || a2 == 0x00))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x0F;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a3_242;
	Eq_2 a0_40;
	Eq_2 s0_22 = a0;
	Eq_2 a0_23 = (word32) *((word32) a0 + 8);
	if (a0_23 != 0x00)
	{
		word32 a4_347;
		word32 a5_348;
		a0_40 = netif_get_by_index(a0_23, out a4_347, out a5_348);
		a3_242 = a3;
		goto l230458E4;
	}
	Eq_2 a2_32 = a5->t0000;
	Eq_2 a5_34 = a5 & 0x00F0;
	if ((a5 & 0x00F0) == 224)
	{
		Eq_2 a0_35 = (word32) *((word32) a0 + 28);
		if (a0_35 != 0x00)
		{
			word32 a4_352;
			a0_40 = netif_get_by_index(a0_35, out a4_352, out a5_34);
		}
		else
		{
			s0_22 = (a5 & 0x00F0)->t0018;
			if ((a5 & 0x00F0) == 0x00 || (a5 & 0x00F0) == g_dw2308DE90)
				goto l2304591A;
			word32 a4_354;
			word32 a3_353;
			a0_40 = ip4_route(a2_32, a5 & 0x00F0, out a2_32, out a3_353, out a4_354, out a5_34);
		}
		if (a0_40 != 0x00)
		{
l2304592E:
			ptr32 a0_112;
			Eq_2 a3_115;
			Eq_225870 a4_116;
			struct Eq_226340 * a5_117;
			ptr32 mstatus_120;
			Eq_55976 s0_122;
			Eq_55976 s1_123;
			Eq_2 s3_125;
			Eq_2 s4_126;
			struct Eq_226340 * s5_127;
			ptr32 s9_131;
			word32 s2_355;
			word32 s7_356;
			word32 s8_357;
			Eq_2 ra_121 = udp_sendto_if_chksum(ra, s0_22, a1, dwArg48, a3, a0_40, a4, dwArg28, s4, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_122, out s1_123, out a0_112, out a3_115, out a4_116, out a5_117, out s2_355, out s3_125, out s4_126, out s5_127, out s7_356, out s8_357, out s9_131, out mstatus_120);
			s0Out = s0_122;
			s1Out = s1_123;
			a0Out = a0_112;
			a3Out = a3_115;
			a4Out = a4_116;
			a5Out = a5_117;
			s3Out = s3_125;
			s4Out = s4_126;
			s5Out = s5_127;
			s9Out = s9_131;
			mstatusOut = mstatus_120;
			return ra_121;
		}
		goto l2304591A;
	}
	else
	{
l2304591A:
		word32 a5_351;
		word32 a4_350;
		word32 a2_349;
		a0_40 = ip4_route(a2_32, a5_34, out a2_349, out a3_242, out a4_350, out a5_351);
l230458E4:
		if (a0_40 == 0x00)
		{
			word32 a4_141 = (word32) g_w4201FE22;
			g_w4201FE22 = (word16) (a4_141 + 0x01);
			s0Out = s1;
			s1Out = a2;
			a0Out = ~0x03;
			a3Out = a3_242;
			a4Out = a4_141 + 0x01;
			a5Out = (struct Eq_226340 *) &g_t4201FD98;
			s3Out = a3;
			s4Out = dwArg04;
			s5Out = a5;
			s9Out = s9;
			mstatusOut = mstatus;
			return ra;
		}
		goto l2304592E;
	}
}

// 2304596E: Register word32 udp_send_chksum(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_225870 a2, Register (ptr32 Eq_226340) a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out Eq_225870 a4Out, Register out (ptr32 Eq_226340) a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_send
word32 udp_send_chksum(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_225870 a2, struct Eq_226340 * a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a0Out, union Eq_225870 & a4Out, struct Eq_226340 & a5Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		a0Out = ~0x0F;
		a4Out = a2;
		a5Out = a3;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		Eq_2 a3_11 = (word32) *((word32) a0 + 20);
		ptr32 a0_16;
		Eq_225870 a4_20;
		struct Eq_226340 * a5_21;
		ptr32 mstatus_24;
		word32 s0_26;
		word32 s9_136;
		word32 s4_134;
		word32 s5_135;
		word32 s3_133;
		word32 a3_132;
		word32 s1_131;
		udp_sendto_chksum(ra, a0, a1, (word32) a0 + 4, a3_11, a2, a3, s4, mstatus, dwArg14, dwArg28, dwArg48, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_26, out s1_131, out a0_16, out a3_132, out a4_20, out a5_21, out s3_133, out s4_134, out s5_135, out s9_136, out mstatus_24);
		a0Out = a0_16;
		a4Out = a4_20;
		a5Out = a5_21;
		mstatusOut = mstatus_24;
		return s0_26;
	}
}

// 23045986: Register Eq_2 udp_sendto(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_55976 a2, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_142875 a3Out, Register out ptr32 a4Out, Register out Eq_142877 s3Out, Register out (ptr32 Eq_142878) s4Out, Register out ptr32 s5Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      get_dns_request
//      dns_check_entry
//      iperf_server_udp_recv_fn
//      sntp_dns_found
Eq_2 udp_sendto(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_55976 a2, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_142875 & a3Out, ptr32 & a4Out, union Eq_142877 & s3Out, struct Eq_142878 & s4Out, ptr32 & s5Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a0_13;
	Eq_142875 a3_16;
	ptr32 a4_17;
	ptr32 mstatus_21;
	ptr32 s0_23;
	ptr32 s1_24;
	Eq_142877 s3_26;
	struct Eq_142878 * s4_27;
	ptr32 s5_28;
	ptr32 s9_32;
	word32 a5_61;
	Eq_2 ra_22 = udp_sendto_chksum(ra, a0, a1, a2, a3, 0x00, null, s4, mstatus, dwArg14, dwArg28, dwArg48, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_23, out s1_24, out a0_13, out a3_16, out a4_17, out a5_61, out s3_26, out s4_27, out s5_28, out s9_32, out mstatus_21);
	s0Out = s0_23;
	s1Out = s1_24;
	a0Out = a0_13;
	a3Out = a3_16;
	a4Out = a4_17;
	s3Out = s3_26;
	s4Out = s4_27;
	s5Out = s5_28;
	s9Out = s9_32;
	mstatusOut = mstatus_21;
	return ra_22;
}

// 2304598E: Register Eq_2 udp_sendto_if(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_196424) s2Out, Register out ptr32 s3Out, Register out Eq_196426 s4Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
//      dhcp_server_recv
Eq_2 udp_sendto_if(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, struct Eq_196424 & s2Out, ptr32 & s3Out, union Eq_196426 & s4Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a3_17;
	ptr32 a4_18;
	ptr32 mstatus_22;
	struct Eq_196424 * s2_26;
	ptr32 s3_27;
	Eq_196426 s4_28;
	ptr32 s7_31;
	ptr32 s8_32;
	word32 s0_58;
	word32 s1_59;
	word32 a0_60;
	word32 a5_61;
	word32 s5_62;
	word32 s9_63;
	Eq_2 ra_23 = udp_sendto_if_chksum(ra, a0, a1, a2, a3, a4, 0x00, 0x00, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_58, out s1_59, out a0_60, out a3_17, out a4_18, out a5_61, out s2_26, out s3_27, out s4_28, out s5_62, out s7_31, out s8_32, out s9_63, out mstatus_22);
	a3Out = a3_17;
	a4Out = a4_18;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s7Out = s7_31;
	s8Out = s8_32;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 23045996: Register Eq_2 udp_sendto_if_src(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
Eq_2 udp_sendto_if_src(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 s4_20;
	ptr32 a3_26;
	ptr32 a4_27;
	ptr32 s2_30;
	ptr32 s3_31;
	ptr32 mstatus_42;
	word32 s0_58;
	word32 s1_59;
	word32 a0_60;
	word32 a5_61;
	word32 s5_62;
	word32 s7_63;
	word32 s8_64;
	word32 s9_65;
	Eq_2 ra_35 = udp_sendto_if_src_chksum(ra, a0, a1, a2, a3, a4, 0x00, 0x00, a5, s8, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_58, out s1_59, out a0_60, out a3_26, out a4_27, out a5_61, out s2_30, out s3_31, out s4_20, out s5_62, out s7_63, out s8_64, out s9_65, out mstatus_42);
	a3Out = a3_26;
	a4Out = a4_27;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_20;
	mstatusOut = mstatus_42;
	return ra_35;
}

