pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230459A0: Register ui32 udp_bind_netif(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      lwip_setsockopt_callback
ui32 udp_bind_netif(Eq_2 a0, Eq_2 a1)
{
	ui32 a5_3 = 0x00;
	if (a1 != 0x00)
		a5_3 = (word32) *((word32) a1 + 0x0044) + 0x01 & 0x00FF;
	((word32) a0 + 8)->u1 = (byte) a5_3;
	return a5_3;
}

// 230459B4: Register Eq_2 udp_connect(Register Eq_2 a0, Register (ptr32 Eq_196095) a1, Register Eq_196096 a2, Stack Eq_2 dwArg38, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_196096 s2Out)
// Called from:
//      dhcp_inc_pcb_refcount
//      lwip_netconn_do_connect
Eq_2 udp_connect(Eq_2 a0, struct Eq_196095 * a1, Eq_196096 a2, Eq_2 dwArg38, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_196096 & s2Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		a4Out = a4;
		a5Out.u0 = ~0x0F;
		s2Out = s2;
		return ~0x0F;
	}
	Eq_2 a4_106;
	Eq_2 a5_17 = (word32) *((word32) a0 + 18);
	if (a5_17 == 0x00)
	{
		word32 a5_144;
		word32 a3_143;
		Eq_2 a0_24 = udp_bind(a0, a0, null, out a3_143, out a4_106, out a5_144);
		a5_17 = a0_24;
		if (a0_24 != 0x00)
			goto l23045A06;
	}
	*((word32) a0 + 20) = (word16) a2;
	*((word32) a5_17 + 4) = a0;
	((word32) a0 + 16)->u1 = (byte) ((word32) *((word32) a0 + 16) | 4);
	Eq_2 a3_43 = g_t4201FEBC;
	a4_106 = a3_43;
	while (a4_106 != 0x00)
	{
		if (a4_106 == a0)
			goto l230459F6;
		a4_106 = *((word32) a4_106 + 0x0C);
	}
	*((word32) a3_43 + 0x0C) = a0;
	*(union Eq_2 *) 1107431100 = a0;
l230459F6:
	a5_17.u0 = 0x00;
l23045A06:
	0x00 = (uint16) dwArg38;
	a4Out = a4_106;
	a5Out = a5_17;
	s2Out = a2;
	return a5_17;
}

// 23045A20: Register ui32 udp_disconnect(Register Eq_226724 a0)
// Called from:
//      lwip_netconn_do_disconnect
ui32 udp_disconnect(Eq_226724 a0)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *((word32) a0 + 16);
		*((word32) a0 + 4) = 0x00;
		*((word32) a0 + 20) = 0x00;
		((word32) a0 + 8)->u0 = 0x00;
		((word32) a0 + 16)->u0 = (byte) (a5_5 & ~0x04);
		a5 = a5_5 & ~0x04;
	}
	return a5;
}

// 23045A3A: void udp_recv(Register Eq_2 a0, Register (ptr32 Eq_143082) a1, Register Eq_2 a2)
// Called from:
//      dns_server_init
//      dns_init
//      dhcp_inc_pcb_refcount
//      lwip_netconn_do_newconn
//      dhcp_server_start
//      iperf_server_udp
//      sntp_init
void udp_recv(Eq_2 a0, struct Eq_143082 * a1, Eq_2 a2)
{
	if (a0 != 0x00)
	{
		a1->t0020 = a0;
		*((word32) a2 + 36) = a0;
	}
}

// 23045A42: Register Eq_2 udp_remove(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out (ptr32 byte) a4Out, Register out (ptr32 Eq_143100) a5Out)
// Called from:
//      dns_server_init
//      dhcp_dec_pcb_refcount
//      lwip_netconn_do_delconn
//      dhcp_server_stop
//      iperf_server_udp
Eq_2 udp_remove(Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, byte & a4Out, struct Eq_143100 & a5Out)
{
	Eq_2 a1_14 = a0;
	if (a0 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a5_13 = g_t4201FEBC;
		if (a5_13 == a0)
			*(union Eq_2 *) 1107431100 = a5_13;
		else
		{
			while (a5_13 != 0x00)
			{
				Eq_2 a5_11 = g_t4202000C;
				if (false)
					break;
				if (a0 == 0x42020000)
				{
					a1_14 = g_t4202000C;
					g_t4202000C = a5_11;
					break;
				}
				a5_13.u0 = 0x42020000;
			}
		}
		struct Eq_143100 * a5_27;
		Eq_2 a0_28;
		ptr32 a2_29;
		Eq_2 a3_30;
		byte * a4_31;
		Eq_2 s1_32 = memp_free(0x01, a1_14, a3, 0x42020000, mstatus, out a0_28, out a2_29, out a3_30, out a4_31, out a5_27);
		a0Out = a0_28;
		a2Out = a2_29;
		a3Out = a3_30;
		a4Out = a4_31;
		a5Out = a5_27;
		return s1_32;
	}
}

// 23045A72: Register Eq_2 udp_new(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      dns_server_init
//      dhcp_inc_pcb_refcount
//      udp_new_ip_type
//      dhcp_server_start
//      iperf_server_udp
Eq_2 udp_new(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_13;
	word32 a2_63;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_14;
	Eq_2 s1_18 = memp_malloc(s1, 0x01, a3, a4, mstatus, out a0_13, out a2_63, out a3_16, out a4_17, out a5_14);
	if (a0_13 != 0x00)
	{
		word32 t1_64;
		word32 a0_65;
		word32 a1_66;
		word32 a2_67;
		word32 a5_68;
		ra = memset(ra, a0_13, 0x00, 40, out t1_64, out a0_65, out a1_66, out a2_67, out a3_16, out a4_17, out a5_68);
		((word32) a0_13 + 11)->u1 = ~0x00;
		((word32) a0_13 + 29)->u1 = ~0x00;
		a5_14 = ~0x00;
	}
	s1Out = s1_18;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_14;
	return ra;
}

// 23045AA0: Register Eq_2 udp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      dns_init
//      lwip_netconn_do_newconn
//      sntp_init
Eq_2 udp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_9;
	ptr32 a4_10;
	ptr32 a5_11;
	ptr32 s1_12;
	Eq_2 ra_15 = udp_new(ra, s1, a3, a4, mstatus, out s1_12, out a3_9, out a4_10, out a5_11);
	s1Out = s1_12;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	return ra_15;
}

// 23045AA4: Register Eq_2 udp_netif_ip_addr_changed(Register word32 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      netif_do_set_ipaddr
//      netif_remove
Eq_2 udp_netif_ip_addr_changed(word32 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5)
{
	if (a0 != 0x00 && (a5 != 0x00 && (a1 != 0x00 && a5 != 0x00)))
	{
		a5 = g_t4201FEBC;
		while (a5 != 0x00)
		{
			struct Eq_226862 * a5_14 = *a3;
			if (a3 == a4)
				*a4 = a5_14;
			a5 = a5_14->t000C;
		}
	}
	return a5;
}

// 23045ACC: void udp_get_pcbs()
// Called from:
//      stats_netstat
void udp_get_pcbs()
{
}

// 23045AD6: void ethernet_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack word32 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgA4, Stack Eq_2 dwArgA8, Stack word32 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack word32 dwArgC0, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack word32 dwArg0168, Stack word32 dwArg0188)
void ethernet_input(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, word32 dwArg8C, Eq_2 dwArg94, Eq_2 dwArg98, word32 dwArgA4, Eq_2 dwArgA8, word32 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgB8, word32 dwArgC0, word32 dwArgC4, Eq_2 dwArgC8, word32 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, word32 dwArg0168, word32 dwArg0188)
{
	Eq_2 a4_194;
	Eq_2 s0_15 = a0;
	if ((word32) *((word32) a0 + 0x0A) <= 0x0E)
	{
l23045AEC:
		g_w4201FDC0 = (word16) ((word32) g_w4201FDC0 + 0x01);
		goto l23045B80;
	}
	if ((word32) *((word32) a0 + 0x0F) == 0x00)
		((word32) a0 + 0x0F)->u1 = (byte) ((word32) *((word32) a1 + 0x0044) + 0x01);
	ui32 a5_29 = (word32) *a0;
	s0_15 = *((word32) a0 + 4);
	Eq_2 s1_28 = (word32) *((word32) a0 + 0x0D) << 8 | (word32) (*((word32) a0 + 0x0C));
	a4_194 = a5_29 & 1;
	if ((a5_29 & 1) != 0x00)
	{
		ui32 a5_42;
		a4_194.u0 = 0x01;
		if (a5_29 != 0x01)
		{
			word32 a5_485;
			word32 a1_484;
			if (memcmp(a0, 587783836, 0x06, out a1_484, out a2, out a3, out a4_194, out a5_485) != 0x00)
				goto l23045B4E;
			a5_42 = (word32) *((word32) s0_15 + 0x0D) | 8;
l23045B4A:
			*((word32) s0_15 + 0x0D) = (byte) a5_42;
			goto l23045B4E;
		}
		if ((word32) *((word32) a0 + 1) != 0x00)
			goto l23045B4E;
		a4_194 = (word32) *((word32) a0 + 2);
		if (a4_194 == 94)
		{
			a5_42 = (word32) *((word32) s0_15 + 0x0D) | 16;
			goto l23045B4A;
		}
	}
l23045B4E:
	if (s1_28 != 0x08)
	{
		if (s1_28 != 1544)
			goto l23045AEC;
		if (((word32) *((word32) a1 + 65) & 0x08) != 0x00)
		{
			word32 a4_503;
			word32 a5_504;
			word32 a1_502;
			if (pbuf_remove_header(s0_15, 0x0E, a2, out a1_502, out a3, out a4_503, out a5_504) != 0x00)
			{
				g_w4201FDBA = (word16) ((word32) g_w4201FDBA + 0x01);
l23045B80:
				word32 a4_193 = (word32) g_w4201FDB6;
				g_w4201FDB6 = (word16) (a4_193 + 0x01);
				a4_194 = a4_193 + 0x01;
				goto l23045B8A;
			}
			etharp_input(ra, s1_28, a1, a3, a1, s4, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg24, dwArg28, dwArg38, dwArg54, dwArg58, dwArg68, s1, ra, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB0, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArg0148, dwArg0188);
l23045BC6:
			0x00 = (uint16) dwArg38;
			return;
		}
	}
	else if (((word32) *((word32) a1 + 65) & 0x08) != 0x00)
	{
		word32 a5_506;
		word32 a1_505;
		if (pbuf_remove_header(s0_15, 0x0E, a2, out a1_505, out a3, out a4_194, out a5_506) == 0x00)
		{
			ip4_input(ra, s0_15, s0_15, a1, a3, s3, s4, s5, s6, s8, s10, s11, mstatus, s0, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA4, dwArgA8, dwArgAC, dwArgB8, dwArgC0, dwArgC4, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168);
			goto l23045BC6;
		}
	}
l23045B8A:
	word32 a1_489;
	word32 a0_488;
	word32 s0_486;
	word32 s1_487;
	word32 s2_495;
	word32 a7_494;
	word32 a4_492;
	word32 a5_493;
	word32 a2_490;
	word32 a3_491;
	word32 s4_497;
	word32 s5_498;
	word32 s8_500;
	word32 mstatus_501;
	word32 s3_496;
	word32 s6_499;
	pbuf_free(ra, s0_15, a3, a4_194, s4, mstatus, dwArg0118, out s0_486, out s1_487, out a0_488, out a1_489, out a2_490, out a3_491, out a4_492, out a5_493, out a7_494, out s2_495, out s3_496, out s4_497, out s5_498, out s6_499, out s8_500, out mstatus_501);
	goto l23045BC6;
}

// 23045BDE: Register Eq_2 ethernet_output(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      etharp_input
//      etharp_request
//      etharp_output_to_arp_index
//      etharp_query
//      etharp_output
Eq_2 ethernet_output(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	word32 a5_170;
	Eq_2 a0_26 = lwip_htons(a4, out a5_170);
	Eq_2 a3_34;
	word32 a1_171;
	word32 a2_172;
	word32 a4_173;
	word32 a5_174;
	if (pbuf_add_header(a1, 0x0E, out a1_171, out a2_172, out a3_34, out a4_173, out a5_174) != 0x00)
	{
		word32 a4_40 = (word32) g_w4201FDA2;
		g_w4201FDA2 = (word16) (a4_40 + 0x01);
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = a0_26;
		a3Out = a3_34;
		a4Out = a4_40 + 0x01;
		s2Out = a1;
		s3Out = a0;
		s4Out = a2;
		return ra;
	}
	else
	{
		Eq_2 s0_50 = *((word32) a1 + 4);
		((word32) s0_50 + 0x0C)->u1 = (byte) a0_26;
		*((word32) s0_50 + 0x0D) = (byte) (a0_26 >> 8);
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a6_180;
		word32 a7_181;
		memcpy(s0_50, a3_34, 0x06, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a6_180, out a7_181);
		word32 a4_73;
		word32 a3_78;
		word32 a1_182;
		word32 a2_183;
		word32 a5_184;
		word32 a6_185;
		word32 a7_186;
		memcpy((word32) s0_50 + 6, a2, 0x06, out a1_182, out a2_183, out a3_78, out a4_73, out a5_184, out a6_185, out a7_186);
		<anonymous> * t1_87 = *((word32) a0 + 24);
		0x00 = (uint16) dwArg0128;
		Eq_2 s3_96;
		ptr32 a4_98;
		Eq_2 a3_99;
		Eq_2 ra_100;
		Eq_2 s1_101;
		Eq_2 s2_102;
		Eq_2 s4_103;
		Eq_2 s0_106;
		word32 t1_107;
		word32 a7_112;
		word32 a6_113;
		word32 t0_114;
		word32 t4_115;
		word32 t5_116;
		word32 t6_117;
		t1_87();
		s0Out = s0_106;
		s1Out = s1_101;
		a3Out = a3_99;
		a4Out = a4_98;
		s2Out = s2_102;
		s3Out = s3_96;
		s4Out = s4_103;
		return ra_100;
	}
}

// 23045C68: Register word32 netconn_apimsg(Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_227240 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_227244 a4Out, Register out (ptr32 Eq_227245) a5Out, Register out Eq_227246 s2Out, Register out (ptr32 Eq_227247) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      netconn_new_with_proto_and_callback
//      netconn_prepare_delete
//      netconn_getaddr
//      netconn_bind
//      netconn_connect
//      netconn_disconnect
//      netconn_listen_with_backlog
//      netconn_tcp_recvd
//      netconn_send
//      netconn_write_vectors_partly
//      netconn_recv_tcp_pbuf_flags
//      netconn_shutdown
//      netconn_join_leave_group
word32 netconn_apimsg(Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_227240 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_227244 & a4Out, struct Eq_227245 & a5Out, union Eq_227246 & s2Out, struct Eq_227247 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a1_17;
	ptr32 a3_19;
	Eq_227244 a4_20;
	struct Eq_227245 * a5_21;
	word32 s1_25;
	Eq_227246 s2_26;
	struct Eq_227247 * s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	ptr32 s6_30;
	Eq_227240 a0_16;
	struct Eq_227262 * s0_24 = tcpip_send_msg_wait_sem(*a2, (word32) a2 + 0x0C, a4, a5, mstatus, dwArg04, dwArgB8, dwArgF8, dwArg0138, out s1_25, out a0_16, out a1_17, out a3_19, out a4_20, out a5_21, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30);
	if (a0_16 == 0x00)
		a0_16.u0 = (int32) s0_24->b0004;
	a0Out = a0_16;
	a1Out = a1_17;
	a2Out = dwArg10;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_21;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	s6Out = s6_30;
	return s1_25;
}

// 23045C86: Register Eq_2 netconn_close_shutdown(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a2Out, Register out (ptr32 Eq_227297) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      netconn_recv_tcp_pbuf_flags
//      netconn_shutdown
Eq_2 netconn_close_shutdown(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a2Out, struct Eq_227297 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (a0 == 0x00)
	{
		a2Out = a2;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return ~0x0F;
	}
	else
	{
		Eq_2 a5_12;
		sys_now(out a5_12);
		Eq_2 a0_20;
		Eq_2 a2_22;
		struct Eq_227297 * a5_25;
		ptr32 s3_30;
		ptr32 s4_31;
		ptr32 s5_32;
		ptr32 s6_33;
		word32 a1_100;
		word32 a3_101;
		word32 a4_102;
		word32 s2_103;
		netconn_apimsg(a2, a4, a5_12, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_20, out a1_100, out a2_22, out a3_101, out a4_102, out a5_25, out s2_103, out s3_30, out s4_31, out s5_32, out s6_33);
		a2Out = a2_22;
		a5Out = a5_25;
		s3Out = s3_30;
		s4Out = s4_31;
		s5Out = s5_32;
		s6Out = s6_33;
		return a0_20;
	}
}

// 23045CB0: Register Eq_2 netconn_new_with_proto_and_callback(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      lwip_socket
Eq_2 netconn_new_with_proto_and_callback(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	Eq_2 a2_20;
	Eq_2 a5_23;
	Eq_2 a4_101;
	Eq_2 a3_100;
	Eq_2 a1_139;
	ptr32 s2_147;
	ptr32 s3_148;
	Eq_2 a0_27 = netconn_alloc(ra, a0, a3, a4, mstatus, dwLoc40, dwLoc3C, dwLoc08, dwArg44, dwArgB8, dwArgF8, dwArg0138, out a1_139, out a2_20, out a3_100, out a4_101, out a5_23, out s2_147, out s3_148);
	Eq_2 s0_104 = a0_27;
	if (a0_27 != 0x00)
	{
		word32 a0_40;
		word32 a2_170;
		word32 a5_171;
		word32 s4_172;
		word32 s6_173;
		netconn_apimsg(a2_20, a4_101, a5_23, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_40, out a1_139, out a2_170, out a3_100, out a4_101, out a5_171, out s2_147, out s3_148, out s4_172, out s5, out s6_173);
		if (a0_40 != 0x00)
		{
			sys_mbox_valid((word32) a0_27 + 16);
			sys_mbox_valid((word32) a0_27 + 20);
			sys_sem_valid((word32) a0_27 + 0x0C);
			Eq_2 a3_74;
			Eq_2 a4_75;
			Eq_2 s1_79;
			word32 a1_174;
			word32 a2_175;
			word32 a5_176;
			word32 s4_177;
			Eq_2 s0_78 = sys_sem_free((word32) a0_27 + 0x0C, a3_100, mstatus, dwArg0118, dwArg0158, out s1_79, out a1_174, out a2_175, out a3_74, out a4_75, out a5_176, out s4_177);
			Eq_2 a3_87;
			Eq_2 a4_88;
			word32 a0_178;
			word32 a2_179;
			word32 a5_180;
			word32 s4_181;
			sys_mbox_free(s1_79, a3_74, a4_75, mstatus, dwArg0108, dwArg0148, out a0_178, out a2_179, out a3_87, out a4_88, out a5_180, out s4_181);
			word32 a0_182;
			word32 a2_183;
			word32 a5_184;
			memp_free(0x07, s0_78, a3_87, a4_88, mstatus, out a0_182, out a2_183, out a3_100, out a4_101, out a5_184);
			s2_147 = (word32) a0_27 + 0x0C;
			a1_139 = s0_78;
			s0_104.u0 = 0x00;
		}
	}
	a1Out = a1_139;
	a3Out = a3_100;
	a4Out = a4_101;
	s2Out = s2_147;
	s3Out = s3_148;
	s5Out = s5;
	return s0_104;
}

// 23045D1C: Register word32 netconn_prepare_delete(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      free_socket
//      lwip_close
word32 netconn_prepare_delete(Eq_2 a0, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (a0 == 0x00)
	{
		a0Out = 0x00;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return s1;
	}
	else
	{
		Eq_2 a5_10;
		sys_now(out a5_10);
		ptr32 a0_18;
		ptr32 a1_19;
		ptr32 a3_21;
		Eq_2 a4_22;
		ptr32 s2_27;
		ptr32 s3_28;
		ptr32 s4_29;
		ptr32 s5_30;
		ptr32 s6_31;
		word32 a2_101;
		word32 a5_102;
		word32 s1_26 = netconn_apimsg(a2, a4, a5_10, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_18, out a1_19, out a2_101, out a3_21, out a4_22, out a5_102, out s2_27, out s3_28, out s4_29, out s5_30, out s6_31);
		a0Out = a0_18;
		a1Out = a1_19;
		a3Out = a3_21;
		a4Out = a4_22;
		s2Out = s2_27;
		s3Out = s3_28;
		s4Out = s4_29;
		s5Out = s5_30;
		s6Out = s6_31;
		return s1_26;
	}
}

