pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23045D42: Register Eq_2 netconn_delete(Register Eq_2 a0)
// Called from:
//      free_socket
//      lwip_accept
//      lwip_socket
Eq_2 netconn_delete(Eq_2 a0)
{
	Eq_2 s1_10 = 0x00;
	if (a0 != 0x00)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		word32 a0_37;
		word32 a1_38;
		word32 a3_39;
		word32 a4_40;
		word32 s2_41;
		word32 s3_42;
		word32 s4_43;
		word32 s5_44;
		word32 s6_45;
		netconn_prepare_delete(a0, a2, a4, mstatus, stackArg120, stackArg184, stackArg248, out a0_37, out a1_38, out a3_39, out a4_40, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45);
		s1_10 = a0;
		if (a0 == 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg328 = <invalid>;
			Eq_2 stackArg392 = <invalid>;
			word32 a4_49;
			word32 a5_50;
			netconn_free(a0, a3, mstatus, stackArg328, stackArg392, out a4_49, out a5_50);
		}
	}
	return s1_10;
}

// 23045D6A: Register Eq_2 netconn_getaddr(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_accept
//      lwip_read
Eq_2 netconn_getaddr(Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ~0x0F;
	}
	else if (a1 == 0x00 || a2 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_22;
		ptr32 a3_25;
		Eq_2 a4_26;
		ptr32 s2_31;
		ptr32 s3_32;
		ptr32 s4_33;
		word32 s6_128;
		word32 s5_127;
		word32 a5_126;
		word32 a2_125;
		word32 a1_124;
		netconn_apimsg(a2, a4, a0, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_22, out a1_124, out a2_125, out a3_25, out a4_26, out a5_126, out s2_31, out s3_32, out s4_33, out s5_127, out s6_128);
		a3Out = a3_25;
		a4Out = a4_26;
		s2Out = s2_31;
		s3Out = s3_32;
		s4Out = s4_33;
		return a0_22;
	}
}

// 23045D9C: Register Eq_2 netconn_bind(Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out, Register out ptr32 s3Out)
// Called from:
//      lwip_bind
Eq_2 netconn_bind(Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out, ptr32 & s3Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		s3Out = s3;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_28;
		ptr32 a3_31;
		ptr32 s3_38;
		word32 a1_108;
		word32 a2_109;
		word32 a4_110;
		word32 a5_111;
		word32 s2_112;
		word32 s4_113;
		word32 s5_114;
		word32 s6_115;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_28, out a1_108, out a2_109, out a3_31, out a4_110, out a5_111, out s2_112, out s3_38, out s4_113, out s5_114, out s6_115);
		a3Out = a3_31;
		s3Out = s3_38;
		return a0_28;
	}
}

// 23045DCC: Register Eq_2 netconn_connect(Register Eq_2 a0, Register (ptr32 Eq_188640) a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_188640) a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_connect
Eq_2 netconn_connect(Eq_2 a0, struct Eq_188640 * a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, struct Eq_188640 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_28;
		struct Eq_188640 * a1_29;
		ptr32 a3_31;
		Eq_2 a4_32;
		ptr32 s2_37;
		ptr32 s3_38;
		ptr32 s4_39;
		word32 a2_112;
		word32 a5_113;
		word32 s5_114;
		word32 s6_115;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_28, out a1_29, out a2_112, out a3_31, out a4_32, out a5_113, out s2_37, out s3_38, out s4_39, out s5_114, out s6_115);
		a1Out = a1_29;
		a3Out = a3_31;
		a4Out = a4_32;
		s2Out = s2_37;
		s3Out = s3_38;
		s4Out = s4_39;
		return a0_28;
	}
}

// 23045DFC: Register word32 netconn_disconnect(Register word32 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_188591) a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_connect
word32 netconn_disconnect(word32 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, struct Eq_188591 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ~0x0F;
	}
	else
	{
		word32 a0_16;
		struct Eq_188591 * a1_17;
		ptr32 a3_19;
		Eq_2 a4_20;
		ptr32 s2_25;
		ptr32 s3_26;
		ptr32 s4_27;
		word32 a2_94;
		word32 a5_95;
		word32 s5_96;
		word32 s6_97;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_16, out a1_17, out a2_94, out a3_19, out a4_20, out a5_95, out s2_25, out s3_26, out s4_27, out s5_96, out s6_97);
		a1Out = a1_17;
		a3Out = a3_19;
		a4Out = a4_20;
		s2Out = s2_25;
		s3Out = s3_26;
		s4Out = s4_27;
		return a0_16;
	}
}

// 23045E1C: Register Eq_2 netconn_listen_with_backlog(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      lwip_listen
Eq_2 netconn_listen_with_backlog(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a3Out, ptr32 & s2Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		s2Out = s2;
		return ~0x0F;
	}
	else
	{
		Eq_2 a0_16;
		ptr32 a3_19;
		ptr32 s2_25;
		word32 a1_90;
		word32 a2_91;
		word32 a4_92;
		word32 a5_93;
		word32 s3_94;
		word32 s4_95;
		word32 s5_96;
		word32 s6_97;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_16, out a1_90, out a2_91, out a3_19, out a4_92, out a5_93, out s2_25, out s3_94, out s4_95, out s5_96, out s6_97);
		a3Out = a3_19;
		s2Out = s2_25;
		return a0_16;
	}
}

// 23045E3C: Register word32 netconn_tcp_recvd(Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_186934 a4Out, Register out (ptr32 Eq_186935) s3Out)
// Called from:
//      lwip_recv_tcp
word32 netconn_tcp_recvd(Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_186934 & a4Out, struct Eq_186935 & s3Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		s3Out = s3;
		return s1;
	}
	else
	{
		ui32 a4_6 = (word32) *a0;
		if ((a4_6 & 0x00F0) != 0x10)
		{
			a4Out = a4_6 & 0x00F0;
			s3Out = s3;
			return s1;
		}
		else
		{
			Eq_186934 a4_26;
			struct Eq_186935 * s3_32;
			word32 a0_98;
			word32 a1_99;
			word32 a2_100;
			word32 a3_101;
			word32 a5_102;
			word32 s2_103;
			word32 s4_104;
			word32 s5_105;
			word32 s6_106;
			word32 s1_30 = netconn_apimsg(a2, a4_6 & 0x00F0, a0, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_98, out a1_99, out a2_100, out a3_101, out a4_26, out a5_102, out s2_103, out s3_32, out s4_104, out s5_105, out s6_106);
			a4Out = a4_26;
			s3Out = s3_32;
			return s1_30;
		}
	}
}

