pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23045E72: Register word32 netconn_send(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a4Out, Register out ptr32 s4Out)
// Called from:
//      lwip_sendto
word32 netconn_send(Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a4Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		s4Out = s4;
		return a3;
	}
	else
	{
		word32 a3_21;
		Eq_2 a4_22;
		ptr32 s4_29;
		word32 a0_92;
		word32 a1_93;
		word32 a2_94;
		word32 a5_95;
		word32 s2_96;
		word32 s3_97;
		word32 s5_98;
		word32 s6_99;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_92, out a1_93, out a2_94, out a3_21, out a4_22, out a5_95, out s2_96, out s3_97, out s4_29, out s5_98, out s6_99);
		a4Out = a4_22;
		s4Out = s4_29;
		return a3_21;
	}
}

// 23045E94: Register (ptr32 Eq_189336) netconn_write_vectors_partly(Register (ptr32 Eq_189336) a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_189337 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_189337 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      netconn_write_partly
struct Eq_189336 * netconn_write_vectors_partly(struct Eq_189336 * a0, ptr32 a1, Eq_2 a2, Eq_189337 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_189337 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if (a0 == null)
	{
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return (struct Eq_189336 *) ~0x0F;
	}
	struct Eq_189336 * a0_10 = (struct Eq_189336 *) ~0x05;
	if (((word32) a0->b0000 & 0x00F0) == 0x10)
	{
		int32 t1_12 = a0->dw001C;
		if (((word32) (((word32) a0->b0024 & 0x02 | a3 & 4) != 0x00) | t1_12) != 0x00 && a4 == 0x00)
		{
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s8Out = s8;
			return (struct Eq_189336 *) ~0x05;
		}
		struct Eq_227842 * a7_23 = a1 + 4;
		Eq_2 a0_24 = 0x00;
		Eq_2 a5_25 = 0x00;
		while (a0_24 < a2)
		{
			Eq_2 t3_30 = a7_23->dw0000;
			++a7_23;
			a5_25 += t3_30;
			if (a5_25 < t3_30)
			{
				a3Out = a3;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				s8Out = s8;
				return (struct Eq_189336 *) ~0x05;
			}
			a0_24 = (word32) a0_24 + 1;
		}
		if (a5_25 == 0x00)
		{
			a0_10 = null;
			goto l23045EDE;
		}
		if (a5_25 >= 0x00)
		{
l23045F04:
			if (t1_12 != 0x00)
				sys_now(out a5_25);
			Eq_189337 a3_97;
			union Eq_2 * a5_99;
			ptr32 s2_103;
			ptr32 s3_104;
			ptr32 s4_105;
			ptr32 s5_106;
			word32 a4_297;
			word32 s6_298;
			word32 a2_296;
			word32 a1_295;
			struct Eq_189336 * a0_117;
			netconn_apimsg(a2, a4, a5_25, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_117, out a1_295, out a2_296, out a3_97, out a4_297, out a5_99, out s2_103, out s3_104, out s4_105, out s5_106, out s6_298);
			if (a0_117 == null)
			{
				if (a4 != 0x00)
					*a5_99 = (union Eq_2 *) a4;
				else
					a0_117 = null;
			}
			a3Out = a3_97;
			s2Out = s2_103;
			s3Out = s3_104;
			s4Out = s4_105;
			s5Out = s5_106;
			s8Out = dwArgD4;
			return a0_117;
		}
		a0_10 = (struct Eq_189336 *) ~0x05;
		if (a4 != 0x00)
		{
			a5_25.u0 = 0x7FFFFFFF;
			goto l23045F04;
		}
	}
l23045EDE:
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s8Out = s8;
	return a0_10;
}

// 23045F4C: Register (ptr32 Eq_189336) netconn_write_partly(Register (ptr32 Eq_189336) a0, Register Eq_189337 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out Eq_189343 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      lwip_send
struct Eq_189336 * netconn_write_partly(struct Eq_189336 * a0, Eq_189337 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgD8, union Eq_189343 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	Eq_189343 a3_24;
	ptr32 s2_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s5_31;
	ptr32 s8_33;
	struct Eq_189336 * a0_16 = netconn_write_vectors_partly(a0, fp + ~0x17, 0x01, a3, a4, mstatus, dwArg58, dwArg98, dwArgD8, out a3_24, out s2_28, out s3_29, out s4_30, out s5_31, out s8_33);
	a3Out = a3_24;
	s2Out = s2_28;
	s3Out = s3_29;
	s4Out = s4_30;
	s5Out = s5_31;
	s8Out = s8_33;
	return a0_16;
}

// 23045F62: Register Eq_227932 netconn_err(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_227932 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_227941) a5Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_recv_tcp_pbuf_flags
//      lwip_netconn_do_send
//      lwip_netconn_do_write
Eq_227932 netconn_err(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_227932 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_227941 & a5Out)
{
	Eq_227932 s1_10 = 0x00;
	if (a0 != 0x00)
	{
		word32 a2_50;
		word32 a4_51;
		word32 a5_52;
		sys_arch_protect(a4, mstatus, out a2_50, out a4_51, out a5_52);
		s1_10.u0 = (int32) *((word32) a0 + 8);
		*((word32) a0 + 8) = 0x00;
		a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5);
	}
	a0Out = s1_10;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return s1_10;
}

// 23045F8C: Register Eq_2 netconn_accept(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 word32) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg54, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_188066 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_accept
Eq_2 netconn_accept(Eq_2 ra, Eq_2 a0, word32 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg54, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_188066 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_104;
	struct Eq_227969 * sp_102 = fp + -48;
	if (a1 == null)
	{
l23045F9A:
		s0_104.u0 = ~0x0F;
		goto l23045F9C;
	}
	*a1 = 0x00;
	if (a0 == 0x00)
		goto l23045F9A;
	Eq_2 a0_22;
	Eq_2 a2_23;
	Eq_2 s1_24 = netconn_err(a0, a3, a4, mstatus, out a0_22, out a2_23, out a3, out a4, out a5);
	s0_104 = a0_22;
	if (a0_22 == 0x00)
	{
		if (sys_mbox_valid((word32) s1_24 + 20) == 0x00)
		{
l23045FCE:
			s0_104.u0 = ~0x0E;
			goto l23045F9C;
		}
		a5 = (word32) *((word32) s1_24 + 36);
		a4 = a5 & 1;
		if ((a5 & 1) != 0x00)
			goto l23045FCE;
		union Eq_188066 * s2_106;
		Eq_2 a0_109;
		word32 s3_51;
		if ((a5 & 0x02) != 0x00)
		{
			word32 s4_303;
			word32 a1_302;
			word32 s1_301;
			s0_104 = sys_arch_mbox_tryfetch((word32) s1_24 + 20, fp + -36, a3, a5 & 1, a5 & 0x02, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_301, out a0_109, out a1_302, out a3, out a4, out s2_106, out s3_51, out s4_303);
			a5.u0 = ~0x00;
			if (a0_109 == ~0x00)
			{
				s0_104.u0 = ~0x06;
				goto l23045F9C;
			}
		}
		else
		{
			word32 s1_297;
			word32 a1_298;
			word32 a5_299;
			word32 s4_300;
			s0_104 = sys_arch_mbox_fetch((word32) s1_24 + 20, fp + -36, a2_23, a3, a5 & 1, mstatus, dwArg34, dwArgA8, dwArgE8, out s1_297, out a0_109, out a1_298, out a3, out a4, out a5_299, out s2_106, out s3_51, out s4_300);
			a5.u0 = ~0x00;
			if (a0_109 == ~0x00)
			{
				s0_104.u0 = ~0x02;
				goto l23045F9C;
			}
		}
		Eq_2 s1_90 = *(union Eq_2 *) 0x2B;
		if (true)
		{
			word32 a5_113;
			word32 a6_117;
			word32 a7_118;
			word32 s4_119;
			word32 s8_120;
			word32 t0_121;
			word32 t1_122;
			word32 t4_123;
			word32 t5_124;
			word32 t6_125;
			(*(<anonymous> *) ~0x00)();
		}
		if (lwip_netconn_is_err_msg(a0_109, &sp_102->b000B, out a4, out a5) != 0x00)
			s0_104 = (int32) sp_102->b000B;
		else
		{
			if (a5 == 0x00)
				goto l23045FCE;
			*s2_106 = (union Eq_188066 *) a5;
		}
	}
l23045F9C:
	0x00 = (uint16) dwArg0128;
	a0Out = s0_104;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	mstatusOut = mstatus;
	return ra;
}

