pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23046030: Register Eq_2 netconn_recv_data(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_186830) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_228121) a0Out, Register out (ptr32 Eq_186830) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_228121) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_186830) s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_recv_udp_raw_netbuf_flags
//      netconn_recv_tcp_pbuf_flags
Eq_2 netconn_recv_data(Eq_2 ra, Eq_2 a0, struct Eq_186830 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, struct Eq_228121 & a0Out, struct Eq_186830 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_228121 & a5Out, ptr32 & s2Out, struct Eq_186830 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	struct Eq_228121 * a5_101;
	if (a1 == null)
	{
l23046040:
		a5_101 = (struct Eq_228121 *) ~0x0F;
		goto l23046042;
	}
	a1->ptr0000 = null;
	if (a0 == 0x00)
		goto l23046040;
	s2 = (word32) a0 + 16;
	s3 = a1;
	if (sys_mbox_valid((word32) a0 + 16) == 0x00)
	{
		struct Eq_228121 * a0_171;
		word32 a5_410;
		word32 a2_409;
		s1 = netconn_err(a0, a3, a4, mstatus, out a0_171, out a2_409, out a3, out a4, out a5_410);
		a5_101 = a0_171;
		if (a0_171 != null)
			goto l23046042;
		goto l23046074;
	}
	Eq_2 a0_111;
	Eq_2 s0_102;
	ui32 a5_25 = (word32) *((word32) a0 + 36);
	Eq_2 a5_27 = a5_25 & 0x03;
	Eq_2 a2_28 = a2 & 4 | a5_25 & 0x03;
	if (a2_28 == 0x00)
	{
		a5_27 = (int32) *((word32) a0 + 8);
		if (a5_27 == 0x00)
		{
			word32 a5_412;
			word32 a4_411;
			s0_102 = sys_arch_mbox_fetch((word32) a0 + 16, fp + -36, a2_28, a3, a4, mstatus, dwArg34, dwArgA8, dwArgE8, out s1, out a0_111, out a1, out a3, out a4_411, out a5_412, out s2, out s3, out s4);
			a4.u0 = ~0x00;
			a5_101 = (struct Eq_228121 *) ~0x02;
			if (a0_111 == ~0x00)
				goto l23046042;
l2304609A:
			ui32 a5_104 = (word32) *s0_102;
			a4.u0 = 0x10;
			struct Eq_186830 * a5_108 = a5_104 & 0x00F0;
			if ((a5_104 & 0x00F0) == 0x10)
			{
				a1 = fp + -37;
				if (lwip_netconn_is_err_msg(a0_111, fp + -37, out a4, out a5_108) != 0x00)
				{
					a5_101 = (int32) bLoc25;
					a4.u0 = ~0x0E;
					if (a5_101 != (struct Eq_228121 *) ~0x0E)
						goto l23046042;
					goto l230460BE;
				}
			}
			word32 a2_118 = (word32) a5_108->w0008;
			word32 s0_119 = (&a5_108->w0008)[18];
			if (a5_108 != null)
			{
				word32 a6_152;
				word32 a7_153;
				word32 s8_155;
				word32 t0_156;
				word32 t1_157;
				word32 t4_158;
				word32 t5_159;
				word32 t6_160;
				a5_108();
			}
			s3->ptr0000 = a5_108;
l230460BE:
			a5_101 = null;
l23046042:
			0x00 = (uint16) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1;
			a0Out = a5_101;
			a1Out = a1;
			a2Out = dwArg0100;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5_101;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			mstatusOut = mstatus;
			return ra;
		}
	}
	Eq_2 a4_72;
	s0_102 = sys_arch_mbox_tryfetch((word32) a0 + 16, fp + -36, a3, a4, a5_27, mstatus, dwLoc2C, 0x00, dwArgC8, dwArg0108, out s1, out a0_111, out a1, out a3, out a4_72, out s2, out s3, out s4);
	if (a0_111 == ~0x00)
	{
		struct Eq_228121 * a0_91;
		word32 a5_414;
		word32 a2_413;
		s1 = netconn_err(s0_102, a3, a4_72, mstatus, out a0_91, out a2_413, out a3, out a4, out a5_414);
		a5_101 = a0_91;
		if (a0_91 == null)
		{
			if (((word32) *((word32) s0_102 + 36) & 0x01) != 0x00)
			{
l23046074:
				a5_101 = (struct Eq_228121 *) ~0x0A;
				goto l23046042;
			}
			a5_101 = (struct Eq_228121 *) ~0x06;
		}
		goto l23046042;
	}
	goto l2304609A;
}

// 23046108: Register Eq_2 netconn_recv_udp_raw_netbuf_flags(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_186830) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_186830) a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_187270) a5Out, Register out Eq_187271 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_recvfrom_udp_raw.isra.6
Eq_2 netconn_recv_udp_raw_netbuf_flags(Eq_2 ra, Eq_2 a0, struct Eq_186830 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, struct Eq_186830 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_187270 & a5Out, union Eq_187271 & s2Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *a0;
		a4 = 0x10;
		a5 = a5_5 & 0x00F0;
		if ((a5_5 & 0x00F0) != 0x10)
		{
			struct Eq_186830 * a1_14;
			Eq_2 a3_16;
			ptr32 a4_17;
			struct Eq_187270 * a5_18;
			ptr32 s1_22;
			Eq_187271 s2_23;
			ptr32 a0_34;
			ptr32 mstatus_35;
			word32 s4_120;
			word32 s3_119;
			word32 a2_118;
			word32 s0_117;
			Eq_2 ra_36 = netconn_recv_data(ra, a0, a1, a2, a3, 0x10, mstatus, dwArg14, dwArg34, dwArgA8, dwArgB4, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_117, out s1_22, out a0_34, out a1_14, out a2_118, out a3_16, out a4_17, out a5_18, out s2_23, out s3_119, out s4_120, out mstatus_35);
			s1Out = s1_22;
			a0Out = a0_34;
			a1Out = a1_14;
			a3Out = a3_16;
			a4Out = a4_17;
			a5Out = a5_18;
			s2Out = s2_23;
			mstatusOut = mstatus_35;
			return ra_36;
		}
	}
	s1Out = s1;
	a0Out = ~0x0F;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	mstatusOut = mstatus;
	return ra;
}

// 23046120: Register Eq_2 netconn_recv_data_tcp(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_186830) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_228367) a5Out, Register out (ptr32 Eq_186830) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_recv_tcp_pbuf_flags
Eq_2 netconn_recv_data_tcp(Eq_2 ra, Eq_2 a0, struct Eq_186830 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a4Out, struct Eq_228367 & a5Out, struct Eq_186830 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_228373 * sp_129 = fp + -80;
	Eq_2 s0_157 = a0;
	struct Eq_186830 * s3_119 = a1;
	Eq_2 s2_118 = a2;
	word32 s1_115 = ~0x0A;
	if (sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		ui32 a5_23 = (word32) *((word32) a0 + 36);
		a4 = (int32) (byte) a5_23;
		if (a4 < 0x00)
		{
			*((word32) a0 + 36) = (byte) (a5_23 & 0x007F);
			a5 = a5_23 & 0x007F;
			goto l23046152;
		}
		word32 a0_51;
		word32 s1_382;
		word32 a1_383;
		ui32 s2_40;
		ra = netconn_recv_data(ra, a0, a1, a2, a3, a4, mstatus, dwLoc3C, dwLoc1C, dwArg58, dwArg64, dwArg78, dwArg98, dwArgB8, dwArgD8, out s0_157, out s1_382, out a0_51, out a1_383, out a2, out a3, out a4, out a5, out s2_40, out s3_119, out s4, out mstatus);
		s1_115 = a0_51;
		if (a0_51 != 0x00)
			goto l230461CC;
		a5 = s2_40 & 8;
		s3_119 = s3_119->ptr0000;
		if ((s2_40 & 8) == 0x00)
		{
			a4.u0 = 0x01;
			if (s3_119 != null)
				a4 = (word32) s3_119->w0008;
			ui32 a5_61 = (word32) *s0_157;
			a3.u0 = 0x10;
			a5 = a5_61 & 0x00F0;
			if ((a5_61 & 0x00F0) == 0x10)
			{
				word32 a1_385;
				word32 a0_384;
				s1_115 = netconn_apimsg(a2, a4, a5_61 & 0x00F0, mstatus, dwLoc4C, dwArg68, dwArgA8, dwArgE8, out a0_384, out a1_385, out a2, out a3, out a4, out a5, out s2_40, out s3_119, out s4, out s5, out s6);
			}
		}
		if (s3_119 == null)
		{
			s2_118 = s2_40 & 16;
			if (s2_118 != 0x00)
			{
				ui32 a5_102 = (word32) *((word32) s0_157 + 36);
				*((word32) s0_157 + 36) = (byte) (a5_102 | -0x0080);
				a5 = a5_102 | -0x0080;
				goto l230461CC;
			}
l23046152:
			word32 s0_111 = a5->dw002C;
			if (a5 != null)
			{
				word32 a6_144;
				word32 a7_145;
				word32 s8_147;
				word32 t1_148;
				word32 t4_149;
				word32 t5_150;
				word32 t6_151;
				word32 tp_152;
				a5();
			}
			s0_157 = a5->t0004;
			if (a5 == null)
			{
				word32 a0_193;
				word32 a3_381;
				netconn_err(s0_157, a3, a4, mstatus, out a0_193, out a2, out a3_381, out a4, out a5);
			}
			else
				netconn_close_shutdown(s0_157, a2, a4, mstatus, sp_129->t0078, sp_129->t00B8, sp_129->t00F8, out a2, out a5, out s3_119, out s4, out s5, out s6);
			goto l230461CC;
		}
	}
l230461CC:
	s0Out = s0_157;
	s1Out = dwLoc4C;
	a0Out = dwLoc4C;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5;
	s3Out = s3_119;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return dwLoc08;
}

