pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230461E8: Register Eq_2 netconn_recv_tcp_pbuf_flags(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_186830) a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a4Out, Register out Eq_186848 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_186852 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_recv_tcp
Eq_2 netconn_recv_tcp_pbuf_flags(Eq_2 ra, Eq_2 a0, struct Eq_186830 * a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a4Out, union Eq_186848 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_186852 & s6Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		ui32 a5_5 = (word32) *a0;
		a4 = 0x10;
		a5 = a5_5 & 0x00F0;
		if ((a5_5 & 0x00F0) == 0x10)
		{
			ptr32 a0_14;
			ptr32 s0_17;
			ptr32 s1_18;
			ptr32 s3_20;
			Eq_2 a2_24;
			ptr32 a4_25;
			Eq_186848 a5_26;
			ptr32 mstatus_29;
			ptr32 s4_30;
			ptr32 s5_37;
			Eq_186852 s6_38;
			Eq_2 ra_16 = netconn_recv_data_tcp(ra, a0, a1, a2, a3, mstatus, dwArg58, dwArg64, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, out s0_17, out s1_18, out a0_14, out a2_24, out a4_25, out a5_26, out s3_20, out s4_30, out s5_37, out s6_38, out mstatus_29);
			s0Out = s0_17;
			s1Out = s1_18;
			a0Out = a0_14;
			a2Out = a2_24;
			a4Out = a4_25;
			a5Out = a5_26;
			s3Out = s3_20;
			s4Out = s4_30;
			s5Out = s5_37;
			s6Out = s6_38;
			mstatusOut = mstatus_29;
			return ra_16;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a0Out = ~0x0F;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 23046200: Register Eq_2 netconn_shutdown(Register Eq_2 a0, Register ptr32 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out ptr32 a2Out)
// Called from:
//      lwip_shutdown
Eq_2 netconn_shutdown(Eq_2 a0, ptr32 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, ptr32 & a2Out)
{
	ui32 a2_4 = (word32) (a2 != 0x00);
	ptr32 a2_15;
	word32 a5_39;
	word32 s3_40;
	word32 s4_41;
	word32 s5_42;
	word32 s6_43;
	Eq_2 a0_13 = netconn_close_shutdown(a0, a2_4 << 1, a4, mstatus, dwArg78, dwArgB8, dwArgF8, out a2_15, out a5_39, out s3_40, out s4_41, out s5_42, out s6_43);
	a2Out = a2_15;
	return a0_13;
}

// 23046210: Register Eq_2 netconn_join_leave_group(Register int32 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_close
Eq_2 netconn_join_leave_group(int32 a0, ptr32 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return a2;
	}
	else
	{
		if (a2 == 0x00)
			a2.u0 = 587783820;
		Eq_2 a2_43;
		Eq_2 a4_45;
		Eq_2 a5_46;
		union Eq_2 * s2_50;
		ptr32 s3_51;
		ptr32 s4_52;
		word32 a0_129;
		word32 a1_130;
		word32 a3_131;
		word32 s5_132;
		word32 s6_133;
		netconn_apimsg(a2, a4, a5, mstatus, dwLoc3C, dwArg78, dwArgB8, dwArgF8, out a0_129, out a1_130, out a2_43, out a3_131, out a4_45, out a5_46, out s2_50, out s3_51, out s4_52, out s5_132, out s6_133);
		a4Out = a4_45;
		a5Out = a5_46;
		s2Out = s2_50;
		s3Out = s3_51;
		s4Out = s4_52;
		return a2_43;
	}
}

// 2304624C: Register Eq_2 netconn_gethostbyname(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_185766 s3Out, Register out (ptr32 Eq_2) s4Out)
// Called from:
//      lwip_gethostbyname
//      lwip_getaddrinfo
Eq_2 netconn_gethostbyname(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_185766 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s0_36 = ~0x0F;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a0_21;
		Eq_2 a2_23;
		Eq_2 a5_26;
		s1 = sys_sem_new(ra, a3, fp + -37, a0, mstatus, dwLoc20, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_21, out a1, out a2_23, out a3, out a4, out a5_26, out s2, out s3, out s4);
		byte bLoc25_96 = (byte) a0_21;
		s0_36 = a0_21;
		if (a0_21 == 0x00)
		{
			union Eq_2 * a0_41;
			Eq_2 a3_44;
			word32 s1_152;
			word32 a1_153;
			word32 a4_154;
			word32 a5_155;
			word32 s4_156;
			word32 s5_157;
			word32 s6_158;
			tcpip_send_msg_wait_sem(fp + -32, a2_23, a4, a5_26, mstatus, s0, dwArg98, dwArgD8, dwArg0118, out s1_152, out a0_41, out a1_153, out a3_44, out a4_154, out a5_155, out s2, out s3, out s4_156, out s5_157, out s6_158);
			word32 a2_159;
			word32 a5_160;
			s0_36 = sys_sem_free(a0_41, a3_44, mstatus, dwArg0128, dwArg0168, out s1, out a1, out a2_159, out a3, out a4, out a5_160, out s4);
			if (s0_36 == 0x00)
				s0_36 = (int32) bLoc25_96;
		}
	}
	s1Out = s1;
	a0Out = s0_36;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return dwArgE4;
}

