pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304629E: void lwip_netconn_do_dns_found(Register Eq_2 a0, Register word32 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_dns_found(Eq_2 a0, word32 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	if (a1 == 0x00)
	{
		a5->u1 = ~0x05;
		a4.u0 = ~0x05;
	}
	else
	{
		a5->u1 = 0x00;
		*a4 = a5;
	}
	word32 s3_62;
	word32 s4_63;
	word32 s2_61;
	word32 a3_60;
	word32 a1_59;
	word32 s1_58;
	word32 s5_64;
	word32 s6_65;
	word32 s8_66;
	sys_sem_signal(a0, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_58, out a1_59, out a3_60, out s2_61, out s3_62, out s4_63, out s5_64, out s6_65, out s8_66);
}

// 230462BA: void recv_udp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 s5, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack word32 dwArgE4, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void recv_udp(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 s5, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg78, Eq_2 dwArgC8, word32 dwArgE4, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 != 0x00 && sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		struct Eq_228821 * a0_31;
		word32 a2_260;
		word32 a5_261;
		memp_malloc(a0, 0x06, a3, a4, mstatus, out a0_31, out a2_260, out a3, out a4, out a5_261);
		if (a0_31 != null)
		{
			a0_31->t0000 = a2;
			a0_31->t0004 = a2;
			Eq_2 a5_41 = 0x00;
			if (a3 != 0x00)
				a5_41 = *a3;
			*((word32) a5_41 + 8) = a0_31;
			a0_31->w000C = (word16) a4;
			word32 a0_57;
			Eq_2 a3_60;
			Eq_2 a4_61;
			struct Eq_228854 * s1_66;
			word32 s2_67;
			word32 s3_68;
			word32 s5_70;
			word32 a1_262;
			word32 a5_263;
			word32 a7_264;
			word32 s4_265;
			word32 s6_266;
			Eq_2 s0_65 = sys_mbox_trypost((word32) a0 + 16, a4, a5_41, mstatus, dwLoc2C, (word32) *((word32) a2 + 8), dwArgC8, dwArg0108, dwArg0148, out s1_66, out a0_57, out a1_262, out a3_60, out a4_61, out a5_263, out a7_264, out s2_67, out s3_68, out s4_265, out s5_70, out s6_266);
			if (a0_57 == 0x00)
			{
				<anonymous> * t1_81 = s1_66->ptr002C;
				if (t1_81 == null)
				{
					0x00 = (uint16) dwArg0128;
					return;
				}
				else
				{
					0x00 = (uint16) dwArg0128;
					t1_81();
					return;
				}
			}
			else
			{
				0x00 = (uint16) dwArg0128;
				word32 a3_267;
				word32 a4_268;
				word32 a5_269;
				netbuf_delete(ra, s0_65, a3_60, a4_61, dwArg78, mstatus, dwArg0108, out a3_267, out a4_268, out a5_269);
				return;
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	word32 s0_244;
	word32 s1_245;
	word32 a0_246;
	word32 a1_247;
	word32 a2_248;
	word32 a3_249;
	word32 a4_250;
	word32 a5_251;
	word32 a7_252;
	word32 s2_253;
	word32 s3_254;
	word32 s4_255;
	word32 s5_256;
	word32 s6_257;
	word32 s8_258;
	word32 mstatus_259;
	pbuf_free(ra, a2, a3, a4, dwArg78, mstatus, dwArg0128, out s0_244, out s1_245, out a0_246, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251, out a7_252, out s2_253, out s3_254, out s4_255, out s5_256, out s6_257, out s8_258, out mstatus_259);
}

// 23046370: Register Eq_2 setup_tcp(Register Eq_2 s0, Register out ptr32 a1Out)
// Called from:
//      lwip_netconn_do_connected
//      lwip_netconn_do_newconn
//      accept_function
//      lwip_netconn_do_connect
Eq_2 setup_tcp(Eq_2 s0, ptr32 & a1Out)
{
	tcp_arg(s0, *((word32) s0 + 4));
	tcp_recv(s0, 587491838);
	tcp_sent(s0, 0x23046994);
	tcp_poll(s0, 0x23046898, 0x02);
	tcp_err(s0, 0x2304642E);
	a1Out = 0x2304642E;
	return s0;
}

// 230463C0: void lwip_netconn_do_connected(Register word32 ra, Register Eq_2 s1, Register word32 a0, Register word32 a2, Register (ptr32 Eq_228932) a5, Register ptr32 mstatus, Stack word32 dwArg38)
void lwip_netconn_do_connected(word32 ra, Eq_2 s1, word32 a0, word32 a2, struct Eq_228932 * a5, ptr32 mstatus, word32 dwArg38)
{
	struct Eq_228935 * sp_3 = fp + ~0x0F;
	if (a0 != 0x00)
	{
		Eq_2 a0_14 = *((word32) s1 + 40);
		if (s1 != 0x00)
		{
			((word32) s1 + 4)->u1 = (byte) a2;
			a0_14 = a5->t0028;
			s1 = (word32) s1 + 0x0C;
		}
		Eq_2 a4_24 = 0x10;
		if (((word32) *a0_14 & 0x00F0) == 0x10 && a2 == 0x00)
		{
			word32 a1_225;
			setup_tcp(a0_14, out a1_225);
		}
		ui32 a5_33 = (word32) *((word32) a0_14 + 36);
		*((word32) a0_14 + 40) = 0x00;
		((word32) a0_14 + 1)->u1 = 0x00;
		*((word32) a0_14 + 36) = (byte) (a5_33 & ~0x04);
		ui32 s2_36 = a5_33 & 4;
		Eq_2 a5_37 = a5_33 & ~0x04;
		word32 s0_39 = (a5_33 & ~0x04)->dw002C;
		if ((a5_33 & ~0x04) != 0x00)
		{
			word32 s8_116;
			word32 s6_115;
			word32 s5_114;
			word32 s3_112;
			word32 s4_113;
			word32 a7_111;
			word32 a3_109;
			word32 a6_110;
			word32 t0_117;
			word32 t1_118;
			word32 t3_119;
			word32 t4_120;
			word32 t5_121;
			word32 t6_122;
			(a5_33 & ~0x04)();
		}
		if (s2_36 == 0x00)
		{
			word32 a3_228;
			word32 s1_226;
			word32 a1_227;
			word32 s4_231;
			word32 s5_232;
			word32 s3_230;
			word32 s2_229;
			word32 s8_234;
			word32 s6_233;
			sys_sem_signal(s1, a4_24, a5_37, mstatus, sp_3->t0008, sp_3->t0024, sp_3->t00A4, sp_3->t0118, sp_3->t0158, sp_3->t0198, out s1_226, out a1_227, out a3_228, out s2_229, out s3_230, out s4_231, out s5_232, out s6_233, out s8_234);
		}
	}
	0x00 = dwArg38;
}

// 2304642E: void err_tcp(Register word32 ra, Register (ptr32 Eq_229062) a0, Register (ptr32 Eq_2) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void err_tcp(word32 ra, struct Eq_229062 * a0, union Eq_2 * a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a2_557;
	word32 a4_558;
	word32 a5_559;
	sys_arch_protect(a4, mstatus, out a2_557, out a4_558, out a5_559);
	ui32 a5_26 = (word32) a0->b0024;
	word32 s2_144 = (word32) a0->b0001;
	a0->dw0004 = 0x00;
	a0->b0024 = (byte) (a5_26 | 1);
	a0->b0008 = (byte) a1;
	a0->b0001 = 0x00;
	union Eq_2 * s1_108 = a1;
	struct Eq_229113 * a5_36;
	word32 a4_35;
	Eq_2 a3_34 = sys_arch_unprotect(a3, mstatus, out a4_35, out a5_36);
	if (a5_36 != null)
		a5_36();
	Eq_2 s4_67;
	Eq_2 s3_66;
	Eq_2 s0_46 = a5_36->t002C;
	s3_66 = s3;
	s4_67 = s4;
	if (a5_36 != null)
	{
		word32 tp_285;
		word32 t5_283;
		word32 t6_284;
		word32 t0_280;
		word32 t4_282;
		word32 t1_281;
		word32 s6_279;
		word32 a7_277;
		word32 s5_278;
		a5_36();
	}
	Eq_2 s0_120 = a5_36->t002C;
	if (a5_36 != null)
	{
		word32 tp_294;
		word32 t6_293;
		word32 t5_292;
		word32 t4_291;
		word32 t1_290;
		word32 t0_289;
		word32 s6_288;
		word32 s5_287;
		word32 a7_286;
		a5_36();
	}
	ui32 a5_109 = (char *) s1_108 + 0x0F;
	Eq_2 a5_110 = a5_109 & 0x00FF;
	Eq_2 a4_111 = 0x02;
	if ((a5_109 & 0x00FF) <= 0x02)
	{
		a4_111.u0 = 587752636;
		a5_110 = ((a5_109 & 0x00FF) << 2) + 587752636;
	}
	Eq_2 s4_121 = (word32) s0_120 + 16;
	if (sys_mbox_valid(s4_121) != 0x00)
	{
		word32 s4_565;
		word32 s5_566;
		word32 s6_567;
		word32 a0_560;
		word32 a1_561;
		word32 a3_562;
		word32 a7_563;
		word32 s3_564;
		s0_120 = sys_mbox_trypost(s4_121, a4_111, a5_110, mstatus, s4, s3, dwArgD8, dwArg0118, dwArg0158, out s1_108, out a0_560, out a1_561, out a3_562, out a4_111, out a5_110, out a7_563, out s2_144, out s3_564, out s4_565, out s5_566, out s6_567);
	}
	Eq_2 s4_158 = (word32) s0_120 + 20;
	if (sys_mbox_valid(s4_158) != 0x00)
	{
		word32 a7_573;
		word32 s3_574;
		word32 s4_575;
		word32 s5_576;
		word32 s6_577;
		word32 a0_568;
		word32 a1_569;
		word32 a3_570;
		word32 a4_571;
		word32 a5_572;
		s0_120 = sys_mbox_trypost(s4_158, a4_111, a5_110, mstatus, s4, s3, dwArgD8, dwArg0118, dwArg0158, out s1_108, out a0_568, out a1_569, out a3_570, out a4_571, out a5_572, out a7_573, out s2_144, out s3_574, out s4_575, out s5_576, out s6_577);
	}
	if (s2_144 != 0x01 && (s2_144 + -3 & 0x00FF) > 0x01)
		return;
	ui32 a5_203 = (word32) *((word32) s0_120 + 36);
	*((word32) s0_120 + 36) = (byte) (a5_203 & -5);
	if ((a5_203 & 0x04) != 0x00)
		return;
	if (s2_144 == 0x04)
		s1_108 = null;
	(a5_203 & 0x04)->b0004 = (byte) s1_108;
	struct Eq_229261 * s0_229 = (a5_203 & 0x04)->ptr0028;
	Eq_2 a5_230 = *s1_108;
	Eq_2 s1_231 = (char *) s1_108 + 0x0C;
	sys_sem_valid(s1_231);
	s0_229->dw0028 = 0x00;
	word32 s5_584;
	word32 s6_585;
	word32 s8_586;
	word32 s2_581;
	word32 s3_582;
	word32 s4_583;
	word32 s1_578;
	word32 a1_579;
	word32 a3_580;
	sys_sem_signal(s1_231, 0x04, a5_230, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_578, out a1_579, out a3_580, out s2_581, out s3_582, out s4_583, out s5_584, out s6_585, out s8_586);
}

