pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23046534: Register Eq_2 lwip_netconn_do_writemore(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 Eq_229451)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack word32 dwArg0128, Register out (ptr32 Eq_229319) s0Out, Register out ptr32 s1Out, Register out Eq_2 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      poll_tcp
//      sent_tcp
//      lwip_netconn_do_write
Eq_2 lwip_netconn_do_writemore(Eq_2 ra, Eq_2 s1, struct Eq_229451 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, word32 dwArg0128, struct Eq_229319 & s0Out, ptr32 & s1Out, union Eq_2 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a4_170;
	Eq_2 a5_169;
	ptr32 s6_394;
	ptr32 s3_401;
	ptr32 s5_393;
	ptr32 s1_390;
	ui32 s3_160 = (word32) *((word32) a5 + 28);
	struct Eq_229340 * sp_277 = fp + -48;
	ui32 s4_146 = (word32) *((word32) *((word32) a5 + 40) + 36) & 2 | s3_160 & 4;
	Eq_2 a0_138 = (s3_160 & 4)->t001C;
	if ((s3_160 & 4) != 0x00)
	{
		a0_138 = sys_now(out a5_169) - a5_169;
		if (a0_138 >= a5_169)
		{
			a4_170 = *((word32) a5_169 + 24);
			goto l23046578;
		}
	}
	struct Eq_229436 * s5_147 = (struct Eq_229436 *) 0x10000000;
	s7.u0 = 0x0FFFFFFF;
	up32 s8_148 = 0x01;
	do
	{
		Eq_2 s2_100;
		struct Eq_229442 * a4_49 = *((word32) a3 + 16);
		word32 a1_53 = a1 + a3;
		struct Eq_229436 * a5_54 = *((char *) *a1 + 4) - a3;
		if (a5_54 >= s5_147)
		{
			s3_160 |= 2;
			s2_100 = s7;
		}
		else
			s2_100 = (word32) (word16) a5_54;
		Eq_2 a3_66 = (word32) *((word32) a0_138 + 100);
		if (a3_66 < s2_100)
		{
			if (s4_146 != 0x00)
			{
				if (a3_66 == 0x00)
				{
					a4_170 = a5_54->t0018;
					s1.u0 = ~0x06;
					if (a5_54 != null)
						s1.u0 = 0x00;
					goto l230465CE;
				}
			}
			else
				s3_160 |= 2;
			s2_100 = a3_66;
			goto l2304662C;
		}
		if (s2_100 == s7 && a5_54 >= s5_147)
		{
l2304663E:
			s3_160 |= 2;
			goto l23046644;
		}
l2304662C:
		if ((word32) (word16) a5_54 == s2_100 && s8_148 < (word32) a4_49->w000C)
			goto l2304663E;
l23046644:
		struct Eq_229714 * a5_154;
		ra = tcp_write(ra, s1, a0_138, a1_53, s2_100, s3_160, mstatus, s8, dwLoc17, dwArg28, dwArg48, s7, s5, dwArg68, dwArg88, dwArg98, dwArgC8, out a0_138, out a1, out a2, out a3, out a5_154, out s2_100, out s3_160, out s4_146, out s5_147, out s6, out s7, out s8_148, out mstatus);
		s1 = a0_138;
		if (a0_138 != 0x00)
		{
			a5_169 = a0_138 + 1 & 0x00FF;
			a4_170.u0 = 0x01;
			if (a5_169 > 0x01)
				goto l2304657E;
			s1.u0 = ~0x00;
			break;
		}
		word32 a5_174 = a5_154 + s2_100;
		a5_174->dw0018 = a5_154->dw0018;
		struct Eq_229741 * a4_177 = a5_174->ptr0010;
		s2_100 += a5_174;
		a4_177->t0010 = s2_100;
		struct Eq_229442 * a5_182 = *((word32) a3 + 16);
		a4_170 = a4_177->t0004;
		if (a3 == a4_170)
		{
			a5_182->w000C = (word16) ((word32) a5_182->w000C + ~0x00);
			a4_170 = (word32) a5_182->w000C;
			if (a4_170 != 0x00)
			{
				struct Eq_229773 * a5_189 = *((word32) a4_170 + 8);
				*((word32) a4_170 + 16) = a5_189;
				a5_189->dw0010 = 0x00;
				a4_170 = (word32) a4_170 + 8;
			}
		}
	} while (s6 != 0x00);
	if (s4_146 != 0x00)
	{
l230465CE:
		Eq_2 a5_211 = *((word32) *((word32) a4_170 + 24) + 20);
		if (a4_170 < a5_211)
		{
			Eq_2 s0_307 = *((word32) a5_211 + 44);
			if (a5_211 != 0x00)
			{
				word32 a3_329;
				word32 s9_333;
				word32 s10_336;
				word32 s11_337;
				a5_211();
			}
			*((word32) s0_307 + 36) = (byte) ((word32) *((word32) s0_307 + 36) | 16);
			goto l230465F0;
		}
	}
	struct Eq_229679 * a5_216 = (struct Eq_229679 *) 0x00FFFAC0;
	if ((word32) *((word32) a4_170 + 100) > 0x00FFFAC0)
	{
		a4_170 = (word32) *((word32) a4_170 + 0x0066);
		a5_216 = (struct Eq_229679 *) 0x07;
		if (a4_170 <= 0x07)
			goto l230465F0;
	}
	word32 s0_222 = a5_216->dw002C;
	if (a5_216 != null)
	{
		word32 a3_295;
		word32 s9_299;
		word32 s10_302;
		word32 s11_303;
		a5_216();
	}
l230465F0:
	if (s1 == 0x00)
	{
		Eq_2 s1_416 = 0x01;
		if (a4_170 != *((word32) (*((word32) a4_170 + 24)) + 20))
			s1_416 = (word32) (s4_146 != 0x00);
		word32 s4_957;
		word32 s8_958;
		word32 s10_960;
		word32 s11_961;
		word32 s9_959;
		word32 s2_956;
		word32 s0_952;
		word32 a3_954;
		word32 a5_955;
		word32 a2_953;
		ra = tcp_output(ra, s1_416, a0_138, a2, s7, mstatus, sp_277->t0058, sp_277->t0068, sp_277->t0088, sp_277->t0094, sp_277->t0098, sp_277->t00A8, sp_277->t00B8, sp_277->t00C8, sp_277->t00CC, sp_277->t00D8, sp_277->t00E8, sp_277->t0108, sp_277->t010C, sp_277->t0118, out s0_952, out s1_390, out a0_138, out a2_953, out a3_954, out a4_170, out a5_955, out s2_956, out s3_401, out s4_957, out s5_393, out s6_394, out s7, out s8_958, out s9_959, out s10_960, out s11_961, out mstatus);
		a5_169.u0 = ~0x03;
		if (a0_138 == ~0x03)
			goto l2304660E;
		if (s1_390 != 0x00)
		{
l2304657C:
			s1.u0 = 0x00;
			goto l2304657E;
		}
	}
	else
	{
		a5_169.u0 = ~0x00;
		if (s1 != ~0x00)
		{
l2304657E:
			struct Eq_229377 * s0_475 = *((word32) a5_169 + 40);
			Eq_2 a5_480 = *a0_138;
			((word32) a5_480 + 4)->u1 = (byte) s1;
			s0_475->dw0028 = 0x00;
			s0_475->b0001 = 0x00;
			word32 a1_947;
			word32 s2_949;
			word32 s4_950;
			word32 s8_951;
			word32 a3_948;
			sys_sem_signal((word32) a0_138 + 0x0C, a4_170, a5_480, mstatus, sp_277->t0008, sp_277->t0024, sp_277->t00A4, sp_277->t0118, sp_277->t0158, sp_277->t0198, out s1_390, out a1_947, out a3_948, out s2_949, out s3_401, out s4_950, out s5_393, out s6_394, out s8_951);
			goto l230466EE;
		}
		word32 s4_392;
		word32 s0_962;
		word32 a2_963;
		word32 s2_966;
		word32 s8_967;
		word32 s10_969;
		word32 s11_970;
		word32 s9_968;
		word32 a5_965;
		word32 a3_964;
		ra = tcp_output(ra, s1, a0_138, a2, s7, mstatus, sp_277->t0058, sp_277->t0068, sp_277->t0088, sp_277->t0094, sp_277->t0098, sp_277->t00A8, sp_277->t00B8, sp_277->t00C8, sp_277->t00CC, sp_277->t00D8, sp_277->t00E8, sp_277->t0108, sp_277->t010C, sp_277->t0118, out s0_962, out s1_390, out a0_138, out a2_963, out a3_964, out a4_170, out a5_965, out s2_966, out s3_401, out s4_392, out s5_393, out s6_394, out s7, out s8_967, out s9_968, out s10_969, out s11_970, out mstatus);
		a5_169.u0 = ~0x03;
		if (a0_138 == ~0x03)
		{
l2304660E:
			a5_169.u0 = ~0x03;
			s1.u0 = ~0x03;
			goto l2304657E;
		}
		if (s4_392 != 0x00)
		{
			a5_169 = *(union Eq_2 *) 0x14;
l23046578:
			s1.u0 = ~0x06;
			if (a5_169 == 0x00)
				goto l2304657E;
			goto l2304657C;
		}
	}
l230466EE:
	0x00 = dwArg0128;
	s0Out = s4;
	s1Out = s1_390;
	a5Out = a5_169;
	s3Out = s3_401;
	s4Out = dwArg78;
	s5Out = s5_393;
	s6Out = s6_394;
	s7Out = s7;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra;
}

