pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23046708: Register Eq_2 lwip_netconn_do_close_internal(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_229839) a5Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_229842 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      poll_tcp
//      sent_tcp
//      lwip_netconn_do_delconn
//      lwip_netconn_do_close
Eq_2 lwip_netconn_do_close_internal(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_229839 & a5Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_229842 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s4_33;
	struct Eq_229848 * sp_296 = fp + ~0x1F;
	ui32 a5_24 = (word32) *((word32) a5 + 8);
	if (a5_24 != 0x03)
	{
		if ((a5_24 & 1) != 0x00)
		{
			word32 a4_28 = (word32) *((word32) s0 + 20);
			a3.u0 = 0x01;
			if ((a4_28 + -5 & 0x00FF) <= 0x01 || a4_28 == 0x08)
				goto l2304675C;
		}
		s4_33.u0 = 0x00;
		if ((a5_24 & 2) == 0x00 || ((word32) (*((word32) s0 + 26)) & 0x10) == 0x00)
			goto l23046766;
	}
l2304675C:
	tcp_arg(s0, 0x00);
	s4_33.u0 = 0x01;
l23046766:
	struct Eq_229839 * a5_125;
	ptr32 mstatus_128;
	Eq_2 ra_129;
	Eq_2 s3_134;
	Eq_229842 s5_136;
	ptr32 s6_137;
	Eq_2 s7_138;
	Eq_2 a4_124;
	Eq_2 a3_123;
	Eq_2 s4_135;
	struct Eq_229904 * s1_130;
	word32 a0_120;
	if ((word32) *((word32) s0 + 20) == 0x01)
	{
		tcp_accept(s0, null);
		if (s4_33 == 0x00)
			goto l2304677C;
	}
	else
	{
		if ((a5_24 & 1) != 0x00)
		{
			tcp_recv(s0, 0x00);
			tcp_accept(s0, null);
		}
		if ((a5_24 & 2) != 0x00)
			tcp_sent(s0, 0x00);
		if (s4_33 == 0x00)
		{
l2304677C:
			ra_129 = tcp_shutdown(ra, s0, a5_24 & 1, a5_24 & 2, s4_33, s7, mstatus, dwLoc10, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_130, out a0_120, out a3_123, out a4_124, out a5_125, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out mstatus_128);
			goto l230467C4;
		}
		tcp_poll(s0, 0x00, 0x00);
		tcp_err(s0, 0x00);
		a2.u0 = 0x00;
	}
	word32 s10_962;
	word32 s8_960;
	word32 s2_959;
	word32 s9_961;
	word32 s11_963;
	ra_129 = tcp_close(ra, s0, a2, a3, s4_33, s7, mstatus, dwLoc10, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_130, out a0_120, out a3_123, out a4_124, out a5_125, out s2_959, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s8_960, out s9_961, out s10_962, out s11_963, out mstatus_128);
l230467C4:
	Eq_2 s1_202;
	word32 s2_192 = a0_120;
	if (a0_120 != 0x00)
	{
		a5_125 = (struct Eq_229839 *) ~0x00;
		if (a0_120 == ~0x00)
		{
			s5_136 = s1_130->t001C;
			if (s5_136 <= 0x00)
				s5_136.u0 = 0x01000388;
			struct Eq_229946 * a5_200;
			Eq_190356 a0_199 = sys_now(out a5_200);
			a5_125 = a5_200->ptr000C;
			s1_202 = a5_200->t0028;
			if (a0_199 - a5_125 < s5_136)
			{
				if (s3_134 != 0x00)
					tcp_sent(s0, 0x23046994);
				tcp_poll(s0, 0x23046898, 0x01);
				tcp_err(s0, 0x2304642E);
				tcp_arg(s0, s1_202);
l23046848:
				0x00 = (uint16) dwArgA8;
				s0Out = s1;
				s1Out = s1_202;
				a5Out = a5_125;
				s3Out = s3_134;
				s4Out = dwArg04;
				s5Out = s5_136;
				s6Out = s6_137;
				s7Out = s7_138;
				s8Out = s4;
				mstatusOut = mstatus_128;
				return ra_129;
			}
			if (s4_135 != 0x00)
			{
				word32 a0_949;
				word32 s1_948;
				word32 s2_950;
				word32 s9_951;
				word32 s10_952;
				word32 s11_953;
				ra_129 = tcp_abort(ra_129, s1_202, s0, a3_123, s3_134, s4_135, s7_138, mstatus_128, s6, s4, dwArg08, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, s1, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgB8, dwArgBC, dwArgC8, dwArgE8, out s0, out s1_948, out a0_949, out a3_123, out a4_124, out a5_125, out s2_950, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s9_951, out s10_952, out s11_953, out mstatus_128);
				s2_192 = 0x00;
			}
		}
	}
	struct Eq_229986 * s1_270 = a5_125->ptr0028;
	Eq_2 a5_272 = *s0;
	((word32) a5_272 + 4)->u1 = (byte) s2_192;
	s1_270->dw0028 = 0x00;
	s1_270->b0001 = 0x00;
	Eq_2 s0_278 = (word32) s0 + 0x0C;
	if (s2_192 == 0x00)
	{
		if (s4_135 != 0x00)
		{
			Eq_2 s1_280 = *((word32) a5_272 + 44);
			*((word32) s1_280 + 4) = 0x00;
			if (a5_272 != 0x00)
				a5_272();
		}
		if (s6_137 != 0x00)
		{
			Eq_2 s1_329 = *((word32) a5_272 + 44);
			if (a5_272 != 0x00)
				a5_272();
		}
		if (s3_134 != 0x00)
		{
			Eq_2 s1_376 = *((word32) a5_272 + 44);
			if (a5_272 != 0x00)
				a5_272();
		}
	}
	word32 a1_954;
	word32 s4_957;
	word32 a3_955;
	word32 s8_958;
	word32 s2_956;
	sys_sem_signal(s0_278, a4_124, a5_272, mstatus_128, sp_296->t0008, sp_296->t0024, sp_296->t00A4, sp_296->t0118, sp_296->t0158, sp_296->t0198, out s1_202, out a1_954, out a3_955, out s2_956, out s3_134, out s4_957, out s5_136, out s6_137, out s8_958);
	goto l23046848;
}

// 23046898: void poll_tcp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_229451)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118)
void poll_tcp(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_229451 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0118)
{
	Eq_2 a5_9 = (word32) *((word32) a0 + 1);
	Eq_2 s0_11 = a0;
	if (a5_9 == 0x01)
	{
		word32 a5_253;
		ra = lwip_netconn_do_writemore(ra, s1, a1, a2, a3, a5_9, s5, s6, s7, s8, mstatus, dwArg18, dwArg38, dwArg58, dwArg78, dwArg88, dwArgB8, dwArg0118, out s0_11, out s1, out a5_253, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	else if (a5_9 == 0x04)
	{
		word32 a5_254;
		ra = lwip_netconn_do_close_internal(ra, a0, s1, a2, a3, a5_9, s3, s4, s6, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, out s0_11, out s1, out a5_254, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	ui32 a5_84 = (word32) *((word32) s0_11 + 36);
	if ((a5_84 & 16) != 0x00)
	{
		struct Eq_230197 * s0_86 = (a5_84 & 16)->ptr0004;
		if ((a5_84 & 16) != 0x00 && (word32) (a5_84 & 16)->w0064 > 0x00FFFAC0)
		{
			up32 a3_90 = (word32) (a5_84 & 16)->w0066;
			if (a3_90 <= 0x07)
			{
				s0_86->b0024 = (byte) (a5_84 & ~0x10);
				word32 s0_94 = (a5_84 & ~0x10)->dw002C;
				if ((a5_84 & ~0x10) != 0x00)
				{
					word32 a6_123;
					word32 a7_124;
					word32 s10_125;
					word32 s11_126;
					word32 s2_127;
					word32 s9_130;
					word32 t0_131;
					word32 t1_132;
					word32 t3_133;
					word32 t4_134;
					word32 t5_135;
					word32 t6_136;
					word32 tp_137;
					(a5_84 & ~0x10)();
				}
			}
		}
	}
}

// 230468FC: void recv_raw(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148)
void recv_raw(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 == 0x00)
		return;
	if (sys_mbox_valid(a0 + 16) != 0x00)
	{
		Eq_2 a3_34;
		Eq_2 a4_35;
		ptr32 mstatus_39;
		Eq_2 s1_41;
		struct Eq_230306 * s3_43;
		Eq_2 s4_44;
		Eq_2 a0_55;
		word32 s2_263;
		word32 s5_264;
		word32 s6_265;
		Eq_2 ra_40 = pbuf_clone(ra, s0, 0x00, 640, a2, a3, a4, mstatus, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s1_41, out a0_55, out a3_34, out a4_35, out s2_263, out s3_43, out s4_44, out s5_264, out s6_265, out mstatus_39);
		if (a0_55 != 0x00)
		{
			struct Eq_230329 * a0_58;
			Eq_2 a3_61;
			Eq_2 a4_62;
			word32 a2_266;
			word32 a5_267;
			memp_malloc(s1_41, 0x06, a3_34, a4_35, mstatus_39, out a0_58, out a2_266, out a3_61, out a4_62, out a5_267);
			if (a0_58 == null)
			{
				word32 s0_275;
				word32 s1_276;
				word32 a0_277;
				word32 a1_278;
				word32 a2_279;
				word32 a3_280;
				word32 a4_281;
				word32 a5_282;
				word32 a7_283;
				word32 s2_284;
				word32 s3_285;
				word32 s4_286;
				word32 s5_287;
				word32 s6_288;
				word32 s8_289;
				word32 mstatus_290;
				pbuf_free(ra_40, a0_55, a3_61, a4_62, s4_44, mstatus_39, dwArgF8, out s0_275, out s1_276, out a0_277, out a1_278, out a2_279, out a3_280, out a4_281, out a5_282, out a7_283, out s2_284, out s3_285, out s4_286, out s5_287, out s6_288, out s8_289, out mstatus_290);
			}
			else
			{
				a0_58->t0000 = a0_55;
				a0_58->t0004 = a0_55;
				*((word32) g_t4201FED0 + 8) = a0_58;
				Eq_2 a5_72 = (word32) s3_43->b0010;
				a0_58->w000C = (word16) a5_72;
				Eq_2 a2_74 = (word32) *((word32) a0_55 + 8);
				word32 a0_77;
				Eq_2 a3_80;
				Eq_2 a4_81;
				struct Eq_230372 * a5_82;
				Eq_2 s4_89;
				word32 s1_268;
				word32 a1_269;
				word32 a7_270;
				word32 s2_271;
				word32 s3_272;
				word32 s5_273;
				word32 s6_274;
				Eq_2 s0_85 = sys_mbox_trypost(s4_44, a4_62, a5_72, mstatus_39, dwLoc2C, a2_74, dwArgC8, dwArg0108, dwArg0148, out s1_268, out a0_77, out a1_269, out a3_80, out a4_81, out a5_82, out a7_270, out s2_271, out s3_272, out s4_89, out s5_273, out s6_274);
				if (a0_77 != 0x00)
				{
					word32 a3_291;
					word32 a4_292;
					word32 a5_293;
					netbuf_delete(ra_40, s0_85, a3_80, a4_81, s4_89, mstatus_39, dwArgD8, out a3_291, out a4_292, out a5_293);
				}
				else
				{
					word32 s1_101 = a5_82->dw002C;
					if (a5_82 != null)
						a5_82();
				}
			}
		}
	}
	0x00 = dwArg0128;
}

// 23046994: void sent_tcp(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_229451)) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118)
void sent_tcp(Eq_2 ra, Eq_2 a0, struct Eq_229451 ** a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0118)
{
	if (a0 == 0x00)
		return;
	Eq_2 a5_12 = (word32) *((word32) a0 + 1);
	Eq_2 s1_16 = a2;
	if (a5_12 == 0x01)
	{
		word32 s0_291;
		ra = lwip_netconn_do_writemore(ra, a2, a1, a2, a3, a5_12, s5, s6, s7, s8, mstatus, dwArg18, dwArg38, dwArg58, dwArg78, dwArg88, dwArgB8, dwArg0118, out s0_291, out s1_16, out a5_12, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	else if (a5_12 == 0x04)
	{
		word32 s0_292;
		ra = lwip_netconn_do_close_internal(ra, a0, a2, a2, a3, a5_12, s3, s4, s6, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgE8, out s0_292, out s1_16, out a5_12, out s3, out s4, out s5, out s6, out s7, out s8, out mstatus);
	}
	struct Eq_230521 * s0_87 = *((word32) a5_12 + 4);
	if (a5_12 != 0x00)
	{
		up32 a3_88 = (word32) *((word32) a5_12 + 100);
		if (a3_88 > 0x00FFFAC0 && (word32) (*((word32) a5_12 + 0x0066)) <= 0x07)
		{
			ui32 a5_93 = (word32) s0_87->b0024;
			s0_87->b0024 = (byte) (a5_93 & ~0x10);
			word32 s0_96 = (a5_93 & ~0x10)->dw002C;
			if ((a5_93 & ~0x10) != 0x00)
			{
				word32 a5_115;
				word32 a4_116;
				word32 tp_120;
				word32 a6_126;
				word32 a7_127;
				word32 s10_128;
				word32 s11_129;
				word32 s2_130;
				word32 s9_133;
				word32 t0_134;
				word32 t1_135;
				word32 t3_136;
				word32 t4_137;
				word32 t5_138;
				word32 t6_139;
				(a5_93 & ~0x10)();
			}
		}
	}
}

// 230469FE: void recv_tcp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack Eq_2 dwArg0148)
void recv_tcp(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0128, Eq_2 dwArg0148)
{
	if (a0 != 0x00)
	{
		if (sys_mbox_valid((word32) a0 + 16) == 0x00)
		{
			if (a2 != 0x00)
			{
				word32 s3_282;
				Eq_2 a3_100;
				Eq_2 a4_101;
				ptr32 mstatus_105;
				Eq_2 s0_107;
				Eq_2 s4_113;
				word32 a5_281;
				word32 a2_280;
				word32 a0_279;
				word32 s1_278;
				word32 s7_283;
				word32 s9_284;
				word32 s10_285;
				word32 s11_286;
				word32 s0_287;
				word32 s1_288;
				word32 a0_289;
				word32 a1_290;
				word32 a2_291;
				word32 a3_292;
				word32 a4_293;
				word32 a5_294;
				word32 a7_295;
				word32 s2_296;
				word32 s3_297;
				word32 s4_298;
				word32 s5_299;
				word32 s6_300;
				word32 s8_301;
				word32 mstatus_302;
				pbuf_free(tcp_recved(ra, a0, a1, (word32) *((word32) a2 + 8), a2, a3, s7, mstatus, s2, dwArg28, dwArg38, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, out s0_107, out s1_278, out a0_279, out a2_280, out a3_100, out a4_101, out a5_281, out s3_282, out s4_113, out s7_283, out s9_284, out s10_285, out s11_286, out mstatus_105), s0_107, a3_100, a4_101, s4_113, mstatus_105, dwArgF8, out s0_287, out s1_288, out a0_289, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a7_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s8_301, out mstatus_302);
			}
			goto l23046A22;
		}
		Eq_2 a2_26;
		if (a2 != 0x00)
			a2_26 = (word32) *((word32) a2 + 8);
		else
			a2_26.u0 = 0x00;
		word32 a0_41;
		word32 a4_45;
		struct Eq_230691 * a5_46;
		word32 s1_303;
		word32 a1_304;
		word32 a3_305;
		word32 a7_306;
		word32 s2_307;
		word32 s3_308;
		word32 s4_309;
		word32 s5_310;
		word32 s6_311;
		sys_mbox_trypost((word32) a0 + 16, a4, a5, mstatus, dwLoc2C, a2_26, dwArgC8, dwArg0108, dwArg0148, out s1_303, out a0_41, out a1_304, out a3_305, out a4_45, out a5_46, out a7_306, out s2_307, out s3_308, out s4_309, out s5_310, out s6_311);
		if (a0_41 == 0x00)
		{
			word32 s1_66 = a5_46->dw002C;
			if (a5_46 == null)
			{
l23046A22:
				goto l23046A24;
			}
			a5_46();
		}
	}
l23046A24:
	0x00 = dwArg0128;
}

// 23046A78: Register Eq_2 lwip_netconn_is_err_msg(Register Eq_2 a0, Register (ptr32 byte) a1, Register out Eq_228085 a4Out, Register out Eq_2 a5Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_drain
Eq_2 lwip_netconn_is_err_msg(Eq_2 a0, byte * a1, union Eq_228085 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_10;
	word32 a5_11;
	if (a0 == 587783850)
		a5_11 = ~0x0C;
	else if (a0 == 587783852)
		a5_11 = ~0x0D;
	else
	{
		a4.u0 = 587783851;
		a5_10.u0 = 0x00;
		if (a0 != 587783851)
			goto l23046A8C;
		a5_11 = ~0x0E;
	}
	*a1 = (byte) a5_11;
	a5_10.u0 = 0x01;
l23046A8C:
	a4Out = a4;
	a5Out = a5_10;
	return a5_10;
}

// 23046AB2: void lwip_netconn_do_newconn(Register Eq_2 ra, Register (ptr32 Eq_2) s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_newconn(Eq_2 ra, union Eq_2 * s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_10 = *s1;
	((word32) a0_10 + 4)->u1 = 0x00;
	Eq_2 s0_100 = a0_10;
	Eq_2 s1_14 = *((word32) a5 + 4);
	if (a5 != 0x00)
	{
l23046B1C:
		Eq_2 a0_129 = (word32) a0_10 + 0x0C;
		word32 s6_279;
		word32 s8_280;
		word32 a3_274;
		word32 s4_277;
		word32 s5_278;
		word32 s2_275;
		word32 s3_276;
		word32 s1_272;
		word32 a1_273;
		sys_sem_signal(a0_129, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_272, out a1_273, out a3_274, out s2_275, out s3_276, out s4_277, out s5_278, out s6_279, out s8_280);
		return;
	}
	struct Eq_230794 * a5_105;
	ui32 a5_15 = (word32) *s1_14;
	if ((a5_15 & 0x00F0) != 32)
	{
		if ((a5_15 & 0x00F0) != 64)
		{
			a4.u0 = 0x10;
			if ((a5_15 & 0x00F0) != 0x10)
			{
				a5.u0 = ~0x05;
				goto l23046B60;
			}
			struct Eq_230858 * a0_70;
			word32 s1_81;
			word32 a3_268;
			word32 s4_269;
			word32 s7_270;
			tcp_new_ip_type(ra, s1_14, a3, 0x10, s3, s4, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, out s1_81, out a0_70, out a3_268, out a4, out a5_105, out s4_269, out s7_270, out mstatus);
			a0_70->dw0004 = s1_81;
			s0_100 = a0_70->t0000;
			a0_10 = a5_105->t0004;
			if (a5_105 == null)
			{
l23046B66:
				a5.u0 = ~0x00;
l23046B60:
				*((word32) s0_100 + 4) = (byte) a5;
				goto l23046B1C;
			}
			word32 a1_271;
			a0_10 = setup_tcp(s0_100, out a1_271);
		}
		else
		{
			union Eq_2 * a2_50;
			*((word16) a0_10.u0 + 4) = raw_new_ip_type(ra, (word32) *((word16) a0_10.u0 + 8), a3, 64, mstatus, out a0_10, out a2_50, out a4, out a5_105);
			s0_100 = *a2_50;
			Eq_2 a2_61 = *((word16) a0_10.u0 + 4);
			if (a0_10 == 0x00)
				goto l23046B66;
			raw_recv(a0_10, &g_t230468FC, a2_61);
		}
	}
	else
	{
		union Eq_2 * a4_24;
		Eq_2 s1_27;
		word32 a3_267;
		udp_new_ip_type(ra, s1_14, a3, 32, mstatus, out s1_27, out a3_267, out a4_24, out a5_105);
		*(union Eq_2 *) 4 = s1_27;
		a0_10.u0 = 0x00;
		s0_100 = *a4_24;
		a4 = a5_105->t0004;
		if (a5_105 == null)
			goto l23046B66;
		a4.u0 = 0x0022;
		if ((word32) *a4.u0 == 0x0022)
		{
			a5_105->b0010 = 0x01;
			a4.u0 = 0x01;
		}
		udp_recv(0x00, &g_t230462BA, *(union Eq_2 *) 0x04);
	}
	s0_100 = a5_105->t0000;
	a5 = a5_105->t0004;
	if (a5 != 0x00)
		goto l23046B1C;
	goto l23046B66;
}

