pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23046B6A: Register Eq_2 netconn_alloc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out)
// Called from:
//      netconn_new_with_proto_and_callback
//      accept_function
Eq_2 netconn_alloc(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg38, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	Eq_2 s2_16 = a1;
	Eq_2 a0_20;
	word32 a2_200;
	Eq_2 a4_110;
	ptr32 a5_112;
	Eq_2 a3_111;
	Eq_2 s1_25 = memp_malloc(a0, 0x07, a3, a4, mstatus, out a0_20, out a2_200, out a3_111, out a4_110, out a5_112);
	Eq_2 s0_119 = a0_20;
	if (a0_20 == 0x00)
	{
l23046BFE:
		0x00 = dwArg38;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3_111;
		a4Out = a4_110;
		a5Out = a5_112;
		s2Out = s2_16;
		s3Out = s3;
		return s0_119;
	}
	((word32) a0_20 + 8)->u1 = 0x00;
	a0_20->u1 = (byte) s1_25;
	*((word32) a0_20 + 4) = 0x00;
	Eq_2 a5_31 = 32;
	if ((s1_25 & 0x00F0) != 32)
	{
		a5_31.u0 = 64;
		if ((s1_25 & 0x00F0) == 64)
		{
l23046BAC:
			word32 a0_55;
			Eq_2 a5_60;
			word32 a2_210;
			word32 s4_211;
			sys_mbox_new(ra, a3_111, a4_110, a5_31, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a0_55, out a2_210, out a3_111, out a4_110, out a5_60, out s2_16, out s3, out s4_211);
			if (a0_55 != 0x00)
			{
l23046BCA:
				word32 a0_201;
				word32 a2_202;
				memp_free(0x07, a0_20, a3_111, a4_110, mstatus, out a0_201, out a2_202, out a3_111, out a4_110, out a5_112);
				a1 = a0_20;
				s0_119.u0 = 0x00;
				goto l23046BFE;
			}
			word32 a0_71;
			word32 a2_203;
			word32 a5_204;
			word32 s4_205;
			Eq_2 s1_78 = sys_sem_new(ra, a3_111, a4_110, a5_60, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_71, out a1, out a2_203, out a3_111, out a4_110, out a5_204, out s2_16, out s3, out s4_205);
			if (a0_71 != 0x00)
			{
				word32 a0_206;
				word32 a2_207;
				word32 a5_208;
				word32 s4_209;
				sys_mbox_free(s1_78, a3_111, a4_110, mstatus, dwArg0138, dwArg0178, out a0_206, out a2_207, out a3_111, out a4_110, out a5_208, out s4_209);
				goto l23046BCA;
			}
			sys_mbox_set_invalid((word32) a0_20 + 20);
			((word32) a0_20 + 1)->u1 = 0x00;
			*(union Eq_2 *) 0x17 = a0_20;
			*((word32) a0_20 + 44) = s2_16;
			*((word32) a0_20 + 40) = 0x00;
			*((word32) a0_20 + 28) = 0x00;
			*((word32) a0_20 + 32) = 0x00;
			((word32) a0_20 + 36)->u1 = 0x00;
			a5_112 = ~0x00;
			goto l23046BFE;
		}
		a5_31.u0 = 0x10;
		if ((s1_25 & 0x00F0) != 0x10)
			goto l23046BCA;
	}
	goto l23046BAC;
}

// 23046C0C: Register Eq_2 netconn_free(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      free_socket
//      netconn_drain
//      accept_function
Eq_2 netconn_free(Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a4Out, ptr32 & a5Out)
{
	sys_mbox_valid((word32) a0 + 16);
	sys_mbox_valid((word32) a0 + 20);
	Eq_2 a3_23;
	Eq_2 a4_24;
	word32 * s1_28;
	word32 a1_55;
	word32 a2_56;
	word32 a5_57;
	word32 s4_58;
	Eq_2 s0_27 = sys_sem_free((word32) a0 + 0x0C, a3, mstatus, dwArg0148, dwArg0188, out s1_28, out a1_55, out a2_56, out a3_23, out a4_24, out a5_57, out s4_58);
	sys_sem_set_invalid(s1_28);
	ptr32 a5_39;
	Eq_2 a3_42;
	ptr32 a4_43;
	word32 a0_59;
	word32 a2_60;
	memp_free(0x07, s0_27, a3_23, a4_24, mstatus, out a0_59, out a2_60, out a3_42, out a4_43, out a5_39);
	a4Out = a4_43;
	a5Out = a5_39;
	return a3_42;
}

// 23046C44: Register Eq_2 netconn_drain(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_231158 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netconn_drain
//      lwip_netconn_do_delconn
//      lwip_netconn_do_close
Eq_2 netconn_drain(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_231158 & s3Out, ptr32 & s4Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_101 = (word32) a0 + 16;
	Eq_2 s0_10 = a0;
	if (sys_mbox_valid((word32) a0 + 16) != 0x00)
	{
		while (true)
		{
			Eq_2 a0_30;
			Eq_2 a4_34;
			Eq_2 s2_40;
			Eq_2 s4_42;
			word32 a1_515;
			s0_10 = sys_arch_mbox_tryfetch(s1_101, fp + -36, a3, a4, a5, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_101, out a0_30, out a1_515, out a3, out a4_34, out s2_40, out s3, out s4_42);
			if (a0_30 == s2_40)
				break;
			if (((word32) *s0_10 & 0x00F0) == s3)
			{
				Eq_2 a0_64 = lwip_netconn_is_err_msg(a0_30, fp + -37, out a4, out a5);
				if (a0_64 == 0x00)
				{
					word32 s3_522;
					word32 a1_518;
					word32 s5_524;
					word32 s8_525;
					word32 s4_523;
					word32 a7_520;
					word32 s2_521;
					word32 a2_519;
					word32 s0_516;
					word32 a0_517;
					ra = pbuf_free(ra, a0_64, a3, a4, s4_42, mstatus, dwArgF8, out s0_516, out s1_101, out a0_517, out a1_518, out a2_519, out a3, out a4, out a5, out a7_520, out s2_521, out s3_522, out s4_523, out s5_524, out s6, out s8_525, out mstatus);
				}
			}
			else
				s1_101 = netbuf_delete(ra, a0_30, a3, a4_34, s4_42, mstatus, dwArgD8, out a3, out a4, out a5);
		}
		word32 a2_510;
		word32 a0_509;
		s1_101 = sys_mbox_free(s1_101, a3, a4_34, mstatus, dwArg0118, dwArg0158, out a0_509, out a2_510, out a3, out a4, out a5, out s4);
		sys_mbox_set_invalid(s1_101);
	}
	Eq_2 s0_107 = (word32) s0_10 + 20;
	Eq_2 a0_109 = sys_mbox_valid(s0_107);
	if (a0_109 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_120;
			Eq_2 a4_124;
			Eq_2 s1_129;
			Eq_2 s2_130;
			word32 s4_512;
			word32 a1_511;
			s0_107 = sys_arch_mbox_tryfetch(s0_107, fp + -36, a3, a4, a5, mstatus, dwLoc2C, dwArg54, dwArgC8, dwArg0108, out s1_129, out a0_120, out a1_511, out a3, out a4_124, out s2_130, out s3, out s4_512);
			if (a0_120 == s2_130)
				break;
			if (lwip_netconn_is_err_msg(a0_120, fp + -37, out a4, out a5) == 0x00)
			{
				Eq_2 a3_180;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg8 = <invalid>;
				Eq_2 stackArg24 = <invalid>;
				Eq_2 stackArg40 = <invalid>;
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg84 = <invalid>;
				Eq_2 stackArg88 = <invalid>;
				Eq_2 stackArg104 = <invalid>;
				Eq_2 stackArg108 = <invalid>;
				Eq_2 stackArg120 = <invalid>;
				Eq_2 stackArg136 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				Eq_2 stackArg172 = <invalid>;
				Eq_2 stackArg184 = <invalid>;
				Eq_2 stackArg200 = <invalid>;
				Eq_2 stackArg216 = <invalid>;
				Eq_2 a0_151;
				Eq_2 s3_155;
				Eq_2 a5_160;
				ptr32 mstatus_161;
				Eq_2 a4_162;
				Eq_2 a3_163;
				Eq_2 s4_166;
				word32 s7_542;
				word32 s1_541;
				ra = netconn_drain(ra, s1_129, a3_163, a4_162, a5_160, s7, mstatus_161, stackArg8, stackArg24, stackArg40, dwArg14, stackArg72, stackArg84, stackArg88, stackArg104, stackArg108, stackArg120, stackArg136, stackArg168, stackArg172, stackArg184, stackArg200, stackArg216, dwArgC8, dwArgD8, dwArg0118, dwArgF8, dwArg0158, out s0_107, out s1_541, out a0_151, out a3_163, out a4_162, out a5_160, out s3_155, out s4_166, out s6, out s7_542, out mstatus_161);
				Eq_2 s1_175 = *((word32) a0_151 + 4);
				mstatus = mstatus_161;
				a3_180 = a3_163;
				if (a0_151 != 0x00)
				{
					word32 s9_550;
					word32 s2_546;
					word32 s11_552;
					word32 s10_551;
					word32 s4_548;
					word32 s5_549;
					word32 s3_547;
					word32 a4_544;
					word32 a5_545;
					word32 a0_543;
					ra = tcp_abort(ra, s1_175, a0_151, a3_163, s3_155, s4_166, s7, mstatus_161, dwLoc30, dwLoc2C, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArgA8, dwArgAC, dwArgB8, dwArgD8, out s0_107, out s1_175, out a0_543, out a3_180, out a4_544, out a5_545, out s2_546, out s3_547, out s4_548, out s5_549, out s6, out s7, out s9_550, out s10_551, out s11_552, out mstatus);
					*((word32) s1_175 + 4) = 0x00;
				}
				a3 = netconn_free(s1_175, a3_180, mstatus, dwArg0118, dwArg0158, out a4, out a5);
			}
		}
		word32 a2_514;
		word32 a0_513;
		s1_101 = sys_mbox_free(s0_107, a3, a4_124, mstatus, dwArg0118, dwArg0158, out a0_513, out a2_514, out a3, out a4, out a5, out s4);
		sys_mbox_set_invalid(s0_107);
		a0_109 = s0_107;
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_101;
	a0Out = a0_109;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s3Out = s3;
	s4Out = s4;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 23046CF8: void accept_function(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_231391) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack word32 dwArg18, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void accept_function(Eq_2 ra, word32 a0, struct Eq_231391 * a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, word32 dwArg18, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	if (a0 == 0x00 || sys_mbox_valid(a0 + 20) == 0x00)
		return;
	if (a1 != null)
	{
		Eq_2 a3_117;
		Eq_2 a4_118;
		word32 s3_125;
		word32 s2_137;
		word32 s1_123;
		struct Eq_231418 * a5_119;
		Eq_2 s0_21 = a1->t002C;
		Eq_2 a4_28;
		Eq_2 a5_29;
		Eq_2 s2_31;
		word32 s3_36;
		word32 a1_339;
		word32 a3_341;
		word32 a2_340;
		Eq_2 a0_33 = netconn_alloc(ra, (word32) *s0_21, a3, a4, mstatus, dwLoc20, dwLoc1C, dwArg18, s3, dwArgD8, dwArg0118, dwArg0158, out a1_339, out a2_340, out a3_341, out a4_28, out a5_29, out s2_31, out s3_36);
		if (a0_33 == 0x00)
		{
			word32 a0_114;
			word32 a1_358;
			word32 a7_359;
			word32 s2_360;
			word32 s4_361;
			word32 s5_362;
			word32 s6_363;
			sys_mbox_trypost(s2_31, a4_28, a5_29, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_123, out a0_114, out a1_358, out a3_117, out a4_118, out a5_119, out a7_359, out s2_360, out s3_125, out s4_361, out s5_362, out s6_363);
			s2_137 = ~0x00;
			if (a0_114 != 0x00)
				return;
		}
		else
		{
			*((word32) a0_33 + 4) = s3_36;
			word32 a1_351;
			setup_tcp(s0_21, out a1_351);
			word32 a0_47;
			word32 a1_352;
			word32 a7_353;
			word32 s2_354;
			word32 s4_355;
			word32 s5_356;
			word32 s6_357;
			Eq_2 s0_55 = sys_mbox_trypost(s2_31, a4_28, a5_29, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_123, out a0_47, out a1_352, out a3_117, out a4_118, out a5_119, out a7_353, out s2_354, out s3_125, out s4_355, out s5_356, out s6_357);
			s2_137 = a0_47;
			if (a0_47 != 0x00)
			{
				struct Eq_231554 * s1_71 = *((word32) s0_55 + 4);
				tcp_arg(s0_55, 0x00);
				tcp_recv(s0_55, 0x00);
				tcp_sent(s0_55, 0x00);
				tcp_poll(s0_55, 0x00, 0x00);
				tcp_err(s0_55, 0x00);
				s1_71->dw0004 = 0x00;
				Eq_2 a3_90;
				word32 a0_364;
				word32 a2_365;
				word32 a4_366;
				word32 a5_367;
				word32 s4_368;
				Eq_2 s1_94 = sys_mbox_free(&s1_71->dw0004 + 3, a3_117, a4_118, mstatus, dwArg0128, dwArg0168, out a0_364, out a2_365, out a3_90, out a4_366, out a5_367, out s4_368);
				sys_mbox_set_invalid(&s1_71->dw0004 + 3);
				word32 a4_369;
				word32 a5_370;
				netconn_free(s1_94, a3_90, mstatus, dwArg0128, dwArg0168, out a4_369, out a5_370);
				return;
			}
		}
		word32 s0_140 = a5_119->dw002C;
		if (a5_119 != null)
		{
			word32 a5_165;
			word32 tp_169;
			word32 a7_170;
			word32 s5_171;
			word32 s6_172;
			word32 t0_173;
			word32 t1_174;
			word32 t4_175;
			word32 t5_176;
			word32 t6_177;
			a5_119();
		}
	}
	else
	{
		word32 a0_182;
		word32 a4_186;
		struct Eq_231450 * a5_187;
		word32 s6_350;
		word32 s4_348;
		word32 s5_349;
		word32 a7_345;
		word32 s3_347;
		word32 s2_346;
		word32 s1_342;
		word32 a3_344;
		word32 a1_343;
		sys_mbox_trypost(a0 + 20, a4, a5, mstatus, dwLoc1C, s3, dwArgD8, dwArg0118, dwArg0158, out s1_342, out a0_182, out a1_343, out a3_344, out a4_186, out a5_187, out a7_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350);
		if (a0_182 == 0x00)
		{
			word32 s0_205 = a5_187->dw002C;
			if (a5_187 != null)
				a5_187();
		}
	}
}

// 23046DD6: void lwip_netconn_do_delconn(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_231606) a0, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_delconn(Eq_2 ra, Eq_2 s0, struct Eq_231606 * a0, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_110;
	Eq_2 a0_10 = a0->t0000;
	Eq_2 a5_11 = (word32) *((word32) a0_10 + 1);
	Eq_2 a4_111 = a5_11 & 0x00FD;
	if ((a5_11 & 0x00FD) != 0x00)
	{
		a4_111.u0 = 0x03;
		if (a5_11 != 0x03)
		{
l23046DF8:
			a0->b0004 = ~0x04;
			a5_110.u0 = ~0x04;
			goto l23046DFE;
		}
		ui32 a5_14 = (word32) *((word32) a0_10 + 36);
		a5_11 = a5_14 & 0x04;
		if ((a5_14 & 0x04) == 0x00)
			goto l23046DF8;
	}
	a0->b0004 = 0x00;
	struct Eq_231688 ** a4_33;
	Eq_2 s1_40;
	Eq_2 s3_44;
	Eq_2 s4_45;
	Eq_2 s6_47;
	word32 s0_620;
	Eq_2 a0_29;
	word32 a3_100;
	Eq_2 s7_116;
	Eq_2 ra_108 = netconn_drain(ra, a0_10, a3, a4_111, a5_11, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0148, out s0_620, out s1_40, out a0_29, out a3_100, out a4_33, out a5_110, out s3_44, out s4_45, out s6_47, out s7_116, out mstatus);
	struct Eq_231688 * s0_58 = *a4_33;
	a4_111 = *((word32) a0_29 + 4);
	if (a0_29 != 0x00)
	{
		ui32 a5_60 = (word32) *a4_111.u0;
		a5_110 = a5_60 & 0x00F0;
		if ((a5_60 & 0x00F0) != 32)
		{
			if ((a5_60 & 0x00F0) != 64)
			{
				a3_100 = 0x10;
				if ((a5_60 & 0x00F0) == 0x10)
				{
					((word16) a4_111.u0 + 1)->u1 = 0x04;
					s0_58->b0008 = 0x03;
					*((word32) *(union Eq_2 *) 0x03 + 40) = 0x03;
					word32 mstatus_641;
					word32 s8_640;
					word32 a5_634;
					word32 s7_639;
					word32 s4_636;
					word32 s3_635;
					word32 s6_638;
					word32 s5_637;
					word32 s1_633;
					word32 s0_632;
					lwip_netconn_do_close_internal(ra_108, s0, s1_40, dwArg10, 0x10, 0x03, s3_44, s4_45, s6_47, s7_116, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s0_632, out s1_633, out a5_634, out s3_635, out s4_636, out s5_637, out s6_638, out s7_639, out s8_640, out mstatus_641);
					return;
				}
			}
			else
			{
				word32 a2_631;
				a0_29 = raw_remove(a0_29, 64, a5_60 & 0x00F0, mstatus, out a2_631, out a3_100, out a4_111, out a5_110);
			}
		}
		else
		{
			((word32) a0_29 + 36)->u0 = 0x00;
			word32 a2_630;
			udp_remove(a0_29, 32, mstatus, out a0_29, out a2_630, out a3_100, out a4_111, out a5_110);
		}
		*((word16) a5_110.u0 + 4) = 0x00;
	}
	word32 s0_91 = *a0_29;
	Eq_2 a0_109 = *((word16) a5_110.u0 + 44);
	if (a5_110 != 0x00)
	{
		word32 a6_117;
		word32 a7_118;
		word32 s1_119;
		word32 s10_120;
		word32 s11_121;
		word32 s2_122;
		word32 s3_123;
		word32 s4_124;
		word32 s5_125;
		word32 s6_126;
		word32 s8_127;
		word32 s9_128;
		word32 t0_129;
		word32 t1_130;
		word32 t3_131;
		word32 t4_132;
		word32 t5_133;
		word32 t6_134;
		word32 tp_135;
		a5_110();
	}
	word32 s0_138 = *a0_109;
	a0_10 = *((word16) a5_110.u0 + 44);
	if (a5_110 != 0x00)
	{
		word32 a6_159;
		word32 a7_160;
		word32 s1_161;
		word32 s10_162;
		word32 s11_163;
		word32 s2_164;
		word32 s3_165;
		word32 s4_166;
		word32 s5_167;
		word32 s6_168;
		word32 s8_169;
		word32 s9_170;
		word32 t0_171;
		word32 t1_172;
		word32 t3_173;
		word32 t4_174;
		word32 t5_175;
		word32 t6_176;
		word32 tp_177;
		a5_110();
	}
l23046DFE:
	word32 a0_225 = sys_sem_valid((word32) a0_10 + 0x0C);
	if (a0_225 == 0x00)
		return;
	word32 s6_628;
	word32 s8_629;
	word32 a1_622;
	word32 s5_627;
	word32 a3_623;
	word32 s2_624;
	word32 s4_626;
	word32 s3_625;
	word32 s1_621;
	sys_sem_signal(a0_225 + 0x0C, a4_111, a5_110, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_621, out a1_622, out a3_623, out s2_624, out s3_625, out s4_626, out s5_627, out s6_628, out s8_629);
}

// 23046E98: void lwip_netconn_do_bind(Register Eq_2 s1, Register Eq_2 a1, Register (ptr32 Eq_2) a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_bind(Eq_2 s1, Eq_2 a1, union Eq_2 * a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_19 = *a4;
	Eq_2 a5_11 = ~0x05;
	Eq_2 a4_12 = *((word32) a0_19 + 4);
	if (a0_19 != 0x00)
	{
		ui32 a5_13 = (word32) *a4_12;
		if ((a5_13 & 0x00F0) != 32)
		{
			a4_12.u0 = 64;
			if ((a5_13 & 0x00F0) != 64)
			{
				a4_12.u0 = 0x10;
				if ((a5_13 & 0x00F0) != 0x10)
				{
					a5_11.u0 = ~0x05;
					goto l23046EC8;
				}
				a0_19 = tcp_bind(s1, a0_19, a1, (word32) *((word32) a0_19 + 0x0C), a5_13 & 0x00F0, mstatus, dwArg14, dwArg34, out a4_12);
			}
			else
				a0_19 = raw_bind(a0_19, a1);
		}
		else
		{
			word32 a3_119;
			word32 a5_120;
			a0_19 = udp_bind(a0_19, a1, (word32) *((word32) a0_19 + 0x0C), out a3_119, out a4_12, out a5_120);
		}
		a5_11 = a0_19;
	}
l23046EC8:
	((word32) *a0_19 + 4)->u1 = (byte) a5_11;
	Eq_2 a0_63 = (word32) a0_19 + 0x0C;
	word32 s8_129;
	word32 s5_127;
	word32 s6_128;
	word32 s3_125;
	word32 s4_126;
	word32 a3_123;
	word32 s2_124;
	word32 s1_121;
	word32 a1_122;
	sys_sem_signal(a0_63, a4_12, a5_11, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_121, out a1_122, out a3_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s8_129);
}

