pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23046EFC: void lwip_netconn_do_connect(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_196095) a1, Register (ptr32 Eq_2) a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_connect(Eq_2 ra, Eq_2 s0, struct Eq_196095 * a1, union Eq_2 * a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_100;
	Eq_2 a0_11 = *a4;
	Eq_2 s0_104 = a0_11;
	Eq_2 a4_101 = *((word32) a0_11 + 4);
	if (a0_11 != 0x00)
	{
		ui32 a5_15 = (word32) *a4_101;
		a5 = a5_15 & 0x00F0;
		if ((a5_15 & 0x00F0) != 32)
		{
			if ((a5_15 & 0x00F0) != 64)
			{
				a0_100.u0 = ~0x05;
				if ((a5_15 & 0x00F0) == 0x10)
				{
					a5 = (word32) *((word32) a4_101 + 1);
					if (a5 != 0x03)
					{
						a0_100.u0 = ~0x09;
						if (a5 == 0x00)
						{
							word32 a1_46;
							word32 s1_60;
							s0_104 = tcp_connect(ra, 0x03, setup_tcp(a0_11, out a1_46), a1_46, (word32) *((word32) *a5 + 0x0C), 0x230463C0, s7, mstatus, s0, dwArg14, dwArg28, dwArg38, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s1_60, out a0_100, out a4_101, out a5, out mstatus);
							if (a0_100 == 0x00)
							{
								ui32 a4_86 = (word32) *((word32) a5 + 36);
								((word32) a5 + 1)->u1 = (byte) s1_60;
								s0_104 = *a5;
								if ((a4_86 & 0x02) == 0x00)
								{
									*((word32) a5 + 36) = (byte) ((word32) *((word32) a5 + 36) & ~0x04);
									*((word32) *a5 + 40) = a5;
									return;
								}
								ui32 a4_99 = (word32) *((word32) a5 + 36);
								*((word32) a5 + 36) = (byte) (a4_99 | 4);
								a0_100.u0 = ~0x04;
								a4_101 = a4_99 | 4;
							}
						}
					}
					else
						a0_100.u0 = ~0x08;
				}
			}
			else
			{
				s0_104 = a1->t0008;
				a0_100 = raw_connect(a0_11, a1, a4_101, out a4_101, out a5);
			}
		}
		else
		{
			s0_104 = a1->t0008;
			word32 s2_213;
			a0_100 = udp_connect(a0_11, a1, (word32) *((word32) a0_11 + 0x0C), dwArg28, out a4_101, out a5, out s2_213);
		}
	}
	else
		a0_100.u0 = ~0x0E;
	((word32) s0_104 + 4)->u1 = (byte) a0_100;
	Eq_2 a0_111 = (word16) a0_100.u0 + 0x0C;
	word32 s1_214;
	word32 a1_215;
	word32 a3_216;
	word32 s2_217;
	word32 s3_218;
	word32 s4_219;
	word32 s5_220;
	word32 s6_221;
	word32 s8_222;
	sys_sem_signal(a0_111, a4_101, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_214, out a1_215, out a3_216, out s2_217, out s3_218, out s4_219, out s5_220, out s6_221, out s8_222);
}

// 23046FBE: void lwip_netconn_do_disconnect(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_disconnect(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_14;
	Eq_226724 a0_9 = *a4;
	if (((word32) *a4 & 0x00F0) == 32)
	{
		a4 = *((word32) a0_9 + 4);
		a5_14 = udp_disconnect(a0_9);
		((word32) a0_9 + 4)->u0 = 0x00;
	}
	else
	{
		((word32) a0_9 + 4)->u0 = ~0x05;
		a5_14.u0 = ~0x05;
	}
	word32 s6_78;
	word32 s5_77;
	word32 s4_76;
	word32 s3_75;
	word32 s2_74;
	word32 a3_73;
	word32 a1_72;
	word32 s1_71;
	word32 s8_79;
	sys_sem_signal((word32) a0_9 + 0x0C, a4, a5_14, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_71, out a1_72, out a3_73, out s2_74, out s3_75, out s4_76, out s5_77, out s6_78, out s8_79);
}

// 23046FF8: void lwip_netconn_do_listen(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 a4, Register (ptr32 Eq_2) a5, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void lwip_netconn_do_listen(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 a4, union Eq_2 * a5, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 a5_146;
	Eq_2 a0_100 = *a5;
	byte bLoc11_197 = SLICE(s0, byte, 24);
	Eq_2 a5_13 = *((word32) a0_100 + 4);
	if (a0_100 != 0x00)
	{
		ui32 a4_14 = (word32) *a5_13;
		a4 = a4_14 & 0x00F0;
		if ((a4_14 & 0x00F0) != 0x10)
		{
			a5_146 = ~0x0F;
			goto l23047024;
		}
		word32 a5_18 = (word32) *((word32) a5_13 + 1);
		if (a5_18 == 0x00)
		{
			if ((word32) *((word32) a0_100 + 20) == 0x00)
			{
				Eq_2 a5_28;
				Eq_2 a3_32;
				Eq_2 a2_27;
				a0_100 = tcp_listen_with_backlog_and_err(s1, a0_100, fp + ~0x10, 0x10, a4_14 & 0x00F0, mstatus, dwArg14, dwArg18, out a2_27, out a3_32, out a4, out a5_28);
				Eq_2 s1_34 = a0_100;
				if (a0_100 != 0x00)
				{
					Eq_2 a0_37 = sys_mbox_valid((word32) a0_100 + 16);
					if (a0_37 != 0x00)
					{
						word32 a0_40;
						s1_34 = sys_mbox_free((word32) a0_37 + 16, a3_32, a4, mstatus, dwArg0128, dwArg0168, out a0_40, out a2_27, out a3_32, out a4, out a5_28, out s4);
						sys_mbox_set_invalid(a0_40 + 0x10);
						a0_37 = a0_40 + 0x10;
					}
					bLoc11_197 = 0x00;
					a0_100 = sys_mbox_valid((word32) a0_37 + 20);
					if (a0_100 == 0x00)
					{
						word32 a4_350;
						word32 s2_352;
						word32 a5_351;
						word32 s3_353;
						s1_34 = sys_mbox_new(ra, a3_32, a4, a5_28, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_100, out a2_27, out a3_32, out a4_350, out a5_351, out s2_352, out s3_353, out s4);
						bLoc11_197 = (byte) a0_100;
					}
					Eq_2 a5_85 = (int32) bLoc11_197;
					if (a5_85 == 0x00)
					{
						((word32) a5_85 + 1)->u1 = 0x02;
						*((word32) s1_34 + 4) = a5_85;
						tcp_arg(a0_100, *((word32) a0_100 + 4));
						a4 = tcp_accept(a0_100, &g_t23046CF8);
					}
					else
					{
						struct Eq_232398 * a5_105;
						word32 s9_363;
						word32 s10_364;
						word32 s11_365;
						word32 s4_358;
						word32 s7_361;
						word32 s8_362;
						word32 s5_359;
						word32 s6_360;
						word32 s3_357;
						word32 s1_354;
						word32 a3_355;
						word32 s2_356;
						tcp_close(ra, s1_34, a2_27, a3_32, s4, s7, mstatus, dwLoc10, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, dwArg64, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_354, out a0_100, out a3_355, out a4, out a5_105, out s2_356, out s3_357, out s4_358, out s5_359, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365, out mstatus);
						a5_105->dw0004 = 0x00;
					}
				}
				goto l2304709C;
			}
			a5_146 = ~0x05;
l23047024:
			bLoc11_197 = (byte) a5_146;
			goto l2304709C;
		}
		a4.u0 = 0x02;
		if (a5_18 == 0x02)
		{
			bLoc11_197 = 0x00;
l2304709C:
			Eq_2 a5_153 = (word32) bLoc11_197;
			((word32) *a0_100 + 4)->u1 = (byte) a5_153;
			word32 a1_342;
			word32 s2_344;
			word32 s1_341;
			word32 a3_343;
			word32 s3_345;
			word32 s4_346;
			word32 s8_349;
			word32 s5_347;
			word32 s6_348;
			sys_sem_signal((word32) a0_100 + 0x0C, a4, a5_153, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_341, out a1_342, out a3_343, out s2_344, out s3_345, out s4_346, out s5_347, out s6_348, out s8_349);
			return;
		}
	}
	a5_146 = ~0x0A;
	goto l23047024;
}

// 230470D8: void lwip_netconn_do_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a3_287;
	word32 a2_286;
	word32 a0_113;
	Eq_2 a4_103;
	Eq_2 a5_118;
	netconn_err(*a0, a3, a4, mstatus, out a0_113, out a2_286, out a3_287, out a4_103, out a5_118);
	Eq_2 s0_123 = a0;
	if (a0_113 == 0x00)
	{
		s0_123 = *a5_118;
		a0_113 = ~0x0A;
		Eq_2 a7_23 = *((word32) a5_118 + 4);
		if (a7_23 == 0x00)
			goto l23047120;
		ui32 a5_24 = (word32) *a5_118;
		a5_118 = a5_24 & 0x00F0;
		if ((a5_24 & 0x00F0) != 32)
		{
			a4_103.u0 = 64;
			if ((a5_24 & 0x00F0) != 64)
				goto l23047120;
			Eq_2 a2_106 = (a5_24 & 0x00F0) + 8;
			Eq_2 a5_108 = *a1;
			if (a2_106 == 0x00)
			{
l2304711C:
				s0_123 = raw_send(ra, a7_23, a1, a5_108, s4, s5, s6, s7, mstatus, s0, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out a0_113, out a4_103, out a5_118, out mstatus);
				goto l23047120;
			}
			a5_108 = *((word32) a5_108 + 8);
			if (a5_108 == 0x00)
				goto l2304711C;
			word32 a3_288;
			word32 s4_290;
			word32 s2_289;
			raw_sendto(ra, a7_23, a1, a2_106, a5_108, s4, s5, s6, s7, mstatus, s0, dwArg14, dwArg28, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_123, out a0_113, out a3_288, out a4_103, out a5_118, out s2_289, out s4_290, out mstatus);
		}
		else
		{
			struct Eq_232526 * a6_27 = *((word32) s0_123 + 8);
			ui32 a4_28 = (word32) a6_27->b000E;
			Eq_2 a1_30 = a6_27->t0000;
			struct Eq_226340 * a5_32 = (word32) a6_27->w0010;
			if (a6_27 != (struct Eq_232526 *) 0x08 && a6_27->dw0008 != 0x00)
			{
				word32 s9_305;
				word32 s5_304;
				word32 s3_302;
				word32 s4_303;
				word32 a3_301;
				word32 s1_300;
				udp_sendto_chksum(ra, a7_23, a1_30, &a6_27->dw0008, (word32) a6_27->w000C, a4_28 & 0x02, a5_32, s4, mstatus, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_123, out s1_300, out a0_113, out a3_301, out a4_103, out a5_118, out s3_302, out s4_303, out s5_304, out s9_305, out mstatus);
			}
			else
				s0_123 = udp_send_chksum(ra, a7_23, a1_30, a4_28 & 0x02, a5_32, s4, mstatus, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out a0_113, out a4_103, out a5_118, out mstatus);
		}
	}
l23047120:
	((word32) s0_123 + 4)->u1 = (byte) a0_113;
	Eq_2 a0_185 = a0_113 + 0x0C;
	word32 s8_299;
	word32 s4_296;
	word32 s6_298;
	word32 s5_297;
	word32 s2_294;
	word32 s3_295;
	word32 s1_291;
	word32 a3_293;
	word32 a1_292;
	sys_sem_signal(a0_185, a4_103, a5_118, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_291, out a1_292, out a3_293, out s2_294, out s3_295, out s4_296, out s5_297, out s6_298, out s8_299);
}

// 2304716E: void lwip_netconn_do_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_2) a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_recv(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a3, Eq_2 a4, union Eq_2 * a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_17 = *a5;
	((word32) a0_17 + 4)->u1 = 0x00;
	Eq_2 a5_102 = *((word32) a4 + 4);
	if (a4 != 0x00)
	{
		ui32 a5_22 = (word32) *a5_102;
		a4.u0 = 0x10;
		a5_102 = a5_22 & 0x00F0;
		if ((a5_22 & 0x00F0) == 0x10)
		{
			a0_17 = *((word32) s1 + 8);
			Eq_2 s3_26 = 0x10000000;
			Eq_2 s4_27 = 0x0FFFFFFF;
			s1_28 = s1;
			do
			{
				Eq_2 s1_28;
				Eq_2 s2_29 = s1_28;
				if (s1_28 >= s3_26)
					s2_29 = s4_27;
				word32 s11_240;
				word32 s0_237;
				word32 s9_238;
				word32 s10_239;
				ra = tcp_recved(ra, s1_28 - s2_29, a0_17, (word32) (word16) s2_29, a2, a3, s7, mstatus, dwLoc10, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgE8, dwArgEC, dwArgF8, out s0_237, out s1_28, out a0_17, out a2, out a3, out a4, out a5_102, out s3_26, out s4_27, out s7, out s9_238, out s10_239, out s11_240, out mstatus);
			} while (s1_28 != 0x00);
		}
	}
	Eq_2 a0_97 = (word32) a0_17 + 0x0C;
	word32 s4_233;
	word32 s5_234;
	word32 s6_235;
	word32 s8_236;
	word32 s3_232;
	word32 s2_231;
	word32 a3_230;
	word32 s1_228;
	word32 a1_229;
	sys_sem_signal(a0_97, a4, a5_102, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_228, out a1_229, out a3_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235, out s8_236);
}

// 230471D2: void lwip_netconn_do_write(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register (ptr32 (ptr32 Eq_229451)) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_write(Eq_2 ra, union Eq_2 * a0, struct Eq_229451 ** a1, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, Eq_2 s7, word32 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	word32 a3_169;
	word32 a2_168;
	word32 a0_14;
	Eq_2 a5_20;
	Eq_2 a4_19;
	Eq_2 s1_16 = netconn_err(*a0, a3, a4, mstatus, out a0_14, out a2_168, out a3_169, out a4_19, out a5_20);
	Eq_232796 s0_21 = *a5_20;
	if (a0_14 == 0x00)
	{
		ui32 a4_22 = (word32) *a5_20;
		a0_14 = ~0x05;
		a4_19 = a4_22 & 0x00F0;
		if ((a4_22 & 0x00F0) == 0x10)
		{
			a4_19 = (word32) *((word32) a5_20 + 1);
			if (a4_19 == 0x00)
			{
				a5_20 = *((word32) a4_19 + 4);
				a0_14 = ~0x0A;
				if (a4_19 != 0x00)
				{
					((word32) a5_20 + 1)->u1 = 0x01;
					*((word32) *a5_20 + 40) = a5_20;
					word32 s0_179;
					word32 s1_180;
					word32 a5_181;
					word32 s3_182;
					word32 s4_183;
					word32 s5_184;
					word32 s6_185;
					word32 s7_186;
					word32 s8_187;
					word32 mstatus_188;
					lwip_netconn_do_writemore(ra, s1_16, a1, dwArg10, 0x10, a5_20, s5, s6, s7, s8, mstatus, dwArg28, dwArg48, dwArg68, dwArg88, dwArg98, dwArgC8, dwArg0128, out s0_179, out s1_180, out a5_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out mstatus_188);
					return;
				}
			}
			else
				a0_14 = ~0x04;
		}
	}
	((word32) s0_21 + 4)->u0 = (byte) a0_14;
	Eq_2 a0_37 = (word32) a5_20 + 0x0C;
	word32 a3_172;
	word32 a1_171;
	word32 s1_170;
	word32 s2_173;
	word32 s3_174;
	word32 s4_175;
	word32 s5_176;
	word32 s6_177;
	word32 s8_178;
	sys_sem_signal(a0_37, a4_19, a5_20, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_170, out a1_171, out a3_172, out s2_173, out s3_174, out s4_175, out s5_176, out s6_177, out s8_178);
}

