pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304722A: void lwip_netconn_do_getaddr(Register Eq_2 a4, Register (ptr32 Eq_232887) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_getaddr(Eq_2 a4, struct Eq_232887 * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_19;
	Eq_232896 a0_15 = a5->t0000;
	struct Eq_232900 * a5_6 = a5->ptr0004;
	if (a5_6 != null)
	{
		union Eq_2 * a5_10;
		if ((word32) *((word32) a0_15 + 16) != 0x00)
			a5_10 = a5_6->ptr0000;
		else
			a5_10 = a5_6->ptr0004;
		*a5_10 = (union Eq_2 *) a4;
		a0_15 = *a4;
		((word32) a0_15 + 4)->u0 = 0x00;
		ui32 a5_18 = (word32) *a4;
		a5_19 = a5_18 & 0x00F0;
		if ((a5_18 & 0x00F0) != 32)
		{
			if ((a5_18 & 0x00F0) == 64)
			{
				a5_19 = (word32) *((word32) a0_15 + 16);
				if (a5_19 == 0x00)
					goto l23047272;
				a0_15 = *((word32) a5_19 + 0x0C);
				a4 = (word32) *((word32) *((word16) a4.u0 + 4) + 16);
				*a5_19 = (word16) a4;
l23047290:
				word32 a0_54 = *a0_15;
				word32 s4_134;
				word32 s8_137;
				word32 s5_135;
				word32 s6_136;
				word32 s1_129;
				word32 s3_133;
				word32 s2_132;
				word32 a1_130;
				word32 a3_131;
				sys_sem_signal(a0_54 + 0x0C, a4, a5_19, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_129, out a1_130, out a3_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s8_137);
				return;
			}
			if ((a5_18 & 0x00F0) != 0x10)
				goto l23047290;
			a4 = (word32) *((word32) a0_15 + 16);
			if (a4 == 0x00)
			{
				a4.u0 = 0x01;
				if ((word32) (a5_18 & 0x00F0)->b0014 <= 0x01)
					goto l23047272;
				a5_19 = (word32) (a5_18 & 0x00F0)->w0018;
			}
			else
				a5_19 = (word32) (a5_18 & 0x00F0)->w0016;
			a0_15 = *((word16) a4.u0 + 0x0C);
l230472A6:
			*a4.u0 = (word16) a5_19;
			goto l23047290;
		}
		a4 = (word32) *((word32) a0_15 + 16);
		if (a4 != 0x00)
		{
			a0_15 = *((word32) a4 + 0x0C);
			a5_19 = (word32) (a5_18 & 0x00F0)->w0012;
			goto l230472A6;
		}
		ui32 a4_22 = (word32) (a5_18 & 0x00F0)->b0010;
		a4 = a4_22 & 0x04;
		if ((a4_22 & 0x04) != 0x00)
		{
			a0_15 = (a4_22 & 0x04)->t000C;
			a5_19 = (word32) (a5_18 & 0x00F0)->w0014;
			goto l230472A6;
		}
	}
l23047272:
	((word32) a0_15 + 4)->u0 = ~0x0A;
	a5_19.u0 = ~0x0A;
	goto l23047290;
}

// 230472CA: void lwip_netconn_do_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_233064) a0, Register (ptr32 Eq_233065) a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_close(Eq_2 ra, Eq_2 s0, Eq_2 s1, struct Eq_233064 * a0, struct Eq_233065 * a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s6, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a4_122;
	Eq_2 a0_12 = a4->t0004;
	if (a4 != null && ((word32) (*a0_12) & 0x00F0) == 0x10)
	{
		ui32 a4_16 = (word32) a0->b0008;
		Eq_2 a3_18 = (word32) *((word32) a0_12 + 1);
		if ((a4_16 == 0x03 || a3_18 != 0x02) && a3_18 != 0x03)
		{
			if (a3_18 != 0x01)
			{
				if ((a4_16 & 0x01) != 0x00)
				{
					word32 a0_333;
					word32 s0_332;
					word32 a4_334;
					ra = netconn_drain(ra, a0_12, a3_18, a4_16 & 0x01, a5, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0148, out s0_332, out s1, out a0_333, out a3_18, out a4_334, out a5, out s3, out s4, out s6, out s7, out mstatus);
				}
				((word32) a5 + 1)->u1 = 0x04;
				*((word32) *a5 + 40) = a5;
				word32 s8_343;
				word32 mstatus_344;
				word32 s6_341;
				word32 s7_342;
				word32 s4_339;
				word32 s5_340;
				word32 s3_338;
				word32 a5_337;
				word32 s1_336;
				word32 s0_335;
				lwip_netconn_do_close_internal(ra, s0, s1, dwArg10, a3_18, a5, s3, s4, s6, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, dwArg54, dwArg58, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s0_335, out s1_336, out a5_337, out s3_338, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out mstatus_344);
				return;
			}
			a4_122.u0 = ~0x04;
l23047302:
			a0->b0004 = (byte) a4_122;
			word32 a3_325;
			word32 a1_324;
			word32 s1_323;
			word32 s3_327;
			word32 s2_326;
			word32 s6_330;
			word32 s4_328;
			word32 s5_329;
			word32 s8_331;
			sys_sem_signal((word32) a0_12 + 0x0C, a4_122, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_323, out a1_324, out a3_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s8_331);
			return;
		}
	}
	a4_122.u0 = ~0x0A;
	goto l23047302;
}

// 2304733C: void lwip_netconn_do_join_leave_group(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_233223) a0, Register (ptr32 Eq_233224) a1, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_join_leave_group(Eq_2 ra, Eq_2 s1, struct Eq_233223 * a0, struct Eq_233224 * a1, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	a0->b0004 = ~0x0A;
	struct Eq_233245 * a0_11 = *(struct Eq_233245 **) ~0x0A;
	Eq_2 a5_14 = *((word32) a4 + 4);
	if (a4 != 0x00)
	{
		a4.u0 = 32;
		if (((word32) *a5_14 & 0x00F0) == 32)
		{
			Eq_2 a5_20 = (word32) a0_11->b0011;
			union Eq_2 * a0_21 = a0_11->ptr000C;
			struct Eq_233280 * s0_23 = a1->ptr0008;
			if (a5_20 == 0x00)
				a0_11 = igmp_joingroup(ra, a0_21, a5_20, s7, mstatus, dwArg08, dwArg18, dwArg28, out a4, out a5_14, out mstatus);
			else
				s0_23 = igmp_leavegroup(ra, s1, a0_21, a5_20, s7, mstatus, dwArg08, dwArg18, dwArg28, dwArg48, dwArg68, dwArg88, dwArg98, dwArgC8, out a0_11, out a4, out a5_14, out mstatus);
			s0_23->b0004 = (byte) a0_11;
		}
		else
		{
			a0_11->b0004 = ~0x05;
			a5_14.u0 = ~0x05;
		}
	}
	Eq_2 a0_90 = &a0_11->ptr000C;
	word32 s6_167;
	word32 s8_168;
	word32 s4_165;
	word32 s5_166;
	word32 s2_163;
	word32 s3_164;
	word32 a1_161;
	word32 a3_162;
	word32 s1_160;
	sys_sem_signal(a0_90, a4, a5_14, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_160, out a1_161, out a3_162, out s2_163, out s3_164, out s4_165, out s5_166, out s6_167, out s8_168);
}

// 2304738E: void lwip_netconn_do_gethostbyname(Register Eq_2 ra, Register (ptr32 Eq_233324) s1, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void lwip_netconn_do_gethostbyname(Eq_2 ra, struct Eq_233324 * s1, Eq_2 a1, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_24;
	int8 * a5_34;
	byte * s1_47;
	ptr32 mstatus_51;
	word32 s4_145;
	word32 s3_144;
	word32 s2_143;
	word32 a4_142;
	word32 a3_141;
	word32 s0_140;
	dns_gethostbyname_addrtype(ra, **((word32) a1 + 4), a1, s1->t000C, s2, s5, s6, s8, mstatus, dwLoc08, dwArg0C, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgD8, dwArg0118, dwArg0158, out s0_140, out s1_47, out a0_24, out a3_141, out a4_142, out a5_34, out s2_143, out s3_144, out s4_145, out mstatus_51);
	*s1_47 = (byte) a0_24;
	Eq_2 a4_55 = (int32) *a5_34;
	if (a4_55 == ~0x04)
		return;
	word32 s1_146;
	word32 a1_147;
	word32 a3_148;
	word32 s2_149;
	word32 s3_150;
	word32 s4_151;
	word32 s5_152;
	word32 s6_153;
	word32 s8_154;
	sys_sem_signal(a0_24, a4_55, ~0x04, mstatus_51, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_146, out a1_147, out a3_148, out s2_149, out s3_150, out s4_151, out s5_152, out s6_153, out s8_154);
}

