pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230473D6: Register Eq_2 err_to_errno(Register Eq_2 a0, Register out Eq_2 a4Out, Register out (ptr32 (ptr32 Eq_2)) a5Out)
// Called from:
//      lwip_recv_tcp
//      lwip_accept
//      lwip_bind
//      lwip_close
//      lwip_connect
//      lwip_listen
//      lwip_read
//      lwip_sendto
//      lwip_send
//      lwip_shutdown
//      lwip_setsockopt
Eq_2 err_to_errno(Eq_2 a0, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	union Eq_2 ** a5_5 = (word32) a0 + 16 & 0x00FF;
	if (a5_5 > (union Eq_2 **) 0x10)
	{
		a4Out.u0 = <invalid>;
		a5Out = a5_5;
		return 0x05;
	}
	else
	{
		Eq_2 a0_13 = 587752648 - (a0 << 0x02);
		a4Out.u0 = <invalid>;
		a5Out = a0 << 0x02;
		return a0_13;
	}
}

// 230473FA: Register Eq_2 netbuf_delete(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0108, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_187153) a5Out)
// Called from:
//      free_socket
//      lwip_recvfrom_udp_raw.isra.6
//      recv_udp
//      recv_raw
//      netconn_drain
Eq_2 netbuf_delete(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0108, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_187153 & a5Out)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	else
	{
		Eq_2 a1_21 = a0;
		Eq_2 a0_6 = *a0;
		if (a0_6 != 0x00)
		{
			word32 s0_129;
			word32 s1_130;
			word32 a0_131;
			word32 a2_132;
			word32 a5_133;
			word32 a7_134;
			word32 s2_135;
			word32 s3_136;
			word32 s4_137;
			word32 s5_138;
			word32 s6_139;
			word32 s8_140;
			pbuf_free(ra, a0_6, a3, a4, s4, mstatus, dwArg0108, out s0_129, out s1_130, out a0_131, out a1_21, out a2_132, out a3, out a4, out a5_133, out a7_134, out s2_135, out s3_136, out s4_137, out s5_138, out s6_139, out s8_140, out mstatus);
			*((word32) a1_21 + 4) = 0x00;
			*a1_21 = 0x00;
		}
		struct Eq_187153 * a5_52;
		Eq_2 a3_55;
		Eq_2 a4_56;
		word32 a0_141;
		word32 a2_142;
		Eq_2 s1_57 = memp_free(0x06, a1_21, a3, a4, mstatus, out a0_141, out a2_142, out a3_55, out a4_56, out a5_52);
		a3Out = a3_55;
		a4Out = a4_56;
		a5Out = a5_52;
		return s1_57;
	}
}

// 23047426: Register Eq_2 netbuf_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_189247) s0Out, Register out (ptr32 Eq_189247) a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_sendto
Eq_2 netbuf_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, struct Eq_189247 & s0Out, struct Eq_189247 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 != 0x00)
	{
		Eq_2 s0_19 = a0;
		Eq_2 a0_10 = *a0;
		if (a0_10 != 0x00)
		{
			word32 a5_201;
			word32 a7_202;
			word32 s2_203;
			word32 s3_204;
			word32 a2_200;
			word32 a0_199;
			word32 s4_205;
			word32 s5_206;
			word32 s6_207;
			word32 s8_208;
			ra = pbuf_free(ra, a0_10, a3, a4, s4, mstatus, dwArg0108, out s0_19, out s1, out a0_199, out a1, out a2_200, out a3, out a4, out a5_201, out a7_202, out s2_203, out s3_204, out s4_205, out s5_206, out s6_207, out s8_208, out mstatus);
		}
		struct Eq_189247 * a0_119;
		struct Eq_233501 * a0_55;
		Eq_2 a3_57;
		Eq_2 a4_58;
		struct Eq_189247 * s0_60;
		ptr32 s2_66;
		Eq_2 s4_68;
		ptr32 mstatus_71;
		word32 s8_198;
		word32 s6_197;
		word32 s5_196;
		word32 s3_195;
		word32 a7_194;
		word32 a5_193;
		word32 a2_192;
		word32 a1_191;
		word32 s1_190;
		Eq_2 ra_72 = pbuf_alloc(ra, s0_19, s1, 0x00B6, a1, 640, a3, a4, mstatus, dwLoc1C, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_60, out s1_190, out a0_55, out a1_191, out a2_192, out a3_57, out a4_58, out a5_193, out a7_194, out s2_66, out s3_195, out s4_68, out s5_196, out s6_197, out s8_198, out mstatus_71);
		a0_55->ptr0000 = s0_60;
		if (a0_55 != null)
		{
			a0_55->ptr0004 = s0_60;
			a0_119 = a0_55->ptr0004;
		}
		else
			a0_119 = null;
		s0Out = s0_60;
		a0Out = a0_119;
		a3Out = a3_57;
		a4Out = a4_58;
		s2Out = s2_66;
		s4Out = s4_68;
		mstatusOut = mstatus_71;
		return ra_72;
	}
	else
	{
		s0Out = s0;
		a0Out = null;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23047460: Register word32 netbuf_free(Register Eq_2 ra, Register (ptr32 Eq_189133) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_sendto
word32 netbuf_free(Eq_2 ra, struct Eq_189133 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0118, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	if (a0 == null)
	{
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return a2;
	}
	else
	{
		struct Eq_189133 * s0_17 = a0;
		Eq_2 a0_10 = a0->t0000;
		if (a0_10 != 0x00)
		{
			word32 s1_127;
			word32 a0_128;
			word32 a1_129;
			word32 a2_130;
			word32 a3_131;
			word32 a4_132;
			word32 a5_133;
			word32 a7_134;
			word32 s6_135;
			word32 s8_136;
			pbuf_free(ra, a0_10, a3, a4, s4, mstatus, dwArg0118, out s0_17, out s1_127, out a0_128, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out a7_134, out s2, out s3, out s4, out s5, out s6_135, out s8_136, out mstatus);
		}
		s0_17->t0004.u0 = 0x00;
		s0_17->t0000.u0 = 0x00;
		s0_17->b000E = 0x00;
		s0_17->w0010 = 0x00;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return dwArg10;
	}
}

