pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230477EE: void dhcp_server_recv(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
void dhcp_server_recv(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, word32 dwArg0198)
{
	Eq_2 a0_816;
	Eq_2 a3_162 = *a5;
	Eq_2 a4_100 = (word32) *((word32) a2 + 0x0A);
	Eq_2 s0_34 = a2;
	if (a4_100 <= 43)
	{
l2304781A:
		a0_816 = s0_34;
		goto l2304781C;
	}
	Eq_2 a0_43;
	word32 s5_1298;
	word32 s1_1291;
	word32 a1_1292;
	word32 s3_1297;
	word32 a5_1294;
	word32 s2_1296;
	word32 a7_1295;
	word32 s8_1300;
	word32 s6_1299;
	word32 a2_1293;
	ra = pbuf_alloc(ra, a2, a0, 0x00B6, 1500, 640, a3_162, a4_100, mstatus, a5, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_34, out s1_1291, out a0_43, out a1_1292, out a2_1293, out a3_162, out a4_100, out a5_1294, out a7_1295, out s2_1296, out s3_1297, out s4, out s5_1298, out s6_1299, out s8_1300, out mstatus);
	if (a0_43 == 0x00)
		goto l2304781A;
	a4_100 = (word32) *((word32) a0_43 + 8);
	if (a4_100 < (word32) (*((word32) s0_34 + 8)))
		goto l2304781A;
	Eq_2 s4_76;
	Eq_2 a4_79;
	Eq_2 a3_83;
	struct Eq_234667 * s1_102;
	word32 a2_1308;
	word32 a5_1309;
	word32 s8_1312;
	word32 a7_1310;
	word32 s3_1311;
	word32 s0_1305;
	word32 s2_1303;
	word32 a0_1302;
	word32 s1_1301;
	word32 s3_1304;
	word32 a1_1307;
	word32 a0_1306;
	Eq_2 s6_109;
	Eq_2 s5_108;
	Eq_2 s2_103;
	ra = pbuf_free(ra, pbuf_copy(a0_43, s0_34, out s1_1301, out a0_1302, out a3_83, out a4_79, out s2_1303, out s3_1304, out s4_76), a3_83, a4_79, s4_76, mstatus, dwArgE8, out s0_1305, out s1_102, out a0_1306, out a1_1307, out a2_1308, out a3_162, out a4_100, out a5_1309, out a7_1310, out s2_103, out s3_1311, out s4, out s5_108, out s6_109, out s8_1312, out mstatus);
	Eq_2 s0_118 = *((word32) s2_103 + 4);
	word32 s3_120 = (word32) *s0_118;
	if (s3_120 == 0x01)
	{
		a4_100.u0 = 1666417251;
		if (((word32) *((word32) s0_118 + 0x00EF) << 24 | (((word32) (*((word32) s0_118 + 0x00ED)) << 8 | (word32) (*((word32) s0_118 + 0x00EC))) | (word32) (*((word32) s0_118 + 0x00EE)) << 16)) != 1666417251)
			goto l23047A90;
		Eq_2 s8_133 = (word32) *((word32) s0_118 + 2);
		if (s8_133 <= 0x06)
		{
			uint32 s4_139 = (word32) *((word32) s2_103 + 8) + -0x00F0 << 16;
			s4 = s4_139 >> 0x10;
			word32 a1_1313;
			struct Eq_234768 * a0_143 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 53, out a1_1313, out a4_100);
			if (a0_143 == null)
				goto l23047A90;
			Eq_2 a4_411;
			Eq_2 a3_399;
			Eq_2 a1_413;
			word32 a1_305;
			word32 a5_147 = (word32) a0_143->b0002;
			if (a5_147 == s3_120)
			{
				Eq_2 s3_414 = s1_102->t000C;
				while (true)
				{
					word32 a1_426;
					if (s3_414 == 0x00)
						break;
					word32 a3_1315;
					word32 a4_1316;
					word32 a5_1317;
					word32 a2_1314;
					if (memcmp((word32) s3_414 + 4, (word32) s0_118 + 28, s8_133, out a1_426, out a2_1314, out a3_1315, out a4_1316, out a5_1317) == 0x00)
						goto l23047970;
					s3_414 = *s3_414;
				}
				word32 a1_1318;
				word32 a4_1319;
				struct Eq_234768 * a0_435 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 50, out a1_1318, out a4_1319);
				if (a0_435 != null)
				{
					word32 a4_1321;
					word32 a3_1320;
					Eq_2 a0_443 = dhcp_client_find_by_ip.isra.0(&a0_435->b0002, out a1_426, out a3_1320, out a4_1321, out s8_133);
					s3_414 = a0_443;
					if (a0_443 != 0x00)
						goto l23047970;
				}
				while (true)
				{
					Eq_2 a3_468;
					Eq_2 a4_469;
					word32 s8_1373;
					word32 a1_1372;
					Eq_2 a0_465 = dhcp_client_find_by_ip.isra.0((char *) &s1_102->t000C + 0x0C, out a1_1372, out a3_468, out a4_469, out s8_1373);
					if (a0_465 == 0x00)
						break;
					word32 a3_1339;
					word32 a5_1341;
					word32 a4_1340;
					Eq_2 a0_818 = lwip_htonl(a0_465, out a3_1339, out a4_1340, out a5_1341);
					word32 s1_823 = *((word32) a0_818 + 20);
					Eq_2 s3_822 = (word32) a0_818 + 1;
					word32 a3_1342;
					word32 a5_1344;
					word32 a4_1343;
					Eq_2 a0_824 = lwip_htonl(a0_818, out a3_1342, out a4_1343, out a5_1344);
					if (a0_824 < (word32) a0_818 + 1)
					{
						s1_823 = (word32) *((word32) a0_824 + 16);
						word32 a5_1350;
						word32 a3_1348;
						word32 a4_1349;
						s3_822 = lwip_htonl(a0_824, out a3_1348, out a4_1349, out a5_1350);
					}
					word32 a4_1346;
					word32 a5_1347;
					word32 a3_1345;
					*((word32) lwip_htonl(s3_822, out a3_1345, out a4_1346, out a5_1347) + 24) = s1_823;
				}
				Eq_2 a0_487;
				word32 a1_1335;
				word32 a7_1337;
				word32 a5_1336;
				word32 s3_1338;
				mem_malloc(ra, s0_118, 0x14, a3_468, a4_469, s2_103, mstatus, s4, dwLoc0C, s3, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0148, out a0_487, out a1_1335, out a3_162, out a4_100, out a5_1336, out a7_1337, out s2_103, out s3_1338, out s4, out s5_108, out s6_109, out s8_133);
				s3_414 = a0_487;
				if (a0_487 != 0x00)
				{
					struct Eq_235047 * a5_515;
					word32 a2_1367;
					word32 a7_1371;
					word32 a4_1369;
					word32 a3_1368;
					word32 a6_1370;
					memcpy((word32) a0_487 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_426, out a2_1367, out a3_1368, out a4_1369, out a5_515, out a6_1370, out a7_1371);
					*((word32) a0_487 + 0x0C) = a5_515;
					struct Eq_235072 * s1_529 = a5_515->ptr000C;
					*a0_487 = a5_515;
					s1_529->t000C = a0_487;
l23047970:
					*((word32) s3_414 + 16) = 0x80510100;
					s0_118->u1 = 0x02;
					((word32) s0_118 + 3)->u1 = 0x00;
					((word32) s0_118 + 8)->u1 = 0x00;
					((word32) s0_118 + 9)->u1 = 0x00;
					word32 a4_1325;
					word32 a1_1322;
					word32 a2_1323;
					word32 a3_1324;
					word32 a5_1326;
					word32 a7_1328;
					word32 a6_1327;
					memcpy((word32) s0_118 + 20, a1_426 + 0x04, 0x04, out a1_1322, out a2_1323, out a3_1324, out a4_1325, out a5_1326, out a6_1327, out a7_1328);
					((word32) s0_118 + 0x00ED)->u1 = 0x82;
					((word32) s0_118 + 0x00EC)->u1 = 99;
					((word32) s0_118 + 0x00EF)->u1 = 99;
					((word32) s0_118 + 44)->u1 = 0x00;
					((word32) s0_118 + 0x006C)->u1 = 0x00;
					((word32) s0_118 + 0x00EE)->u1 = 0x53;
					word32 a2_1329;
					word32 a3_1330;
					word32 a4_1331;
					word32 a5_1332;
					word32 a7_1334;
					word32 a6_1333;
					memcpy((word32) s0_118 + 16, (word32) s3_414 + 0x0C, 0x04, out a1_305, out a2_1329, out a3_1330, out a4_1331, out a5_1332, out a6_1333, out a7_1334);
					((word32) s0_118 + 0x00F0)->u1 = 0x35;
					((word32) s0_118 + 0x00F1)->u1 = 0x01;
					((word32) s0_118 + 242)->u1 = 0x02;
					goto l230479E0;
				}
			}
			else
			{
				if (a5_147 == 0x03)
				{
					Eq_2 s3_208 = s1_102->t000C;
					while (true)
					{
						word32 a1_220;
						if (s3_208 == 0x00)
							break;
						word32 a5_1380;
						word32 a3_1378;
						word32 a4_1379;
						word32 a2_1377;
						if (memcmp((word32) s3_208 + 4, (word32) s0_118 + 28, s8_133, out a1_220, out a2_1377, out a3_1378, out a4_1379, out a5_1380) == 0x00)
							goto l23047BD2;
						s3_208 = *s3_208;
					}
					word32 a4_1381;
					word32 a1_230;
					struct Eq_234768 * a0_229 = dhcp_server_option_find((word32) s0_118 + 0x00F0, s4_139 >> 0x10, 50, out a1_230, out a4_1381);
					if (a0_229 != null)
					{
						word32 a4_1402;
						word32 a3_1401;
						Eq_2 a0_236 = dhcp_client_find_by_ip.isra.0(&a0_229->b0002, out a1_230, out a3_1401, out a4_1402, out s8_133);
						s3_208 = a0_236;
						if (a0_236 != 0x00)
						{
							word32 a2_1403;
							word32 a5_1406;
							word32 a3_1404;
							word32 a4_1405;
							if (memcmp((word32) a0_236 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_220, out a2_1403, out a3_1404, out a4_1405, out a5_1406) == 0x00)
							{
l23047BD2:
								*((word32) s3_208 + 16) = 0x80510100;
								s0_118->u1 = 0x02;
								((word32) s0_118 + 3)->u1 = 0x00;
								((word32) s0_118 + 8)->u1 = 0x00;
								((word32) s0_118 + 9)->u1 = 0x00;
								word32 a7_1413;
								word32 a6_1412;
								word32 a5_1411;
								word32 a1_1407;
								word32 a3_1409;
								word32 a4_1410;
								word32 a2_1408;
								memcpy((word32) s0_118 + 20, a1_220 + 0x04, 0x04, out a1_1407, out a2_1408, out a3_1409, out a4_1410, out a5_1411, out a6_1412, out a7_1413);
								((word32) s0_118 + 0x00ED)->u1 = 0x82;
								((word32) s0_118 + 0x00EC)->u1 = 99;
								((word32) s0_118 + 0x00EF)->u1 = 99;
								((word32) s0_118 + 44)->u1 = 0x00;
								((word32) s0_118 + 0x006C)->u1 = 0x00;
								((word32) s0_118 + 0x00EE)->u1 = 0x53;
								word32 a3_1415;
								word32 a4_1416;
								word32 a7_1419;
								word32 a6_1418;
								word32 a5_1417;
								word32 a2_1414;
								memcpy((word32) s0_118 + 16, (word32) s3_208 + 0x0C, 0x04, out a1_305, out a2_1414, out a3_1415, out a4_1416, out a5_1417, out a6_1418, out a7_1419);
								((word32) s0_118 + 0x00F0)->u1 = 0x35;
								((word32) s0_118 + 0x00F1)->u1 = 0x01;
								((word32) s0_118 + 242)->u1 = 0x05;
l230479E0:
								((word32) s0_118 + 0x00F3)->u1 = 0x36;
								((word32) s0_118 + 244)->u1 = 0x04;
								word32 a7_1430;
								word32 a3_1426;
								word32 a5_1428;
								word32 a6_1429;
								word32 a4_1427;
								word32 a2_1425;
								word32 a1_1424;
								memcpy((word32) s0_118 + 0x00F5, a1_305 + 0x04, 0x04, out a1_1424, out a2_1425, out a3_1426, out a4_1427, out a5_1428, out a6_1429, out a7_1430);
								((word32) s0_118 + 0x00F9)->u1 = 0x33;
								((word32) s0_118 + 0x00FA)->u1 = 0x04;
								word32 a1_631;
								word32 a2_1431;
								word32 a3_1432;
								word32 a6_1435;
								word32 a7_1436;
								word32 a5_1434;
								word32 a4_1433;
								memcpy((word32) s0_118 + 0x00FB, fp + -52, 0x04, out a1_631, out a2_1431, out a3_1432, out a4_1433, out a5_1434, out a6_1435, out a7_1436);
								((word32) s0_118 + 0x00FF)->u1 = 0x01;
								((word32) s0_118 + 0x0100)->u1 = 0x04;
								word32 a1_651;
								word32 a7_1442;
								word32 a3_1438;
								word32 a6_1441;
								word32 a4_1439;
								word32 a5_1440;
								word32 a2_1437;
								memcpy((word32) s0_118 + 0x0101, a1_631 + 0x08, 0x04, out a1_651, out a2_1437, out a3_1438, out a4_1439, out a5_1440, out a6_1441, out a7_1442);
								((word32) s0_118 + 261)->u1 = 0x06;
								((word32) s0_118 + 262)->u1 = 0x04;
								word32 a1_671;
								word32 a6_1447;
								word32 a7_1448;
								word32 a5_1446;
								word32 a3_1444;
								word32 a4_1445;
								word32 a2_1443;
								memcpy((word32) s0_118 + 263, a1_651 + 0x04, 0x04, out a1_671, out a2_1443, out a3_1444, out a4_1445, out a5_1446, out a6_1447, out a7_1448);
								((word32) s0_118 + 267)->u1 = 0x03;
								((word32) s0_118 + 268)->u1 = 0x04;
								word32 a1_1449;
								word32 a5_1452;
								word32 a6_1453;
								word32 a7_1454;
								word32 a4_1451;
								word32 a2_1450;
								memcpy((word32) s0_118 + 269, a1_671 + 0x04, 0x04, out a1_1449, out a2_1450, out a3_399, out a4_1451, out a5_1452, out a6_1453, out a7_1454);
								((word32) s0_118 + 0x0111)->u1 = ~0x00;
								s4.u0 = 0x01;
								a4_411 = (word32) *((word32) s2_103 + 8);
								if (a4_411 <= 0x0112)
									goto l23047A7E;
								a1_413.u0 = 0x0112;
l23047A78:
								word32 s4_1460;
								word32 a2_1456;
								word32 a5_1458;
								word32 s3_1459;
								word32 a3_1457;
								word32 s1_1455;
								ra = pbuf_realloc(ra, s2_103, a1_413, a3_399, a4_411, s4, mstatus, dwArgD8, out s1_1455, out a2_1456, out a3_1457, out a4_411, out a5_1458, out s2_103, out s3_1459, out s4_1460, out s5_108, out s6_109, out s8_133, out mstatus);
l23047A7E:
								word32 s8_1376;
								word32 s7_1375;
								word32 s3_1374;
								ra = udp_sendto_if(ra, s5_108, s2_103, fp + -56, s6_109, a4_411, s8_133, mstatus, s4, dwArg38, s9, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out a3_162, out a4_100, out s2_103, out s3_1374, out s4, out s7_1375, out s8_1376, out mstatus);
								goto l23047A90;
							}
							word32 a4_1422;
							word32 a5_1423;
							word32 a2_1421;
							word32 a0_1420;
							puts(587752716, out a0_1420, out a1_230, out a2_1421, out a4_1422, out a5_1423, out s4, out s8_133);
						}
					}
					s0_118->u1 = 0x02;
					((word32) s0_118 + 3)->u1 = 0x00;
					((word32) s0_118 + 8)->u1 = 0x00;
					((word32) s0_118 + 9)->u1 = 0x00;
					word32 a3_1384;
					word32 a6_1387;
					word32 a7_1388;
					word32 a5_1386;
					word32 a4_1385;
					word32 a2_1383;
					word32 a1_1382;
					memcpy((word32) s0_118 + 20, a1_230 + 0x04, 0x04, out a1_1382, out a2_1383, out a3_1384, out a4_1385, out a5_1386, out a6_1387, out a7_1388);
					((word32) s0_118 + 0x00ED)->u1 = 0x82;
					((word32) s0_118 + 0x00EE)->u1 = 0x53;
					((word32) s0_118 + 0x00EC)->u1 = 99;
					((word32) s0_118 + 0x00EF)->u1 = 99;
					((word32) s0_118 + 44)->u1 = 0x00;
					((word32) s0_118 + 0x006C)->u1 = 0x00;
					word32 a1_372;
					word32 a2_1391;
					word32 a4_1393;
					word32 a5_1394;
					word32 a3_1392;
					word32 a0_1390;
					word32 t1_1389;
					ra = memset(ra, (word32) s0_118 + 16, 0x00, 0x04, out t1_1389, out a0_1390, out a1_372, out a2_1391, out a3_1392, out a4_1393, out a5_1394);
					((word32) s0_118 + 0x00F0)->u1 = 0x35;
					((word32) s0_118 + 0x00F1)->u1 = 0x01;
					((word32) s0_118 + 242)->u1 = 0x06;
					((word32) s0_118 + 0x00F3)->u1 = 0x36;
					((word32) s0_118 + 244)->u1 = 0x04;
					word32 a2_1396;
					word32 a4_1397;
					word32 a7_1400;
					word32 a6_1399;
					word32 a5_1398;
					word32 a1_1395;
					memcpy((word32) s0_118 + 0x00F5, a1_372 + 0x04, 0x04, out a1_1395, out a2_1396, out a3_399, out a4_1397, out a5_1398, out a6_1399, out a7_1400);
					((word32) s0_118 + 0x00F9)->u1 = ~0x00;
					a4_411 = (word32) *((word32) s2_103 + 8);
					if (a4_411 <= 0x00FA)
						goto l23047A7E;
					a1_413.u0 = 0x00FA;
					goto l23047A78;
				}
				a4_100.u0 = 0x07;
				if (a5_147 == 0x07)
				{
					Eq_2 s3_150 = s1_102->t000C;
					s4.u0 = 0x00;
					while (s3_150 != 0x00)
					{
						word32 a1_1461;
						word32 a2_1462;
						word32 a5_1463;
						Eq_2 a0_160 = memcmp((word32) s3_150 + 4, (word32) s0_118 + 28, (word32) *((word32) s0_118 + 2), out a1_1461, out a2_1462, out a3_162, out a4_100, out a5_1463);
						Eq_2 a5_166 = *s3_150;
						if (a0_160 == 0x00)
						{
							word32 s1_169 = *((word16) a4_100.u0 + 0x0C);
							if (a4_100 == s3_150)
								*((word32) a5_166 + 0x0C) = s1_169;
							else
								*s4.u0 = a5_166;
							word32 s8_1470;
							word32 a7_1466;
							word32 s6_1469;
							word32 s3_1467;
							word32 s5_1468;
							word32 a5_1465;
							word32 s1_1464;
							mem_free(s3_150, a3_162, a4_100, s2_103, s3_150, s4, mstatus, a5, dwLoc38, dwLoc1C, dwArg44, dwArg64, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_1464, out a3_162, out a4_100, out a5_1465, out a7_1466, out s2_103, out s3_1467, out s4, out s5_1468, out s6_1469, out s8_1470);
							break;
						}
						s4 = s3_150;
						s3_150 = *a5_166;
					}
				}
			}
		}
	}
l23047A90:
	a0_816 = s2_103;
l2304781C:
	word32 a1_1354;
	word32 a5_1358;
	word32 s4_1362;
	word32 s2_1360;
	word32 a7_1359;
	word32 s3_1361;
	word32 s6_1364;
	word32 s5_1363;
	word32 mstatus_1366;
	word32 s8_1365;
	word32 a3_1356;
	word32 a4_1357;
	word32 a2_1355;
	word32 s1_1352;
	word32 a0_1353;
	word32 s0_1351;
	pbuf_free(ra, a0_816, a3_162, a4_100, s4, mstatus, dwArgE8, out s0_1351, out s1_1352, out a0_1353, out a1_1354, out a2_1355, out a3_1356, out a4_1357, out a5_1358, out a7_1359, out s2_1360, out s3_1361, out s4_1362, out s5_1363, out s6_1364, out s8_1365, out mstatus_1366);
	0x00 = dwArg0198;
}

// 23047C46: Register Eq_2 dhcp_server_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg74, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      dhcpd_start
Eq_2 dhcp_server_start(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg74, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, union Eq_2 & a3Out)
{
	int32 a5_19 = g_dw4200DFB8;
	while (true)
	{
		ptr32 a0_121;
		if (a5_19 == 0x00)
			break;
		int32 * a5_22 = *((word32) a4 + 4);
		if (a4 == a0)
		{
			*((word32) a4 + 16) = a5_22;
			*((word32) a4 + 20) = a5_22;
			*((word32) a4 + 24) = a5_22;
			goto l23047C96;
		}
		a5_19 = *a5_22;
	}
	Eq_2 a0_47;
	union Eq_2 * s2_57;
	struct Eq_235769 ** s3_58;
	word32 s4_59;
	word32 s8_268;
	word32 s6_267;
	word32 s5_266;
	word32 a7_265;
	word32 a5_264;
	word32 a4_263;
	word32 a1_262;
	mem_malloc(ra, s0, 0x1C, a3, a4, 0x4200DFB8, mstatus, dwLoc0C, dwArg14, dwArg74, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0168, out a0_47, out a1_262, out a3, out a4_263, out a5_264, out a7_265, out s2_57, out s3_58, out s4_59, out s5_266, out s6_267, out s8_268);
	if (a0_47 != 0x00)
	{
		Eq_2 a0_72;
		Eq_2 a3_75;
		Eq_2 a4_76;
		word32 a5_272;
		word32 a2_271;
		word32 a1_270;
		word32 t1_269;
		Eq_2 ra_78 = memset(ra, a0_47, 0x00, 0x1C, out t1_269, out a0_72, out a1_270, out a2_271, out a3_75, out a4_76, out a5_272);
		Eq_2 a5_81 = *s2_57;
		*((word32) a0_47 + 4) = s4_59;
		*((word32) a0_47 + 0x0C) = 0x00;
		*a5_81 = a0_47;
		*s2_57 = (union Eq_2 *) a0_47;
		*((word32) a5_81 + 16) = a0_47;
		struct Eq_235769 * a5_88 = *s3_58;
		a5_88->t0014 = a0_47;
		Eq_2 s1_90 = a5_88->t0000;
		a5_88->t0018 = a0_47;
		word32 a4_274;
		word32 s1_273;
		word32 a5_275;
		ra = udp_new(ra_78, s1_90, a3_75, a4_76, mstatus, out s1_273, out a3, out a4_274, out a5_275);
		*((word32) a0_72 + 8) = a0_47;
		if (a0_72 != 0x00)
		{
			((word32) a0_72 + 9)->u1 = (byte) ((word32) *((word32) a0_72 + 9) | 32);
			word32 a4_276;
			word32 a5_277;
			Eq_2 a0_110 = udp_bind(a0_72, 587783820, (union Eq_2 *) 67, out a3, out a4_276, out a5_277);
			udp_recv(a0_110, &g_t230477EE, *((word32) a0_110 + 8));
l23047C96:
			a0_121 = 0x00;
l23047C74:
			a0Out = a0_121;
			a3Out = a3;
			return ra;
		}
	}
	a0_121 = ~0x00;
	goto l23047C74;
}

