pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23047CFE: void dhcp_server_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void dhcp_server_stop(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	int32 s0_13 = g_dw4200DFB8;
	Eq_2 s1_12 = 0x4200DFB8;
	while (s0_13 != 0x00)
	{
		Eq_235868 s0_16 = g_t4200E004;
		if (a0 == 0x4200E000)
		{
			Eq_2 s0_18 = *((word32) a0 + 8);
			if (a0 != 0x00)
			{
				word32 a0_239;
				word32 a2_240;
				word32 a5_241;
				s1_12 = udp_remove(a0, a3, mstatus, out a0_239, out a2_240, out a3, out a4, out a5_241);
			}
			*s1_12 = 0x00;
			word32 s1_228;
			word32 a3_229;
			word32 a4_230;
			word32 a5_231;
			word32 a7_232;
			word32 s2_233;
			word32 s3_234;
			word32 s4_235;
			word32 s5_236;
			word32 s6_237;
			word32 s8_238;
			mem_free(s0_18, a3, a4, s2, s3, s4, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s1_228, out a3_229, out a4_230, out a5_231, out a7_232, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s8_238);
			return;
		}
		s0_13 = (int32) *s0_16;
	}
	word32 a2_212;
	word32 s5_220;
	word32 a3_213;
	word32 a4_214;
	word32 a5_215;
	word32 s6_221;
	word32 s2_217;
	word32 a7_216;
	word32 s4_219;
	word32 s3_218;
	word32 a1_211;
	word32 a0_210;
	word32 s1_209;
	word32 s7_222;
	word32 s8_223;
	word32 s9_224;
	word32 s10_225;
	word32 s11_226;
	word32 t4_227;
	printf(ra, &g_t23086538, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_209, out a0_210, out a1_211, out a2_212, out a3_213, out a4_214, out a5_215, out a7_216, out s2_217, out s3_218, out s4_219, out s5_220, out s6_221, out s7_222, out s8_223, out s9_224, out s10_225, out s11_226, out t4_227);
}

// 23047D4C: void dhcpd_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void dhcpd_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	struct Eq_274 * a0_324;
	ptr32 mstatus_27;
	Eq_2 s1_30;
	Eq_2 s3_34;
	Eq_2 s7_38;
	Eq_2 ra_28 = dhcp_stop(ra, s0, s3, s4, s7, mstatus, dwLoc2C, s2, dwLoc18, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s1_30, out s3_34, out s7_38, out mstatus_27);
	Eq_2 s1_57;
	Eq_2 s0_56 = set_if(ra_28, s1_30, 587752836, 0x2307C4CC, 587752820, s3_34, s7_38, mstatus_27, dwLoc38, s2, s0, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg38, dwArg48, dwArg68, dwArgE8, out s1_57);
	ptr32 mstatus_84;
	word32 s2_485;
	word32 a1_484;
	Eq_2 ra_311 = netif_set_up(ra_28, s0_56, s1_57, mstatus_27, dwLoc38, dwLoc30, dwLoc1C, dwArg18, dwArg28, dwArg48, s3, s1, dwArg68, dwArg70, dwArg74, dwArg88, dwArg98, dwArgC8, dwArg0148, out a1_484, out s2_485, out mstatus_84);
	word32 a3_488;
	word32 a4_489;
	word32 a5_490;
	word32 a6_491;
	word32 a2_487;
	word32 a1_486;
	word32 a7_492;
	memcpy(fp + -52, (word32) s0_56 + 1412, 0x0E, out a1_486, out a2_487, out a3_488, out a4_489, out a5_490, out a6_491, out a7_492);
	word32 a1_493;
	word32 a2_494;
	word32 a4_495;
	word32 a5_496;
	Eq_2 a3_124;
	Eq_2 a0_127 = strchr(fp + -52, 46, out a1_493, out a2_494, out a3_124, out a4_495, out a5_496);
	Eq_2 dwLoc28_407 = (uint32) (word16) s2;
	if (a0_127 != 0x00)
	{
		word32 a1_497;
		word32 a2_498;
		word32 a4_499;
		word32 a5_500;
		Eq_2 a0_138 = strchr((word32) a0_127 + 1, 46, out a1_497, out a2_498, out a3_124, out a4_499, out a5_500);
		if (a0_138 != 0x00)
		{
			word32 a1_501;
			word32 a2_502;
			word32 a4_503;
			word32 a5_504;
			Eq_2 a0_149 = strchr((word32) a0_138 + 1, 46, out a1_501, out a2_502, out a3_124, out a4_503, out a5_504);
			if (a0_149 != 0x00)
			{
				Eq_2 a3_186;
				word32 s3_217;
				word32 s2_241;
				Eq_2 a3_256;
				Eq_2 a3_278;
				Eq_2 a4_279;
				Eq_2 s1_282;
				word32 a0_298;
				word32 s0_505;
				word32 s1_506;
				word32 a0_507;
				word32 a5_508;
				word32 s2_509;
				word32 s3_510;
				word32 s4_511;
				word32 s5_512;
				word32 s6_513;
				word32 s7_514;
				word32 s9_515;
				word32 s10_516;
				word32 s11_517;
				word32 a0_518;
				word32 a4_519;
				word32 a5_520;
				word32 s4_521;
				word32 s1_522;
				word32 a0_523;
				word32 a1_524;
				word32 a2_525;
				word32 a3_526;
				word32 a4_527;
				word32 a5_528;
				word32 a7_529;
				word32 s2_530;
				word32 s4_531;
				word32 s5_532;
				word32 s6_533;
				word32 s7_534;
				word32 s8_535;
				word32 s9_536;
				word32 s10_537;
				word32 s11_538;
				word32 t4_539;
				word32 s0_540;
				word32 s1_541;
				word32 a0_542;
				word32 a5_543;
				word32 s3_544;
				word32 s4_545;
				word32 s5_546;
				word32 s6_547;
				word32 s7_548;
				word32 s9_549;
				word32 s10_550;
				word32 s11_551;
				word32 a0_552;
				word32 a4_553;
				word32 a5_554;
				word32 s4_555;
				word32 a0_556;
				word32 a1_557;
				word32 a2_558;
				word32 a5_559;
				word32 a7_560;
				word32 s2_561;
				word32 s3_562;
				word32 s4_563;
				word32 s5_564;
				word32 s6_565;
				word32 s7_566;
				word32 s8_567;
				word32 s9_568;
				word32 s10_569;
				word32 s11_570;
				word32 t4_571;
				ra_311 = dhcp_server_start(printf(sprintf(printf(sprintf(ra_311, (word32) a0_149 + 1, &g_t230899B8, dwLoc28_407, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_505, out s1_506, out a0_507, out a5_508, out s2_509, out s3_510, out s4_511, out s5_512, out s6_513, out s7_514, out s9_515, out s10_516, out s11_517), &g_t230865B8, a3_186, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_522, out a0_523, out a1_524, out a2_525, out a3_526, out a4_527, out a5_528, out a7_529, out s2_530, out s3_217, out s4_531, out s5_532, out s6_533, out s7_534, out s8_535, out s9_536, out s10_537, out s11_538, out t4_539), ip4addr_aton(fp + -52, fp + -60, out a0_518, out a3_186, out a4_519, out a5_520, out s4_521), s3_217 + -0x0648, dwLoc28_407, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_540, out s1_541, out a0_542, out a5_543, out s2_241, out s3_544, out s4_545, out s5_546, out s6_547, out s7_548, out s9_549, out s10_550, out s11_551), s2_241 + 1464, a3_256, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_282, out a0_556, out a1_557, out a2_558, out a3_278, out a4_279, out a5_559, out a7_560, out s2_561, out s3_562, out s4_563, out s5_564, out s6_565, out s7_566, out s8_567, out s9_568, out s10_569, out s11_570, out t4_571), ip4addr_aton(fp + -52, fp + -56, out a0_552, out a3_256, out a4_553, out a5_554, out s4_555), s1_282, a3_278, a4_279, mstatus_84, dwLoc2C, dwArg34, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0128, out a0_298, out a3_124);
				if (a0_298 == 0x00)
					return;
				a0_324 = (struct Eq_274 *) &g_t230865D0;
l23047DB0:
				word32 s1_572;
				word32 a0_573;
				word32 a1_574;
				word32 a2_575;
				word32 a3_576;
				word32 a4_577;
				word32 a5_578;
				word32 a7_579;
				word32 s2_580;
				word32 s3_581;
				word32 s4_582;
				word32 s5_583;
				word32 s6_584;
				word32 s7_585;
				word32 s8_586;
				word32 s9_587;
				word32 s10_588;
				word32 s11_589;
				word32 t4_590;
				printf(ra_311, a0_324, a3_124, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_572, out a0_573, out a1_574, out a2_575, out a3_576, out a4_577, out a5_578, out a7_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590);
				return;
			}
		}
	}
	a0_324 = (struct Eq_274 *) &g_t23086594;
	goto l23047DB0;
}

// 23047E3C: void tcpc_entry(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void tcpc_entry(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a2_515;
	Eq_2 a5_518;
	Eq_2 s5_471;
	Eq_2 s0_26 = g_t4200DFC0;
	g_t4200DFC0 = (word32) s0_26 + 1;
	Eq_2 a5_37;
	Eq_2 a3_41;
	Eq_2 a4_42;
	Eq_2 s1_45;
	word32 a0_763;
	word32 t4_777;
	word32 s11_776;
	word32 s6_771;
	word32 s7_772;
	word32 s8_773;
	word32 s9_774;
	word32 s10_775;
	word32 a7_766;
	word32 s2_767;
	word32 s3_768;
	word32 s4_769;
	word32 s5_770;
	word32 a1_764;
	word32 a2_765;
	Eq_2 ra_44 = printf(ra, &g_t2308661C, s0_26, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_45, out a0_763, out a1_764, out a2_765, out a3_41, out a4_42, out a5_37, out a7_766, out s2_767, out s3_768, out s4_769, out s5_770, out s6_771, out s7_772, out s8_773, out s9_774, out s10_775, out s11_776, out t4_777);
	word32 a0_60;
	Eq_2 a3_63;
	word32 s3_785;
	word32 s4_786;
	word32 s8_787;
	word32 a2_780;
	word32 a4_781;
	word32 a5_782;
	word32 a6_783;
	word32 s2_784;
	word32 a1_779;
	word32 s1_778;
	pvPortMalloc(ra_44, s1_45, 0x0400, a3_41, a4_42, a5_37, mstatus, dwLoc10, dwLoc0C, dwArg3C, dwArgE8, dwArg0128, out s1_778, out a0_60, out a1_779, out a2_780, out a3_63, out a4_781, out a5_782, out a6_783, out s2_784, out s3_785, out s4_786, out s8_787);
	if (a0_60 == 0x00)
	{
		word32 t4_809;
		word32 s9_806;
		word32 s10_807;
		word32 s11_808;
		word32 s6_803;
		word32 s7_804;
		word32 s8_805;
		word32 s2_800;
		word32 s3_801;
		word32 s4_802;
		word32 a1_796;
		word32 a3_797;
		word32 a4_798;
		word32 a7_799;
		word32 s1_794;
		word32 a0_795;
		printf(ra_44, &g_t23086650, a3_63, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_794, out a0_795, out a1_796, out a2_515, out a3_797, out a4_798, out a5_518, out a7_799, out s2_800, out s3_801, out s4_802, out s5_471, out s6_803, out s7_804, out s8_805, out s9_806, out s10_807, out s11_808, out t4_809);
	}
	else
	{
		Eq_2 a2_460;
		Eq_2 a5_463;
		Eq_2 s1_467;
		Eq_2 s5_90;
		word32 s2_792;
		word32 s3_793;
		word32 a4_791;
		word32 a3_790;
		word32 a1_788;
		word32 a2_789;
		Eq_2 a0_100 = lwip_socket(ra_44, 0x01, 0x06, a3_63, mstatus, dwLoc1C, dwArg18, dwArg58, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, out a1_788, out a2_789, out a3_790, out a4_791, out s2_792, out s3_793, out s5_90);
		if (a0_100 < 0x00)
		{
			word32 a4_821;
			word32 a3_820;
			word32 a1_819;
			word32 a0_818;
			word32 a7_822;
			word32 s2_823;
			word32 s3_824;
			word32 s4_825;
			word32 s6_826;
			word32 s7_827;
			word32 s8_828;
			word32 s9_829;
			word32 s10_830;
			word32 s11_831;
			word32 t4_832;
			printf(ra_44, &g_t23086684, a0_100, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_467, out a0_818, out a1_819, out a2_460, out a3_820, out a4_821, out a5_463, out a7_822, out s2_823, out s3_824, out s4_825, out s5_471, out s6_826, out s7_827, out s8_828, out s9_829, out s10_830, out s11_831, out t4_832);
		}
		else
		{
			Eq_2 a2_406;
			Eq_2 ra_410;
			Eq_2 s2_414;
			word32 a5_810;
			lwip_htons(33553240, out a5_810);
			Eq_2 a0_110;
			word32 a3_811;
			ipaddr_addr(s5_90, out a0_110, out a3_811);
			int32 a0_132;
			Eq_2 a3_135;
			word32 s4_817;
			word32 s3_816;
			word32 a2_813;
			word32 a4_814;
			word32 s2_815;
			word32 a1_812;
			lwip_connect(a0_100, fp + -64, mstatus, dwLoc1C, dwLoc08, a0_110, dwArg78, out a0_132, out a1_812, out a2_813, out a3_135, out a4_814, out s2_815, out s3_816, out s4_817);
			if (a0_132 < 0x00)
			{
				word32 s1_875;
				word32 a0_876;
				word32 a1_877;
				word32 a3_878;
				word32 a4_879;
				word32 a5_880;
				word32 a7_881;
				word32 s3_882;
				word32 s4_883;
				word32 s5_884;
				word32 s6_885;
				word32 s7_886;
				word32 s8_887;
				word32 s9_888;
				word32 s10_889;
				word32 s11_890;
				word32 t4_891;
				ra_410 = printf(ra_44, &g_t230866C8, a3_135, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_875, out a0_876, out a1_877, out a2_406, out a3_878, out a4_879, out a5_880, out a7_881, out s2_414, out s3_882, out s4_883, out s5_884, out s6_885, out s7_886, out s8_887, out s9_888, out s10_889, out s11_890, out t4_891);
			}
			else
			{
				Eq_2 s2_172;
				word32 s1_844;
				word32 a0_845;
				word32 a1_846;
				word32 a2_847;
				word32 a3_848;
				word32 a4_849;
				word32 a5_850;
				word32 a7_851;
				word32 s3_852;
				word32 s4_853;
				word32 s5_854;
				word32 s6_855;
				word32 s7_856;
				word32 s8_857;
				word32 s9_858;
				word32 s10_859;
				word32 s11_860;
				word32 t4_861;
				Eq_2 ra_168 = printf(ra_44, &g_t230866F4, a3_135, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_844, out a0_845, out a1_846, out a2_847, out a3_848, out a4_849, out a5_850, out a7_851, out s2_172, out s3_852, out s4_853, out s5_854, out s6_855, out s7_856, out s8_857, out s9_858, out s10_859, out s11_860, out t4_861);
				word32 a0_862;
				word32 a3_863;
				word32 s2_864;
				word32 s3_865;
				word32 s4_866;
				word32 s6_867;
				Eq_2 s1_198;
				lwip_setsockopt(s2_172, 0x06, 0x01, fp + -0x0044, mstatus, dwLoc4C, 0x01, s5, dwArg68, dwArg88, dwArgA8, dwArgC8, out s1_198, out a0_862, out a3_863, out s2_864, out s3_865, out s4_866, out s6_867);
				word32 t1_868;
				word32 a0_869;
				word32 a1_870;
				word32 a2_871;
				word32 a3_872;
				word32 a4_873;
				word32 a5_874;
				Eq_2 ra_221 = memset(ra_168, s1_198, 0x00, 0x0400, out t1_868, out a0_869, out a1_870, out a2_871, out a3_872, out a4_873, out a5_874);
				word32 s7_225 = 0x23086000;
				while (true)
				{
					struct Eq_274 * a0_392;
					Eq_2 s2_250;
					word32 s0_967;
					word32 s1_968;
					word32 a0_969;
					word32 a1_970;
					word32 a2_971;
					word32 a3_972;
					word32 a4_973;
					word32 a5_974;
					word32 a7_975;
					word32 s3_976;
					word32 s4_977;
					word32 s5_978;
					word32 s6_979;
					word32 s7_980;
					word32 s8_981;
					word32 s9_982;
					word32 s10_983;
					word32 s11_984;
					Eq_2 ra_245 = snprintf(ra_221, s1_198, 0x0400, s7_225 + 1844, s6, dwLoc18, dwArg14, dwArg30, 0x01, dwArg58, dwArg7C, out s0_967, out s1_968, out a0_969, out a1_970, out a2_971, out a3_972, out a4_973, out a5_974, out a7_975, out s2_250, out s3_976, out s4_977, out s5_978, out s6_979, out s7_980, out s8_981, out s9_982, out s10_983, out s11_984);
					word32 s8_280;
					word32 a3_985;
					Eq_2 a0_265 = lwip_write(s2_250, mstatus, dwLoc28, dwArg18, dwArg58, out a3_985, out s8_280);
					Eq_2 a3_288 = a0_265;
					if (a0_265 < 0x00)
						break;
					Eq_2 s1_302;
					Eq_2 s2_305;
					Eq_2 s3_306;
					Eq_2 s4_307;
					Eq_2 a0_318;
					word32 s6_334;
					word32 a0_901;
					word32 a1_902;
					word32 a2_903;
					word32 a3_904;
					word32 a4_905;
					word32 a5_906;
					word32 a7_907;
					word32 s5_908;
					word32 s6_909;
					word32 s7_910;
					word32 s8_911;
					word32 s9_912;
					word32 s10_913;
					word32 s11_914;
					word32 t4_915;
					word32 s0_916;
					word32 a3_917;
					ra_245 = lwip_read(printf(ra_245, s8_280 + 0x0774, a0_265, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_302, out a0_901, out a1_902, out a2_903, out a3_904, out a4_905, out a5_906, out a7_907, out s2_305, out s3_306, out s4_307, out s5_908, out s6_909, out s7_910, out s8_911, out s9_912, out s10_913, out s11_914, out t4_915), s1_302, s2_305, s1_302, 0x0400, s2_305, s3_306, s4_307, mstatus, dwLoc48, s8, s6, dwLoc28, dwLoc18, dwArg08, dwArg18, a0_110, s5, dwArgE8, out s0_916, out a0_318, out a3_917, out s6_334, out mstatus);
					a3_288 = a0_318;
					if (a0_318 < 0x00)
					{
						a0_392 = (struct Eq_274 *) &g_t230867B0;
						goto l23047F9A;
					}
					Eq_2 a5_351;
					Eq_2 a2_354;
					Eq_2 a3_355;
					Eq_2 a4_356;
					word32 s1_926;
					word32 a0_927;
					word32 a1_928;
					word32 a7_929;
					word32 s2_930;
					word32 s3_931;
					word32 s4_932;
					word32 s5_933;
					word32 s6_934;
					word32 s8_935;
					word32 s9_936;
					word32 s10_937;
					word32 s11_938;
					word32 t4_939;
					ra_221 = printf(ra_245, s6_334 + 2020, a0_318, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_926, out a0_927, out a1_928, out a2_354, out a3_355, out a4_356, out a5_351, out a7_929, out s2_930, out s3_931, out s4_932, out s5_933, out s6_934, out s7_225, out s8_935, out s9_936, out s10_937, out s11_938, out t4_939);
					word32 a0_940;
					word32 a1_941;
					word32 a2_942;
					word32 a3_943;
					word32 a4_944;
					word32 a5_945;
					word32 s2_946;
					word32 s3_947;
					word32 s4_948;
					word32 s8_949;
					vTaskDelay(1000, a2_354, a3_355, a4_356, a5_351, mstatus, s0, dwLoc28, dwArgE8, dwArg0128, out s1_198, out a0_940, out a1_941, out a2_942, out a3_943, out a4_944, out a5_945, out s2_946, out s3_947, out s4_948, out s8_949);
				}
				a0_392 = (struct Eq_274 *) &g_t23086740;
l23047F9A:
				word32 s1_950;
				word32 a0_951;
				word32 a1_952;
				word32 a3_953;
				word32 a4_954;
				word32 a5_955;
				word32 a7_956;
				word32 s3_957;
				word32 s4_958;
				word32 s5_959;
				word32 s6_960;
				word32 s7_961;
				word32 s8_962;
				word32 s9_963;
				word32 s10_964;
				word32 s11_965;
				word32 t4_966;
				ra_410 = printf(ra_245, a0_392, a3_288, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_950, out a0_951, out a1_952, out a2_406, out a3_953, out a4_954, out a5_955, out a7_956, out s2_414, out s3_957, out s4_958, out s5_959, out s6_960, out s7_961, out s8_962, out s9_963, out s10_964, out s11_965, out t4_966);
			}
			word32 a0_918;
			word32 a1_919;
			word32 a3_920;
			word32 a4_921;
			word32 s2_922;
			word32 s3_923;
			word32 s4_924;
			word32 s6_925;
			lwip_close(ra_410, s2_414, a2_406, mstatus, dwLoc08, a0_110, dwArg68, dwArg78, dwArg88, dwArgD8, out s1_467, out a0_918, out a1_919, out a2_460, out a3_920, out a4_921, out a5_463, out s2_922, out s3_923, out s4_924, out s5_471, out s6_925);
		}
		word32 s0_892;
		word32 s1_893;
		word32 a0_894;
		word32 a1_895;
		word32 a3_896;
		word32 a4_897;
		word32 a6_898;
		word32 s4_899;
		word32 t3_900;
		vPortFree(s1_467, a2_460, a5_463, mstatus, dwArg0108, dwArg0148, out s0_892, out s1_893, out a0_894, out a1_895, out a2_515, out a3_896, out a4_897, out a5_518, out a6_898, out s4_899, out t3_900);
	}
	word32 s0_833;
	word32 s1_834;
	word32 a0_835;
	word32 a1_836;
	word32 a2_837;
	word32 a3_838;
	word32 a4_839;
	word32 a5_840;
	word32 a6_841;
	word32 s4_842;
	word32 t3_843;
	vPortFree(s5_471, a2_515, a5_518, mstatus, dwArg0108, dwArg0148, out s0_833, out s1_834, out a0_835, out a1_836, out a2_837, out a3_838, out a4_839, out a5_840, out a6_841, out s4_842, out t3_843);
}

