pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23047FEE: void tcpclient_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0164)
void tcpclient_cmd(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0164)
{
	if (a2 != 0x02)
	{
		word32 s1_254;
		word32 a0_255;
		word32 a1_256;
		word32 a2_257;
		word32 a3_258;
		word32 a4_259;
		word32 a5_260;
		word32 a7_261;
		word32 s2_262;
		word32 s3_263;
		word32 s4_264;
		word32 s5_265;
		word32 s6_266;
		word32 s7_267;
		word32 s8_268;
		word32 s9_269;
		word32 s10_270;
		word32 s11_271;
		word32 t4_272;
		printf(ra, &g_t23086820, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260, out a7_261, out s2_262, out s3_263, out s4_264, out s5_265, out s6_266, out s7_267, out s8_268, out s9_269, out s10_270, out s11_271, out t4_272);
	}
	else
	{
		Eq_2 a3_16;
		Eq_2 a4_17;
		Eq_2 a5_18;
		Eq_2 a0_23;
		Eq_2 a3_26;
		word32 a1_243;
		word32 a2_244;
		word32 s1_245;
		word32 a2_246;
		word32 a4_247;
		word32 a5_248;
		word32 a6_249;
		word32 s2_250;
		word32 s3_251;
		word32 s4_252;
		word32 s8_253;
		union Eq_133241 * a1_24;
		pvPortMalloc(ra, *((word32) a0 + 4), (word32) strlen(a0, out a1_243, out a2_244, out a3_16, out a4_17, out a5_18) + 4, a3_16, a4_17, a5_18, mstatus, dwArg10, dwArg14, dwArg5C, dwArg0108, dwArg0148, out s1_245, out a0_23, out a1_24, out a2_246, out a3_26, out a4_247, out a5_248, out a6_249, out s2_250, out s3_251, out s4_252, out s8_253);
		if (a0_23 == 0x00)
		{
			word32 s1_289;
			word32 a0_290;
			word32 a2_291;
			word32 a3_292;
			word32 a4_293;
			word32 a5_294;
			word32 a7_295;
			word32 s2_296;
			word32 s3_297;
			word32 s4_298;
			word32 s5_299;
			word32 s6_300;
			word32 s7_301;
			word32 s8_302;
			word32 s9_303;
			word32 s10_304;
			word32 s11_305;
			word32 t4_306;
			ra = printf(ra, &g_t23086858, a3_26, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_289, out a0_290, out a1_24, out a2_291, out a3_292, out a4_293, out a5_294, out a7_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302, out s9_303, out s10_304, out s11_305, out t4_306);
		}
		word32 a4_273;
		word32 a5_274;
		strcpy(a0_23, a1_24, out a4_273, out a5_274);
		g_b4200DFBC = (byte) ((word32) g_b4200DFBC + 1);
		Eq_2 a4_86;
		Eq_2 a5_87;
		word32 s0_90;
		Eq_2 s1_91;
		Eq_2 s4_96;
		word32 a0_275;
		word32 a1_276;
		word32 a2_277;
		word32 a3_278;
		word32 a7_279;
		word32 s2_280;
		word32 s3_281;
		word32 s5_282;
		word32 s6_283;
		word32 s7_284;
		word32 s8_285;
		word32 s9_286;
		word32 s10_287;
		word32 s11_288;
		aos_task_new(snprintf(ra, fp + -48, 32, &g_t23086880, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_90, out s1_91, out a0_275, out a1_276, out a2_277, out a3_278, out a4_86, out a5_87, out a7_279, out s2_280, out s3_281, out s4_96, out s5_282, out s6_283, out s7_284, out s8_285, out s9_286, out s10_287, out s11_288), s1_91, 0x23047E3C, s0_90, 0x00FFF800, a4_86, a5_87, s4_96, mstatus, dwLoc2C, dwLoc10, dwLoc0C, dwArg78, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0164);
	}
}

// 23048076: void network_netutils_tcpclinet_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_tcpclinet_cli_register()
{
}

// 2304807A: void TCP_Server(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
void TCP_Server(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	uint16 wLoc9E_1986 = SLICE(dwLocA0, uint16, 16);
	Eq_2 ra_1098;
	Eq_2 s3_156;
	Eq_2 a0_39;
	Eq_2 a3_108;
	word32 a4_2036;
	word32 a0_2033;
	word32 a4_2030;
	word32 a1_2027;
	word32 a5_2024;
	word32 a2_2021;
	word32 t1_2018;
	word32 a3_2015;
	word32 a1_2013;
	word32 a3_2008;
	word32 s8_2003;
	word32 a5_1998;
	word32 s1_1993;
	word32 a2_2035;
	word32 a3_2029;
	word32 a0_2026;
	word32 a4_2023;
	word32 a1_2020;
	word32 a5_2017;
	word32 t1_2032;
	word32 a5_2031;
	word32 a2_2014;
	word32 a2_2028;
	word32 t1_2025;
	word32 a3_2022;
	word32 a0_2019;
	word32 a4_2016;
	word32 a5_2037;
	word32 a1_2034;
	word32 t1_2011;
	word32 a0_2012;
	word32 a4_2009;
	word32 a5_2010;
	word32 a1_2006;
	word32 a2_2007;
	word32 t1_2004;
	word32 a0_2005;
	word32 s3_2001;
	word32 s4_2002;
	word32 a6_1999;
	word32 s2_2000;
	word32 a3_1996;
	word32 a4_1997;
	word32 a1_1994;
	word32 a2_1995;
	Eq_2 ra_111 = memset(memset(memset(memset(memset(ra, a0_39, 0x00, (word32) pvPortMalloc(ra, s1, 0x02FFF800, a3, a4, 0x01, mstatus, dwLocA0, dwLoc9C, dwLoc54, dwArg58, dwArg98, out s1_1993, out a0_39, out a1_1994, out a2_1995, out a3_1996, out a4_1997, out a5_1998, out a6_1999, out s2_2000, out s3_2001, out s4_2002, out s8_2003) - 0x0800, out t1_2004, out a0_2005, out a1_2006, out a2_2007, out a3_2008, out a4_2009, out a5_2010), (char *) fp - 84, 0x00, 0x14, out t1_2011, out a0_2012, out a1_2013, out a2_2014, out a3_2015, out a4_2016, out a5_2017), (char *) fp - 0x007C, 0x00, 0x14, out t1_2018, out a0_2019, out a1_2020, out a2_2021, out a3_2022, out a4_2023, out a5_2024), (char *) fp - 0x0068, 0x00, 0x14, out t1_2025, out a0_2026, out a1_2027, out a2_2028, out a3_2029, out a4_2030, out a5_2031), (char *) fp - 144, 0x00, 0x14, out t1_2032, out a0_2033, out a1_2034, out a2_2035, out a3_108, out a4_2036, out a5_2037);
	Eq_2 a3_119;
	word32 s3_2042;
	word32 a2_2039;
	word32 s2_2041;
	word32 a1_2038;
	word32 s5_2043;
	word32 a4_2040;
	if (lwip_socket(ra_111, 0x01, 0x06, a3_108, mstatus, dwLocAC, s2, dwLoc38, s1, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, out a1_2038, out a2_2039, out a3_119, out a4_2040, out s2_2041, out s3_2042, out s5_2043) < 0x00)
	{
		Eq_2 a5_168;
		Eq_2 a2_171;
		Eq_2 s4_181;
		word32 s5_2070;
		word32 s7_2072;
		word32 s8_2073;
		word32 s10_2075;
		word32 s9_2074;
		word32 s6_2071;
		word32 s11_2076;
		word32 t4_2077;
		word32 a0_2063;
		word32 s1_2062;
		word32 s2_2068;
		word32 s3_2069;
		word32 a4_2066;
		word32 a7_2067;
		word32 a1_2064;
		word32 a3_2065;
		ra_1098 = printf(ra_111, &g_t23086888, a3_119, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, out s1_2062, out a0_2063, out a1_2064, out a2_171, out a3_2065, out a4_2066, out a5_168, out a7_2067, out s2_2068, out s3_2069, out s4_181, out s5_2070, out s6_2071, out s7_2072, out s8_2073, out s9_2074, out s10_2075, out s11_2076, out t4_2077);
		Eq_2 a2_190;
		Eq_2 a3_191;
		Eq_2 a4_192;
		Eq_2 a5_193;
		word32 a1_2081;
		word32 s4_2083;
		word32 t3_2084;
		word32 a6_2082;
		word32 a0_2080;
		word32 s0_2078;
		word32 s1_2079;
		vPortFree(s4_181, a2_171, a5_168, mstatus, dwArg78, dwArgB8, out s0_2078, out s1_2079, out a0_2080, out a1_2081, out a2_190, out a3_191, out a4_192, out a5_193, out a6_2082, out s4_2083, out t3_2084);
		s3_156 = vTaskDelete(0x00, a2_190, a3_191, a4_192, a5_193, mstatus);
	}
	else
	{
		word32 s9_2058;
		word32 a1_2046;
		word32 s1_2044;
		word32 a0_2045;
		word32 s11_2060;
		word32 t4_2061;
		word32 s10_2059;
		word32 a3_2048;
		word32 a4_2049;
		word32 a7_2051;
		word32 a5_2050;
		word32 a2_2047;
		word32 s7_2056;
		word32 s8_2057;
		word32 s5_2054;
		word32 s6_2055;
		word32 s2_2052;
		word32 s4_2053;
		ra_1098 = printf(ra_111, &g_t230868A0, a3_119, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, out s1_2044, out a0_2045, out a1_2046, out a2_2047, out a3_2048, out a4_2049, out a5_2050, out a7_2051, out s2_2052, out s3_156, out s4_2053, out s5_2054, out s6_2055, out s7_2056, out s8_2057, out s9_2058, out s10_2059, out s11_2060, out t4_2061);
	}
	struct Eq_274 * a0_1285;
	word32 a0_227;
	Eq_2 s3_238;
	word32 s4_2091;
	word32 s6_2092;
	word32 s1_2089;
	word32 s2_2090;
	Eq_2 a3_1293;
	Eq_2 s0_235 = lwip_setsockopt(s3_156, 0x00FFFFFF, 0x04, (char *) fp - 0x00CC, mstatus, dwLocDC, dwLoc5C, dwLoc48, dwLoc28, s9, dwArg18, dwArg38, out s1_2089, out a0_227, out a3_1293, out s2_2090, out s3_238, out s4_2091, out s6_2092);
	if (a0_227 == ~0x00)
		a0_1285 = (struct Eq_274 *) &g_t230868AC;
	else
	{
		word32 a5_2085;
		lwip_htons((word32) s0_235 + 0x041E, out a5_2085);
		word32 a3_2086;
		word32 a4_2087;
		word32 a5_2088;
		Eq_2 a0_258 = lwip_htonl(0x00, out a3_2086, out a4_2087, out a5_2088);
		int32 a0_266;
		Eq_2 s3_277;
		lwip_bind(s3_238, (char *) fp - 0x00B0, mstatus, dwLocAC, dwLoc98, 0x01, dwLoc18, out a0_266, out a3_1293, out s3_277);
		dwLoc48 = a0_258;
		if (a0_266 < 0x00)
			a0_1285 = (struct Eq_274 *) &g_t230868C0;
		else
		{
			int32 a0_291;
			word32 s2_2093;
			lwip_listen(s3_277, 0x05, mstatus, dwLoc9C, s10, a0_258, s9, out a0_291, out a3_1293, out s2_2093);
			if (a0_291 >= 0x00)
			{
				Eq_2 a3_322;
				Eq_2 s5_356;
				word32 s11_2161;
				word32 t4_2162;
				word32 s10_2160;
				word32 s6_2156;
				word32 a7_2152;
				word32 a2_2148;
				word32 t4_2144;
				word32 s8_2140;
				word32 s4_2136;
				word32 s1_2127;
				word32 s8_2158;
				word32 s7_2157;
				word32 s9_2159;
				word32 s3_2154;
				word32 s2_2153;
				word32 s4_2155;
				word32 a4_2150;
				word32 a3_2149;
				word32 a5_2151;
				word32 a0_2146;
				word32 s1_2145;
				word32 a1_2147;
				word32 s10_2142;
				word32 s9_2141;
				word32 s11_2143;
				word32 s6_2138;
				word32 s5_2137;
				word32 s7_2139;
				word32 a0_2128;
				word32 s2_2134;
				word32 s3_2135;
				word32 a4_2131;
				word32 a5_2132;
				word32 a7_2133;
				word32 a1_2129;
				word32 a2_2130;
				ra_1098 = printf(printf(ra_1098, &g_t230868E0, a3_1293, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2127, out a0_2128, out a1_2129, out a2_2130, out a3_322, out a4_2131, out a5_2132, out a7_2133, out s2_2134, out s3_2135, out s4_2136, out s5_2137, out s6_2138, out s7_2139, out s8_2140, out s9_2141, out s10_2142, out s11_2143, out t4_2144), &g_t2308690C, a3_322, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2145, out a0_2146, out a1_2147, out a2_2148, out a3_2149, out a4_2150, out a5_2151, out a7_2152, out s2_2153, out s3_2154, out s4_2155, out s5_356, out s6_2156, out s7_2157, out s8_2158, out s9_2159, out s10_2160, out s11_2161, out t4_2162);
				dwLocD8.u0 = 0x10;
				word32 a5_2163;
				Eq_2 a0_365 = xTaskGetTickCount(out a5_2163);
				int32 s0_368;
				for (s0_368 = 0x00; s0_368 != 0x14; s0_368 += 0x04)
				{
					((char *) fp - 0x0068)[s0_368] = (char) a0_365;
					word32 a1_2164;
					word32 a5_2167;
					word32 a3_2165;
					word32 a4_2166;
					Eq_2 a2_1094;
					*atoi(s5_356, out a1_2164, out a2_1094, out a3_2165, out a4_2166, out a5_2167) = (char *) fp - 144 + s0_368;
				}
				while (true)
				{
					ui32 s0_1389 = 0x01;
					do
					{
						int32 a5_407;
						for (a5_407 = 0x00; a5_407 != 0x08; ++a5_407)
							((char *) fp - 200)[a5_407] = 0x00;
						Eq_2 s8_416 = s3;
						union Eq_2 * s10_427 = null;
						union Eq_2 ** s9_1391 = (union Eq_2 **) 999;
						union Eq_2 * s2_429 = (union Eq_2 *) 0x14;
						do
						{
							word32 s11_433 = fp + -84 + s10_427;
							byte bLoc8D_1828 = SLICE(dwLoc90, byte, 24);
							Eq_2 a5_435 = *s11_433;
							if (a5_435 != 0x00)
							{
								struct Eq_237843 * a4_439 = (char *) fp - 64 + ((a5_435 >> 0x05) << 2);
								a4_439->dw0F78 = s0_1389 << a5_435 | a4_439->dwFFFFFF78;
								word32 a5_2168;
								Eq_2 a0_445 = xTaskGetTickCount(out a5_2168);
								word32 a5_451 = a0_445 - (fp + -0x0068);
								Mem452[a5_451 + 0x00:word32] = fp + -0x007C + s10_427;
								if (s9_1391 < a5_451)
								{
									*a0_445 = dwLoc68;
									word24 nLoc90_1827 = SLICE(dwLoc90, word24, 8);
									dwLoc90 = SEQ(bLoc8D_1828, nLoc90_1827);
									dwLoc90 = SEQ(bLoc8D_1828, nLoc90_1827);
									if (fp <= (union Eq_2 *) ~0x90)
									{
										Eq_2 s5_479;
										word32 a4_2174;
										word32 s2_2176;
										word32 a5_2175;
										word32 s6_2179;
										word32 s3_2177;
										word32 s4_2178;
										word32 a0_2170;
										word32 s1_2169;
										word32 a3_2173;
										word32 a1_2171;
										word32 a2_2172;
										lwip_close(ra_1098, *s11_433, a2_1094, mstatus, dwLoc98, 0x01, dwLoc28, dwLoc18, s9, dwArg48, out s1_2169, out a0_2170, out a1_2171, out a2_2172, out a3_2173, out a4_2174, out a5_2175, out s2_2176, out s3_2177, out s4_2178, out s5_479, out s6_2179);
										word32 a4_494;
										word32 a1_2180;
										word32 a3_2182;
										word32 a2_2181;
										word32 a5_2183;
										Eq_2 a0_490 = atoi(s5_479, out a1_2180, out a2_2181, out a3_2182, out a4_494, out a5_2183);
										Eq_2 a5_505 = *s11_433;
										*s11_433 = (union Eq_2 *) 0x00;
										*a0_490 = a4_494;
										word32 a4_512 = (a5_505 >>u 0x05 << 2) + (fp + -64);
										Eq_2 a3_513 = a4_512->tFFFFFF78;
										a4_512->dw0F78 = ~(dwLoc1C << a5_505) & a3_513;
										dwLocDC = dwLoc90;
										s0_1389 = dwLoc1C;
										word32 s4_2192;
										word32 a1_2186;
										word32 s6_2194;
										word32 s5_2193;
										word32 t4_2197;
										word32 s7_2195;
										word32 s11_2196;
										word32 a4_2188;
										word32 a3_2187;
										word32 s3_2191;
										word32 a5_2189;
										word32 a7_2190;
										word32 a0_2185;
										word32 s1_2184;
										ra_1098 = printf(ra_1098, &g_t23086928, a3_513, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2184, out a0_2185, out a1_2186, out a2_1094, out a3_2187, out a4_2188, out a5_2189, out a7_2190, out s2_429, out s3_2191, out s4_2192, out s5_2193, out s6_2194, out s7_2195, out s8_416, out s9_1391, out s10_427, out s11_2196, out t4_2197);
									}
								}
							}
							s10_427 = (union Eq_2 *) ((char *) s10_427 + 4);
						} while (s10_427 != s2_429);
						int32 a0_556;
						word32 s2_2198;
						Eq_2 a5_561;
						struct Eq_238012 * a4_560;
						Eq_2 s3_570;
						Eq_2 s1_1395;
						Eq_2 s4_1418;
						ra_1098 = lwip_select((word32) s8_416 + 1, fp + -200, 0x00, 0x00, mstatus, dwLocDC, dwLoc68, 0x01, dwLoc28, dwLoc18, s9, dwArg24, dwArg28, dwArg38, out s0_1389, out s1_1395, out a0_556, out a2_1094, out a3_1293, out a4_560, out a5_561, out s2_2198, out s3_570, out s4_1418);
						if (a0_556 < 0x00)
						{
							a0_1285 = (struct Eq_274 *) &g_t23086948;
							goto l23048124;
						}
					} while (a0_556 == 0x00);
					word32 s6_585;
					Eq_2 s7_1416 = 0x02FFF800;
					for (s6_585 = 0x00; s6_585 != 0x05; ++s6_585)
					{
						if (a5_561 != s3_570)
						{
							a4_560 = Mem588[(a5_561 >>u 0x05 << 2) + (fp + -64) + -0x0088:int32];
							a3_1293 = fp + -64;
							if ((0x01 << a5_561 & a4_560) == 0x00)
								goto l2304837E;
							word32 s1_839;
							Eq_2 s0_870;
							word32 a5_2199;
							xTaskGetTickCount(out a5_2199);
							Eq_2 a0_609;
							int32 a0_624;
							Eq_2 a3_627;
							Eq_2 s5_639;
							ui32 s6_640;
							word32 s0_2206;
							word32 s2_2209;
							word32 s1_2207;
							word32 a2_2208;
							word32 s8_2212;
							word32 s9_2213;
							word32 s3_2210;
							word32 s4_2211;
							word32 a4_2204;
							word32 a5_2205;
							word32 a1_2201;
							word32 a2_2202;
							word32 a3_2203;
							word32 t1_2200;
							Eq_2 ra_633 = lwip_recv(memset(ra_1098, s4_1418, 0x00, s7_1416, out t1_2200, out a0_609, out a1_2201, out a2_2202, out a3_2203, out a4_2204, out a5_2205), s1_1395, a0_609, s4_1418, s7_1416, 0x00, 0x01, s3_570, s4_1418, mstatus, 0x10, 0x00, dwLocC8, dwLocB8, dwLocA8, s10, s2, 0x01, a0_258, dwArg58, out s0_2206, out s1_2207, out a0_624, out a2_2208, out a3_627, out s2_2209, out s3_2210, out s4_2211, out s5_639, out s6_640, out s8_2212, out s9_2213, out mstatus);
							if (a0_624 <= 0x00)
							{
								Eq_2 a0_884;
								Eq_2 a2_888;
								union Eq_2 * s10_894;
								word32 s4_2268;
								word32 s5_2269;
								word32 s6_2270;
								word32 s11_2273;
								word32 s8_2271;
								word32 s9_2272;
								word32 t4_2274;
								word32 s3_2267;
								word32 s1_2260;
								word32 s2_2266;
								word32 a4_2263;
								word32 a5_2264;
								word32 a7_2265;
								word32 a1_2261;
								word32 a3_2262;
								ra_1098 = printf(ra_633, &g_t23086958, a3_627, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2260, out a0_884, out a1_2261, out a2_888, out a3_2262, out a4_2263, out a5_2264, out a7_2265, out s2_2266, out s3_2267, out s4_2268, out s5_2269, out s6_2270, out s7_1416, out s8_2271, out s9_2272, out s10_894, out s11_2273, out t4_2274);
								ui32 s2_917;
								Eq_2 s5_920;
								word32 a5_2280;
								word32 a4_2279;
								word32 a1_2276;
								word32 a2_2277;
								word32 a3_2278;
								word32 a0_2275;
								lwip_close(ra_1098, a0_884, a2_888, mstatus, dwLoc98, 0x01, dwLoc28, dwLoc18, s9, dwArg48, out s1_839, out a0_2275, out a1_2276, out a2_2277, out a3_2278, out a4_2279, out a5_2280, out s2_917, out s3_570, out s4_1418, out s5_920, out s6_585);
								word32 a5_947 = fp + -144 + s10_894;
								word32 a1_2281;
								word32 a3_2282;
								word32 a4_2283;
								word32 a5_2284;
								*atoi(s5_920, out a1_2281, out a2_1094, out a3_2282, out a4_2283, out a5_2284) = a5_947;
								a4_560 = (a5_947 >>u 0x05 << 2) + (fp + -64);
								s0_870 = *a5_947;
								a4_560[0x0F78] = (struct Eq_238012) (~(s2_917 << a5_947) & a4_560->dwFFFFFF78);
								goto l23048378;
							}
							word32 a5_671 = fp + -144 + (s6_640 << 0x02);
							Eq_2 a3_657;
							union Eq_2 ** a4_658;
							word32 a2_2215;
							word32 a5_2216;
							word32 a1_2214;
							*atoi(s5_639, out a1_2214, out a2_2215, out a3_657, out a4_658, out a5_2216) = a5_671;
							Mem676[a4_658 + 0x00:word32] = fp + -0x0068 + (s6_640 << 0x02);
							Eq_2 a3_686;
							Eq_2 a0_706;
							word32 a5_2222;
							word32 s2_2242;
							word32 s3_2243;
							word32 s4_2244;
							word32 s7_2247;
							word32 s5_2245;
							word32 s6_2246;
							word32 s10_2250;
							word32 s11_2251;
							word32 t4_2252;
							word32 s8_2248;
							word32 s9_2249;
							word32 s7_2229;
							word32 a7_2241;
							word32 s8_2230;
							word32 s9_2231;
							word32 t4_2234;
							word32 s10_2232;
							word32 s11_2233;
							word32 a5_2240;
							word32 a2_2237;
							word32 a3_2238;
							word32 a4_2239;
							word32 s1_2235;
							word32 a1_2236;
							word32 s5_2227;
							word32 s6_2228;
							word32 s3_2225;
							word32 s4_2226;
							word32 a7_2223;
							word32 s2_2224;
							word32 a4_2221;
							word32 a1_2219;
							word32 a2_2220;
							word32 s1_2217;
							word32 a0_2218;
							Eq_2 ra_714 = printf(printf(ra_633, &g_t2308696C, a3_657, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2217, out a0_2218, out a1_2219, out a2_2220, out a3_686, out a4_2221, out a5_2222, out a7_2223, out s2_2224, out s3_2225, out s4_2226, out s5_2227, out s6_2228, out s7_2229, out s8_2230, out s9_2231, out s10_2232, out s11_2233, out t4_2234), &g_t230867A8, a3_686, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2235, out a0_706, out a1_2236, out a2_2237, out a3_2238, out a4_2239, out a5_2240, out a7_2241, out s2_2242, out s3_2243, out s4_2244, out s5_2245, out s6_2246, out s7_2247, out s8_2248, out s9_2249, out s10_2250, out s11_2251, out t4_2252);
							int32 a0_732;
							Eq_2 a3_735;
							word32 s3_2255;
							word32 s4_2256;
							word32 s5_2257;
							word32 s8_2258;
							word32 mstatus_2259;
							word32 s2_2254;
							word32 a2_2253;
							lwip_send(a0_706, 0x00, mstatus, dwLocB8, s2, dwLoc38, out a0_732, out a2_2253, out a3_735, out s2_2254, out s3_2255, out s4_2256, out s5_2257, out s8_2258, out mstatus_2259);
							dwLocDC = a5_671;
							if (a0_732 <= 0x00)
							{
								Eq_2 a0_807;
								Eq_2 a2_811;
								word32 s5_2323;
								word32 s6_2324;
								word32 s8_2325;
								word32 s11_2328;
								word32 s9_2326;
								word32 s10_2327;
								word32 t4_2329;
								word32 s4_2322;
								word32 a1_2315;
								word32 s1_2314;
								word32 s3_2321;
								word32 a5_2318;
								word32 a7_2319;
								word32 s2_2320;
								word32 a3_2316;
								word32 a4_2317;
								ra_1098 = printf(ra_714, &g_t2307D9E4, a3_735, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2314, out a0_807, out a1_2315, out a2_811, out a3_2316, out a4_2317, out a5_2318, out a7_2319, out s2_2320, out s3_2321, out s4_2322, out s5_2323, out s6_2324, out s7_1416, out s8_2325, out s9_2326, out s10_2327, out s11_2328, out t4_2329);
								ui32 s2_840;
								Eq_2 s5_843;
								word32 a5_2335;
								word32 a4_2334;
								word32 a1_2331;
								word32 a2_2332;
								word32 a3_2333;
								word32 a0_2330;
								lwip_close(ra_1098, a0_807, a2_811, mstatus, dwLoc98, 0x01, dwLoc28, dwLoc18, s9, dwArg48, out s1_839, out a0_2330, out a1_2331, out a2_2332, out a3_2333, out a4_2334, out a5_2335, out s2_840, out s3_570, out s4_1418, out s5_843, out s6_585);
								uint32 a4_858;
								word32 a5_859;
								word32 a3_2337;
								word32 a1_2336;
								*atoi(s5_843, out a1_2336, out a2_1094, out a3_2337, out a4_858, out a5_859) = a5_859;
								word32 a5_876 = (a4_858 >>u 0x05 << 2) + (fp + -64);
								a4_560 = a5_876->ptrFFFFFF78;
								a5_876->dw0F78 = ~(s2_840 << a4_858) & a4_560;
								s0_870 = s3;
l23048378:
								*s0_870 = 0x00;
								a3_1293 = fp + -64;
								s1_1395 = s1_839 + ~0x00;
							}
							else
							{
								Eq_2 a3_764;
								word32 s9_2310;
								word32 s10_2311;
								word32 s11_2312;
								word32 t4_2313;
								word32 s8_2309;
								word32 t4_2302;
								word32 a0_2303;
								word32 a5_2305;
								word32 a1_2304;
								word32 s5_2308;
								word32 a7_2306;
								word32 s2_2307;
								word32 s11_2301;
								word32 s4_2294;
								word32 s5_2295;
								word32 s7_2297;
								word32 s6_2296;
								word32 s10_2300;
								word32 s8_2298;
								word32 s9_2299;
								word32 s3_2293;
								word32 a0_2286;
								word32 s1_2285;
								word32 s2_2292;
								word32 a4_2289;
								word32 a5_2290;
								word32 a7_2291;
								word32 a1_2287;
								word32 a2_2288;
