pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
								ra_1098 = printf(printf(ra_714, &g_t230869A0, a3_735, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2285, out a0_2286, out a1_2287, out a2_2288, out a3_764, out a4_2289, out a5_2290, out a7_2291, out s2_2292, out s3_2293, out s4_2294, out s5_2295, out s6_2296, out s7_2297, out s8_2298, out s9_2299, out s10_2300, out s11_2301, out t4_2302), &g_t230727FC, a3_764, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_1395, out a0_2303, out a1_2304, out a2_1094, out a3_1293, out a4_560, out a5_2305, out a7_2306, out s2_2307, out s3_570, out s4_1418, out s5_2308, out s6_585, out s7_1416, out s8_2309, out s9_2310, out s10_2311, out s11_2312, out t4_2313);
							}
						}
l2304837E:
						a5_561.u0 = 0x05;
					}
					if ((a4_560 & 0x05) != 0x00)
					{
						int32 a0_991;
						Eq_2 a3_994;
						Eq_2 ra_1000 = lwip_accept(ra_1098, s3_570, a3_1293, mstatus, dwLocDC, 0x00, s2, 0x01, dwLoc3C, dwLoc38, dwLoc18, s1, out a0_991, out a3_994, out mstatus);
						if (a0_991 <= 0x00)
						{
							word32 t4_2407;
							word32 s10_2405;
							word32 s11_2406;
							word32 s3_2398;
							word32 s4_2399;
							word32 s6_2401;
							word32 s7_2402;
							word32 s9_2404;
							word32 s8_2403;
							word32 s5_2400;
							word32 a0_2391;
							word32 a1_2392;
							word32 a4_2394;
							word32 a5_2395;
							word32 s2_2397;
							word32 a7_2396;
							word32 a3_2393;
							word32 s1_2390;
							ra_1098 = printf(ra_1000, &g_t230869D0, a3_994, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2390, out a0_2391, out a1_2392, out a2_1094, out a3_2393, out a4_2394, out a5_2395, out a7_2396, out s2_2397, out s3_2398, out s4_2399, out s5_2400, out s6_2401, out s7_2402, out s8_2403, out s9_2404, out s10_2405, out s11_2406, out t4_2407);
						}
						else
						{
							word32 s8_2352;
							word32 s9_2353;
							word32 s10_2354;
							word32 s11_2355;
							word32 t4_2356;
							word32 a0_2339;
							word32 s7_2351;
							word32 a1_2340;
							word32 a2_2341;
							word32 a5_2344;
							word32 a3_2342;
							word32 a4_2343;
							word32 s6_2350;
							word32 s3_2347;
							word32 s4_2348;
							word32 s5_2349;
							word32 a7_2345;
							word32 s2_2346;
							word32 s1_2338;
							Eq_2 ra_1028 = printf(ra_1000, &g_t230869E0, a3_994, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2338, out a0_2339, out a1_2340, out a2_2341, out a3_2342, out a4_2343, out a5_2344, out a7_2345, out s2_2346, out s3_2347, out s4_2348, out s5_2349, out s6_2350, out s7_2351, out s8_2352, out s9_2353, out s10_2354, out s11_2355, out t4_2356);
							Eq_2 a3_1046;
							word32 a4_2357;
							word32 a5_2358;
							dwLocDC = ip4addr_ntoa(out a3_1046, out a4_2357, out a5_2358);
							word32 a5_2359;
							lwip_htons((word32) wLoc9E_1986, out a5_2359);
							Eq_2 a3_1071;
							Eq_2 a3_1095;
							int32 s1_1099;
							int32 s2_1102;
							Eq_2 s5_1105;
							int32 s8_1108;
							word32 t4_2389;
							word32 s10_2387;
							word32 s11_2388;
							word32 s6_2385;
							word32 s7_2386;
							word32 s3_2383;
							word32 s4_2384;
							word32 a5_2381;
							word32 a7_2382;
							word32 a1_2379;
							word32 a4_2380;
							word32 t4_2377;
							word32 a0_2378;
							word32 s10_2375;
							word32 s11_2376;
							word32 s8_2373;
							word32 s9_2374;
							word32 s6_2371;
							word32 s7_2372;
							word32 s5_2370;
							word32 s4_2369;
							word32 s3_2368;
							word32 s2_2367;
							word32 a7_2366;
							word32 a5_2365;
							word32 a4_2364;
							word32 a2_2363;
							word32 s1_2360;
							word32 a0_2361;
							word32 a1_2362;
							int32 * s9_1109;
							ra_1098 = printf(printf(ra_1028, &g_t230869F0, a3_1046, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2360, out a0_2361, out a1_2362, out a2_2363, out a3_1071, out a4_2364, out a5_2365, out a7_2366, out s2_2367, out s3_2368, out s4_2369, out s5_2370, out s6_2371, out s7_2372, out s8_2373, out s9_2374, out s10_2375, out s11_2376, out t4_2377), &g_t23086A20, a3_1071, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_1099, out a0_2378, out a1_2379, out a2_1094, out a3_1095, out a4_2380, out a5_2381, out a7_2382, out s2_1102, out s3_2383, out s4_2384, out s5_1105, out s6_2385, out s7_2386, out s8_1108, out s9_1109, out s10_2387, out s11_2388, out t4_2389);
							if (s1_1099 <= 0x04)
							{
								ui32 s0_1189;
								for (s0_1189 = 0x00; s0_1189 != 0x05; ++s0_1189)
								{
									if (*s9_1109 == 0x00)
									{
										word32 s0_1203 = (s0_1189 << 2) + (fp + -64);
										word32 a5_2444;
										s0_1203->t0FD8 = xTaskGetTickCount(out a5_2444);
										Eq_2 a3_1210;
										word32 a5_2448;
										word32 a1_2445;
										word32 a2_2446;
										word32 a4_2447;
										s0_1203->t0FB0 = atoi(s5_1105, out a1_2445, out a2_2446, out a3_1210, out a4_2447, out a5_2448);
										s0_1203->dw0FEC = s2_1102;
										word32 t4_2466;
										word32 s11_2465;
										word32 s10_2464;
										word32 s9_2463;
										word32 s8_2462;
										word32 s7_2461;
										word32 s6_2460;
										word32 s3_2457;
										word32 s4_2458;
										word32 s5_2459;
										word32 s2_2456;
										word32 a7_2455;
										word32 a3_2452;
										word32 a4_2453;
										word32 a5_2454;
										word32 a1_2451;
										word32 a0_2450;
										word32 s1_2449;
										ra_1098 = printf(ra_1098, &g_t23086A44, a3_1210, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2449, out a0_2450, out a1_2451, out a2_1094, out a3_2452, out a4_2453, out a5_2454, out a7_2455, out s2_2456, out s3_2457, out s4_2458, out s5_2459, out s6_2460, out s7_2461, out s8_2462, out s9_2463, out s10_2464, out s11_2465, out t4_2466);
										break;
									}
									++s9_1109;
								}
							}
							else
							{
								Eq_2 s2_1127;
								word32 s11_2424;
								word32 t4_2425;
								word32 s4_2417;
								word32 s5_2418;
								word32 s7_2420;
								word32 s8_2421;
								word32 s10_2423;
								word32 s9_2422;
								word32 s6_2419;
								word32 a7_2415;
								word32 s3_2416;
								word32 a4_2413;
								word32 a5_2414;
								word32 a2_2411;
								word32 a3_2412;
								word32 a0_2409;
								word32 a1_2410;
								word32 s1_2408;
								ra_1098 = printf(ra_1098, &g_t23086A50, a3_1095, 0x10, dwLocB8, dwLoc70, dwLoc6C, a0_258, dwLoc24, out s1_2408, out a0_2409, out a1_2410, out a2_2411, out a3_2412, out a4_2413, out a5_2414, out a7_2415, out s2_1127, out s3_2416, out s4_2417, out s5_2418, out s6_2419, out s7_2420, out s8_2421, out s9_2422, out s10_2423, out s11_2424, out t4_2425);
								Eq_2 a2_1144;
								Eq_2 s2_1152;
								word32 s8_2431;
								word32 mstatus_2432;
								word32 a3_2427;
								word32 s3_2428;
								word32 s5_2430;
								word32 s4_2429;
								word32 a0_2426;
								lwip_send(s2_1127, 0x00, mstatus, dwLocB8, s2, dwLoc38, out a0_2426, out a2_1144, out a3_2427, out s2_1152, out s3_2428, out s4_2429, out s5_2430, out s8_2431, out mstatus_2432);
								word32 s6_2443;
								word32 s4_2441;
								word32 s5_2442;
								word32 s2_2439;
								word32 s3_2440;
								word32 a4_2437;
								word32 a5_2438;
								word32 a1_2435;
								word32 a3_2436;
								word32 s1_2433;
								word32 a0_2434;
								lwip_close(ra_1098, s2_1152, a2_1144, mstatus, dwLoc98, 0x01, dwLoc28, dwLoc18, s9, dwArg48, out s1_2433, out a0_2434, out a1_2435, out a2_1094, out a3_2436, out a4_2437, out a5_2438, out s2_2439, out s3_2440, out s4_2441, out s5_2442, out s6_2443);
							}
						}
					}
				}
			}
			a0_1285 = (struct Eq_274 *) &g_t230868D0;
		}
	}
l23048124:
	Eq_2 a5_1298;
	Eq_2 a2_1301;
	Eq_2 s3_1310;
	Eq_2 s4_1311;
	word32 s11_2107;
	word32 s9_2105;
	word32 s6_2102;
	word32 a7_2099;
	word32 a1_2096;
	word32 s8_2104;
	word32 a0_2095;
	word32 s5_2101;
	word32 s2_2100;
	word32 s1_2094;
	word32 s10_2106;
	word32 s7_2103;
	word32 t4_2108;
	word32 a3_2097;
	word32 a4_2098;
	Eq_2 ra_1305 = printf(ra_1098, a0_1285, a3_1293, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, out s1_2094, out a0_2095, out a1_2096, out a2_1301, out a3_2097, out a4_2098, out a5_1298, out a7_2099, out s2_2100, out s3_1310, out s4_1311, out s5_2101, out s6_2102, out s7_2103, out s8_2104, out s9_2105, out s10_2106, out s11_2107, out t4_2108);
	Eq_2 a2_1321;
	word32 t3_2118;
	word32 s4_2117;
	word32 a5_2115;
	word32 a6_2116;
	word32 a4_2114;
	word32 a0_2111;
	word32 a1_2112;
	word32 a3_2113;
	word32 s0_2109;
	word32 s1_2110;
	vPortFree(s4_1311, a2_1301, a5_1298, mstatus, dwArg78, dwArgB8, out s0_2109, out s1_2110, out a0_2111, out a1_2112, out a2_1321, out a3_2113, out a4_2114, out a5_2115, out a6_2116, out s4_2117, out t3_2118);
	Eq_2 a2_1336;
	Eq_2 a3_1337;
	Eq_2 a4_1338;
	Eq_2 a5_1339;
	word32 s1_2119;
	word32 s5_2125;
	word32 s6_2126;
	word32 s2_2122;
	word32 s3_2123;
	word32 s4_2124;
	word32 a0_2120;
	word32 a1_2121;
	lwip_close(ra_1305, s3_1310, a2_1321, mstatus, dwLoc98, 0x01, dwLoc28, dwLoc18, s9, dwArg48, out s1_2119, out a0_2120, out a1_2121, out a2_1336, out a3_1337, out a4_1338, out a5_1339, out s2_2122, out s3_2123, out s4_2124, out s5_2125, out s6_2126);
	vTaskDelete(0x00, a2_1336, a3_1337, a4_1338, a5_1339, mstatus);
}

// 230484FE: void cmd_tcp_server(Register Eq_2 ra, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void cmd_tcp_server(Eq_2 ra, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a2 == 0x02)
	{
		Eq_2 a3_7 = *((word32) a3 + 4);
		word32 a2_132;
		word32 a3_133;
		word32 a4_134;
		word32 a5_135;
		xTaskCreate(ra, s1, 0x0400, a3_7, 0x14, 0x00, s3, mstatus, dwArg10, dwArg14, dwArgF8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out a2_132, out a3_133, out a4_134, out a5_135);
	}
	else
	{
		word32 s1_113;
		word32 a0_114;
		word32 a1_115;
		word32 a2_116;
		word32 a3_117;
		word32 a4_118;
		word32 a5_119;
		word32 a7_120;
		word32 s2_121;
		word32 s3_122;
		word32 s4_123;
		word32 s5_124;
		word32 s6_125;
		word32 s7_126;
		word32 s8_127;
		word32 s9_128;
		word32 s10_129;
		word32 s11_130;
		word32 t4_131;
		printf(ra, &g_t23086A70, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_113, out a0_114, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out a7_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127, out s9_128, out s10_129, out s11_130, out t4_131);
	}
}

// 2304852E: void network_netutils_tcpserver_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_tcpserver_cli_register()
{
}

// 23048532: void iperf_server_udp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipus_test_cmd
void iperf_server_udp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	union Eq_133241 * a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 1, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 0x23048602, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

