pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23048566: void iperf_client_udp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipu_test_cmd
void iperf_client_udp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	union Eq_133241 * a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 587499880, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2304859A: void iperf_server_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ips_test_cmd
void iperf_server_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	union Eq_133241 * a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 587500514, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 230485CE: void iperf_client_tcp_entry(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ipc_test_cmd
void iperf_client_tcp_entry(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_9;
	Eq_2 a4_10;
	Eq_2 a5_11;
	Eq_2 a0_17;
	union Eq_133241 * a1_18;
	Eq_2 s1_25;
	Eq_2 s4_28;
	word32 a1_82;
	word32 a2_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 s2_89;
	word32 s3_90;
	word32 s8_91;
	pvPortMalloc(ra, s1, (word32) strlen(a0, out a1_82, out a2_83, out a3_9, out a4_10, out a5_11) + 4, a3_9, a4_10, a5_11, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_25, out a0_17, out a1_18, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out s2_89, out s3_90, out s4_28, out s8_91);
	Eq_2 a4_35;
	Eq_2 a5_36;
	strcpy(a0_17, a1_18, out a4_35, out a5_36);
	aos_task_new(ra, s1_25, 587501114, dwArg44, 0x01000000, a4_35, a5_36, s4_28, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 23048602: void iperf_server_udp(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void iperf_server_udp(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a0 == 0x00)
	{
		word32 a5_326;
		vAssertCalled(a4, mstatus, out a5_326);
	}
	Eq_2 a2_173;
	Eq_2 a5_176;
	Eq_2 s1_177;
	Eq_2 a3_23;
	Eq_2 s1_26;
	word32 a5_325;
	word32 a4_324;
	Eq_2 ra_139 = udp_new(ra, a0, a3, a4, mstatus, out s1_26, out a3_23, out a4_324, out a5_325);
	if (a0 == 0x00)
	{
		word32 s7_341;
		word32 s8_342;
		word32 s9_343;
		word32 t4_346;
		word32 s10_344;
		word32 s11_345;
		word32 a7_335;
		word32 s5_339;
		word32 s6_340;
		word32 s3_337;
		word32 s4_338;
		word32 s2_336;
		word32 a4_334;
		word32 a0_331;
		word32 a1_332;
		word32 a3_333;
		printf(ra_139, &g_t23086C4C, a3_23, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_177, out a0_331, out a1_332, out a2_173, out a3_333, out a4_334, out a5_176, out a7_335, out s2_336, out s3_337, out s4_338, out s5_339, out s6_340, out s7_341, out s8_342, out s9_343, out s10_344, out s11_345, out t4_346);
	}
	else
	{
		struct Eq_274 * a0_136;
		word32 a3_328;
		word32 a0_327;
		Eq_2 s0_127 = ipaddr_addr(s1_26, out a0_327, out a3_328);
		word32 a4_329;
		word32 a5_330;
		Eq_2 a3_118;
		if (udp_bind(s0_127, fp + -84, (union Eq_2 *) 0x01000389, out a3_118, out a4_329, out a5_330) != 0x00)
			a0_136 = (struct Eq_274 *) &g_t23086C70;
		else
		{
			word32 s1_347;
			word32 a0_348;
			word32 a1_349;
			word32 a2_350;
			word32 a3_351;
			word32 a4_352;
			word32 a5_353;
			word32 a7_354;
			word32 s2_355;
			word32 s3_356;
			word32 s4_357;
			word32 s5_358;
			word32 s6_359;
			word32 s7_360;
			word32 s8_361;
			word32 s9_362;
			word32 s10_363;
			word32 s11_364;
			word32 t4_365;
			word32 t1_366;
			word32 a0_367;
			word32 a1_368;
			word32 a2_369;
			word32 a5_370;
			Eq_2 a4_117;
			ra_139 = memset(printf(ra_139, &g_t23086C80, a3_118, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_347, out a0_348, out a1_349, out a2_350, out a3_351, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_357, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11_364, out t4_365), fp + -80, 0x00, 64, out t1_366, out a0_367, out a1_368, out a2_369, out a3_118, out a4_117, out a5_370);
			udp_recv(s0_127, &g_t230486B0, fp + -80);
			Eq_2 a5_105 = ~0x00;
			Eq_2 a2_106 = fp + -80;
			while (a5_105 == 0x00)
			{
				word32 s1_382;
				word32 a0_383;
				word32 a1_384;
				word32 s2_385;
				word32 s3_386;
				word32 s4_387;
				word32 s8_388;
				s0_127 = vTaskDelay(1000, a2_106, a3_118, a4_117, a5_105, mstatus, dwLoc3C, dwLoc38, dwArgD8, dwArg0118, out s1_382, out a0_383, out a1_384, out a2_106, out a3_118, out a4_117, out a5_105, out s2_385, out s3_386, out s4_387, out s8_388);
			}
			a0_136 = (struct Eq_274 *) &g_t23086CA0;
		}
		Eq_2 a3_150;
		word32 s1_389;
		word32 a0_390;
		word32 a1_391;
		word32 a2_392;
		word32 a4_393;
		word32 a5_394;
		word32 a7_395;
		word32 s2_396;
		word32 s3_397;
		word32 s4_398;
		word32 s5_399;
		word32 s6_400;
		word32 s7_401;
		word32 s8_402;
		word32 s9_403;
		word32 s10_404;
		word32 s11_405;
		word32 t4_406;
		printf(ra_139, a0_136, a3_118, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_389, out a0_390, out a1_391, out a2_392, out a3_150, out a4_393, out a5_394, out a7_395, out s2_396, out s3_397, out s4_398, out s5_399, out s6_400, out s7_401, out s8_402, out s9_403, out s10_404, out s11_405, out t4_406);
		word32 a0_407;
		word32 a3_408;
		word32 a4_409;
		s1_177 = udp_remove(s0_127, a3_150, mstatus, out a0_407, out a2_173, out a3_408, out a4_409, out a5_176);
	}
	word32 s0_371;
	word32 s1_372;
	word32 a0_373;
	word32 a1_374;
	word32 a2_375;
	word32 a3_376;
	word32 a4_377;
	word32 a5_378;
	word32 a6_379;
	word32 s4_380;
	word32 t3_381;
	vPortFree(s1_177, a2_173, a5_176, mstatus, dwArgF8, dwArg0138, out s0_371, out s1_372, out a0_373, out a1_374, out a2_375, out a3_376, out a4_377, out a5_378, out a6_379, out s4_380, out t3_381);
}

