pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 230486B0: void iperf_server_udp_recv_fn(Register Eq_2 ra, Register word32 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack word32 dwArg0144)
void iperf_server_udp_recv_fn(Eq_2 ra, word32 s1, Eq_2 a0, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg98, word32 dwArg0144)
{
	Eq_2 s5_11 = a2;
	word32 t1_768;
	word32 a2_771;
	word32 a4_773;
	word32 a1_770;
	word32 a3_772;
	word32 a0_769;
	word32 a5_774;
	Eq_2 ra_296 = memset(ra, fp + -96, 0x00, 32, out t1_768, out a0_769, out a1_770, out a2_771, out a3_772, out a4_773, out a5_774);
	if (a2 == 0x00)
		return;
	word32 a1_52;
	struct Eq_239569 * a5_56;
	word32 a2_775;
	word32 a3_776;
	Eq_2 a4_55;
	Eq_2 a0_51 = bl_timer_now_us(out a1_52, out a2_775, out a3_776, out a4_55, out a5_56);
	Eq_2 s9_63 = *((word32) a0 + 24);
	*((word32) a0_51 + 32) = a0;
	Eq_2 s4_302 = a0_51;
	if (s9_63 == 0x00)
		s9_63 = a0_51;
	struct Eq_239591 * s0_69 = *((word32) a4_55 + 28);
	s0_69->t0018 = s9_63;
	if (a4_55 == 0x00)
		a4_55 = a0_51;
	Eq_2 a5_111;
	*((word32) a4_55 + 28) = s0_69;
	up32 s2_79 = (word32) *((word32) a2 + 8);
	Eq_2 s1_90 = s1 + (s2_79 + 54);
	struct Eq_239613 * s0_89 = a5_56->ptr0004;
	*((word32) s1_90 + 48) = s0_89;
	Eq_2 s2_93 = (word32) (s1_90 < s2_79 + 54) + a1_52;
	s0_89->t0034 = s2_93;
	a5_56->ptr0005 = s0_89;
	struct Eq_239631 * a5_97 = *((word32) a2 + 4);
	Eq_2 a3_104 = (word32) a5_97->b0000 << 24 | (word32) a5_97->b0001 << 16 | (word32) a5_97->b0003;
	Eq_2 s3_107 = (word32) a5_97->b0002 << 8 | a3_104;
	if (s3_107 < 0x00)
	{
		a5_97->b000C = 0x80;
		a5_97->b000D = 0x00;
		a5_97->b000E = 0x00;
		a5_97->b000F = 0x00;
		a5_97->b0010 = 0x00;
		a5_97->b0011 = 0x00;
		a5_97->b0012 = 0x00;
		a5_97->b0013 = 0x00;
		a5_97->b0018 = 0x00;
		a5_97->b0019 = 0x00;
		a5_97->b0014 = ~0x00;
		a5_97->b0015 = ~0x00;
		a5_97->b0016 = ~0x00;
		a5_97->b0017 = 0x80;
		a5_97->b001A = 0x00;
		a5_97->b001B = 0x00;
		a5_97->b001C = 0x00;
		a5_97->b001D = 0x00;
		a5_97->b001E = 0x00;
		a5_97->b001F = 0x00;
		a5_97->b0020 = ~0x00;
		a5_97->b0021 = ~0x00;
		a5_97->b0022 = ~0x00;
		a5_97->b0023 = 0x80;
		a5_97->b0024 = ~0x00;
		a5_97->b0025 = ~0x00;
		a5_97->b0026 = ~0x00;
		a5_97->b0027 = 0x80;
		a5_97->b0028 = ~0x00;
		a5_97->b0029 = ~0x00;
		a5_97->b002A = ~0x00;
		a5_97->b002B = 0x80;
		word32 s1_777;
		Eq_2 s4_390;
		Eq_2 s5_391;
		Eq_2 s6_392;
		Eq_55976 s7_393;
		Eq_2 s8_394;
		Eq_2 s0_415;
		word32 a1_779;
		word32 a0_778;
		word32 a2_780;
		word32 a3_781;
		word32 s2_785;
		word32 a5_783;
		word32 a4_782;
		word32 a7_784;
		word32 s11_789;
		word32 s9_787;
		word32 s10_788;
		word32 s3_786;
		word32 s1_791;
		word32 a0_792;
		word32 a4_793;
		word32 s9_794;
		word32 t4_790;
		ra_296 = udp_sendto(printf(ra_296, &g_t23086CC0, 0x00FFFFFF, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_777, out a0_778, out a1_779, out a2_780, out a3_781, out a4_782, out a5_783, out a7_784, out s2_785, out s3_786, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_787, out s10_788, out s11_789, out t4_790), s6_392, s5_391, s7_393, s8_394, s4_390, mstatus, dwLoc7C, dwLoc68, dwLoc48, dwLoc18, dwLoc08, dwArg18, s5, dwArg38, dwArg58, dwArg68, dwArg98, out s0_415, out s1_791, out a0_792, out a3_104, out a4_793, out s3_107, out s4_302, out s5_11, out s9_794, out mstatus);
		*(union Eq_2 *) 0x01 = s0_415;
		a5_111.u0 = 0x01;
	}
	else
	{
		a5_111.u0 = 499999;
		if (a0_51 - a4_55 > 499999)
		{
			word32 a0_122;
			struct Eq_239894 * a1_123;
			ptr32 fflags_131;
			ptr32 frm_132;
			int32 s2_134;
			word32 a3_795;
			word32 s6_799;
			word32 s4_797;
			word32 s5_798;
			word32 a5_796;
			word32 s9_801;
			word32 fa0_802;
			word32 s7_800;
			Eq_2 s1_133 = __floatundisf(ra_296, s1_90, s2_93, fflags, frm, out a0_122, out a1_123, out a3_795, out a5_796, out s2_134, out s4_797, out s5_798, out s6_799, out s7_800, out s9_801, out fa0_802, out fflags_131, out frm_132);
			Eq_2 a0_154 = (word32) s1_133 + a0_122;
			real32 fs1_150 = g_r23087CB8;
			Eq_2 s0_152 = a1_123->t002C;
			*((word32) a0_154 + 40) = s0_152;
			Eq_2 a1_158 = a1_123 + s2_134 / 48 + (word32) (a0_154 < s1_133) / 48;
			*((word32) a1_158 + 44) = s0_152;
			real32 fs2_162 = g_r23087CBC;
			struct Eq_239964 * a0_164;
			Eq_2 a3_167;
			struct Eq_239966 * a5_169;
			Eq_5614 fa0_172;
			ptr32 fflags_173;
			ptr32 frm_174;
			word32 s4_178;
			word32 s9_183;
			word32 s6_806;
			word32 s5_805;
			word32 a1_803;
			word32 s2_804;
			word32 s7_807;
			__floatundisf(ra_296, a0_154, a1_158, fflags_131, frm_132, out a0_164, out a1_803, out a3_167, out a5_169, out s2_804, out s4_178, out s5_805, out s6_806, out s7_807, out s9_183, out fa0_172, out fflags_173, out frm_174);
			real32 fa5_194 = fa0_172 * fs1_150 / (real32) (s4_178 - s9_183);
			Eq_5614 fs2_195 = fa5_194 * fs2_162;
			struct Eq_239999 * a5_197 = (word32) (a5_169->r0038 < fa5_194);
			if (a5_197 != null)
				*((word32) s0_152 + 56) = s0_152;
			if ((word32) (fa5_194 < a5_197->r003C) != 0x00)
				*((word32) s0_152 + 60) = s0_152;
			Eq_5614 fs0_209 = a0_164->t0038;
			word32 a1_824;
			__extendsfdf2(ra_296, fa0_172, fflags_173, frm_174, out a1_824);
			word32 a1_825;
			__extendsfdf2(ra_296, fs0_209, fflags_173, frm_174, out a1_825);
			Eq_2 a1_241;
			__extendsfdf2(ra_296, fs0_209, fflags_173, frm_174, out a1_241);
			Eq_2 a1_250;
			__extendsfdf2(ra_296, fs2_195, fflags_173, frm_174, out a1_250);
			0x00 = dwArg0144;
			Eq_2 a3_265;
			struct Eq_240076 * a5_289;
			Eq_2 a4_294;
			word32 s0_826;
			word32 s1_827;
			word32 a0_828;
			word32 a1_829;
			word32 a2_830;
			word32 a4_831;
			word32 a5_832;
			word32 a7_833;
			word32 s2_834;
			word32 s3_835;
			word32 s4_836;
			word32 s5_837;
			word32 s6_838;
			word32 s7_839;
			word32 s8_840;
			word32 s9_841;
			word32 s10_842;
			word32 s11_843;
			word32 s1_844;
			word32 a0_845;
			word32 a1_846;
			word32 a2_847;
			word32 a7_848;
			word32 s2_849;
			word32 s6_850;
			word32 s7_851;
			word32 s8_852;
			word32 s9_853;
			word32 s10_854;
			word32 s11_855;
			word32 t4_856;
			ra_296 = printf(snprintf(ra_296, fp + -96, 32, &g_t23086CF0, dwLoc78, s6, dwLoc2C, a1_250, a1_241, dwArg18, dwArg3C, out s0_826, out s1_827, out a0_828, out a1_829, out a2_830, out a3_265, out a4_831, out a5_832, out a7_833, out s2_834, out s3_835, out s4_836, out s5_837, out s6_838, out s7_839, out s8_840, out s9_841, out s10_842, out s11_843), &g_t23085CD8, a3_265, a3_167, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_844, out a0_845, out a1_846, out a2_847, out a3_104, out a4_294, out a5_289, out a7_848, out s2_849, out s3_107, out s4_302, out s5_11, out s6_850, out s7_851, out s8_852, out s9_853, out s10_854, out s11_855, out t4_856);
			Eq_31478 s0_311 = *((word32) a4_294 + 20);
			a5_289->t001C = s0_311;
			*(union Eq_31478 *) 48 = s0_311;
			Eq_69455 s0_316 = *(union Eq_69455 *) 0x0C;
			*((word32) s0_316 + 52) = 0x00;
			*((word32) s0_316 + 20) = 0x00;
			*((word32) a4_294 + 0x0C) = s0_316;
			a5_111 = a4_294;
		}
	}
	struct Eq_239871 * s0_436 = *((word16) a5_111.u0 + 8);
	Eq_2 a4_437 = (word16) a5_111.u0 + 1;
	if (s3_107 != a4_437)
	{
		if (a5_111 >= s3_107)
		{
			*((word16) a5_111.u0 + 21) = *((word16) a5_111.u0 + 20);
			goto l23048840;
		}
		s0_436 = (struct Eq_239871 *) *((word32) a4_437 + 16);
		(s3_107 - a5_111 + ((word32) a4_437 - 1))->ptr0010 = s0_436;
		a4_437 = (word32) a4_437 - 1;
	}
	else if (a5_111 >= s3_107)
		goto l23048840;
	s0_436->t0008 = s3_107;
l23048840:
	word32 a4_814;
	word32 a5_815;
	word32 a3_813;
	word32 s4_819;
	word32 a7_816;
	word32 s2_817;
	word32 s3_818;
	word32 s8_822;
	word32 mstatus_823;
	word32 s5_820;
	word32 s6_821;
	word32 s0_808;
	word32 s1_809;
	word32 a1_811;
	word32 a2_812;
	word32 a0_810;
	pbuf_free(ra_296, s5_11, a3_104, a4_437, s4_302, mstatus, dwArg98, out s0_808, out s1_809, out a0_810, out a1_811, out a2_812, out a3_813, out a4_814, out a5_815, out a7_816, out s2_817, out s3_818, out s4_819, out s5_820, out s6_821, out s8_822, out mstatus_823);
}

// 23048968: void iperf_client_udp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98)
void iperf_client_udp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s5, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98)
{
	Eq_2 dwLoc98 = (word32) qwLoc98;
	Eq_2 dwLocD8 = (word32) qwLocD8;
	Eq_2 a3_44;
	Eq_2 a4_45;
	Eq_2 a5_46;
	word32 a1_1248;
	word32 t1_1246;
	word32 a2_1249;
	word32 a0_1247;
	Eq_2 ra_47 = memset(ra, fp + -0x00A0, 0x00, 64, out t1_1246, out a0_1247, out a1_1248, out a2_1249, out a3_44, out a4_45, out a5_46);
	word32 a0_52;
	word32 s2_1255;
	word32 s1_1250;
	word32 a6_1254;
	word32 s4_1256;
	word32 a1_1251;
	word32 a3_1252;
	word32 a4_1253;
	word32 s8_1257;
	Eq_2 s3_62;
	Eq_2 a5_57;
	Eq_2 a2_54;
	pvPortMalloc(ra_47, s1, 1300, a3_44, a4_45, a5_46, mstatus, dwLocA0, dwLoc9C, SLICE(s5, word32, 32), dwArg58, dwArg98, out s1_1250, out a0_52, out a1_1251, out a2_54, out a3_1252, out a4_1253, out a5_57, out a6_1254, out s2_1255, out s3_62, out s4_1256, out s8_1257);
	Eq_2 dwLoc58_1116 = s5;
	if (a0_52 != 0x00)
	{
		int32 a5_68;
		for (a5_68 = 0x00; a5_68 != 1300; ++a5_68)
		{
			Eq_2 a3_72 = a0_52 + a5_68;
			a3_72->u1 = (byte) a5_68;
		}
		Eq_2 a2_584;
		Eq_2 a3_585;
		Eq_2 a4_586;
		Eq_2 a5_587;
		Eq_2 a3_84;
		word32 a2_1270;
		word32 a1_1269;
		word32 s2_1272;
		word32 s3_1273;
		word32 a4_1271;
		word32 s5_1274;
		Eq_2 a0_103 = lwip_socket(ra_47, 0x02, 0x11, a3_72, mstatus, dwLocAC, s2, dwLoc38, s1, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, out a1_1269, out a2_1270, out a3_84, out a4_1271, out s2_1272, out s3_1273, out s5_1274);
		if (a0_103 < 0x00)
		{
			word32 s6_1294;
			word32 s7_1295;
			word32 s9_1297;
			word32 s8_1296;
			word32 t4_1300;
			word32 s10_1298;
			word32 s11_1299;
			word32 s3_1291;
			word32 s4_1292;
			word32 s5_1293;
			word32 a0_1287;
			word32 s1_1286;
			word32 s2_1290;
			word32 a1_1288;
			word32 a7_1289;
			printf(ra_47, &g_t23086B88, a3_84, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_1286, out a0_1287, out a1_1288, out a2_584, out a3_585, out a4_586, out a5_587, out a7_1289, out s2_1290, out s3_1291, out s4_1292, out s5_1293, out s6_1294, out s7_1295, out s8_1296, out s9_1297, out s10_1298, out s11_1299, out t4_1300);
		}
		else
		{
			word32 t1_1275;
			word32 a5_1281;
			word32 a0_1276;
			word32 a1_1277;
			word32 a2_1278;
			word32 a4_1280;
			word32 a3_1279;
			Eq_2 ra_114 = memset(ra_47, fp + -0x00C0, 0x00, 0x10, out t1_1275, out a0_1276, out a1_1277, out a2_1278, out a3_1279, out a4_1280, out a5_1281);
			word32 a5_1282;
			lwip_htons(0x0100038A, out a5_1282);
			word32 a3_1284;
			word32 a0_1283;
			ipaddr_addr(0x2307C4CC, out a0_1283, out a3_1284);
			word32 a0_148;
			Eq_2 a3_151;
			word32 s3_1285;
			lwip_bind(a0_103, fp + -0x00C0, mstatus, dwLocAC, dwLoc98, s5, dwLoc18, out a0_148, out a3_151, out s3_1285);
			if (a0_148 != ~0x00)
			{
				word32 s2_186;
				Eq_2 s3_187;
				word32 a3_1321;
				word32 a4_1322;
				word32 a5_1323;
				word32 a2_1320;
				word32 s10_1314;
				word32 t4_1316;
				word32 s11_1315;
				word32 a1_1319;
				word32 t1_1317;
				word32 a0_1318;
				word32 a3_1304;
				word32 s7_1311;
				word32 s8_1312;
				word32 s9_1313;
				word32 a4_1305;
				word32 a7_1307;
				word32 a5_1306;
				word32 s6_1310;
				word32 s4_1308;
				word32 s5_1309;
				word32 a0_1301;
				word32 a1_1302;
				word32 a2_1303;
				Eq_2 s1_183;
				Eq_2 ra_205 = memset(printf(ra_114, &g_t23086C80, a3_151, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_183, out a0_1301, out a1_1302, out a2_1303, out a3_1304, out a4_1305, out a5_1306, out a7_1307, out s2_186, out s3_187, out s4_1308, out s5_1309, out s6_1310, out s7_1311, out s8_1312, out s9_1313, out s10_1314, out s11_1315, out t4_1316), fp + -0x00B0, 0x00, 0x10, out t1_1317, out a0_1318, out a1_1319, out a2_1320, out a3_1321, out a4_1322, out a5_1323);
				word32 a5_1324;
				lwip_htons(s2_186 + 905, out a5_1324);
				Eq_2 a0_214;
				word32 a3_1325;
				Eq_2 s0_222 = ipaddr_addr(s3_187, out a0_214, out a3_1325);
				word32 a5_1326;
				Eq_2 a0_233 = xTaskGetTickCount(out a5_1326);
				Eq_5614 fs3_236 = g_t23087C48;
				real32 fs5_238 = g_r23087B80;
				Eq_5614 fs4_240 = 0x00;
				real32 fs2_241 = g_r23087B84;
				Eq_2 s11_243 = a0_233;
				Eq_2 s4_244 = 0x01;
				Eq_2 s3_245 = 0x00;
				word32 s5_246 = 0x00;
				int32 s10_247 = 0x00;
				up32 s2_248 = s2_186 + 903;
l23048ACA:
				word32 a5_1371;
				up32 a5_254 = xTaskGetTickCount(out a5_1371) - s11_243;
				if (s2_248 < a5_254)
				{
					Eq_2 s10_264 = (word32) s3_245 + s10_247;
					real32 fa0_284;
					word32 s6_292;
					word32 s7_293;
					word32 a5_1366;
					word32 s2_1367;
					word32 s5_1369;
					word32 s4_1368;
					word32 s9_1370;
					word32 a0_1363;
					word32 a1_1364;
					word32 a3_1365;
					__floatundisf(ra_205, s10_264, s5_246 + (s10_247 >> 0x1F) + (word32) (s10_264 < s3_245), fflags, frm, out a0_1363, out a1_1364, out a3_1365, out a5_1366, out s2_1367, out s4_1368, out s5_1369, out s6_292, out s7_293, out s9_1370, out fa0_284, out fflags, out frm);
					Eq_5614 fs0_309 = (real32) s10_247 / fs5_238 / (real32) a5_254 * fs2_241 / fs2_241;
					Eq_5614 fs1_313 = fa0_284 / fs5_238 / (real32) (s7_293 - s6_292) * fs2_241 / fs2_241;
					if ((word32) (fs0_309 < fs3_236) != 0x00)
						fs3_236 = fs0_309;
					if ((word32) (fs4_240 < fs0_309) != 0x00)
						fs4_240 = fs0_309;
					word32 a1_1407;
					__extendsfdf2(ra_205, fs3_236, fflags, frm, out a1_1407);
					Eq_2 a1_345;
					Eq_2 a0_344 = __extendsfdf2(ra_205, fs0_309, fflags, frm, out a1_345);
					Eq_2 a1_353;
					__extendsfdf2(ra_205, fs4_240, fflags, frm, out a1_353);
					Eq_2 a1_362;
					__extendsfdf2(ra_205, fs1_313, fflags, frm, out a1_362);
					dwLoc58_1116 = a1_345;
					Eq_2 a3_377;
					word32 s9_393;
					word32 s7_1435;
					word32 s8_1436;
					word32 s9_1437;
					word32 t4_1438;
					word32 s2_1431;
					word32 s3_1432;
					word32 s5_1433;
					word32 s6_1434;
					word32 a5_1429;
					word32 a7_1430;
					word32 a3_1427;
					word32 a4_1428;
					word32 a1_1425;
					word32 a2_1426;
					word32 s11_1423;
					word32 a0_1424;
					word32 s10_1422;
					word32 s8_1421;
					word32 s6_1419;
					word32 s7_1420;
					word32 s5_1418;
					word32 s4_1417;
					word32 s2_1415;
					word32 s3_1416;
					word32 a4_1412;
					word32 a5_1413;
					word32 a7_1414;
					word32 a0_1409;
					word32 a1_1410;
					word32 a2_1411;
					word32 s1_1408;
					ra_205 = printf(snprintf(ra_205, fp + -0x00A0, 64, (word32) a0_344 - 1120, dwLocC8, dwLocA8, s4, a1_362, a1_353, dwLoc38, dwLoc14, out s0_222, out s1_1408, out a0_1409, out a1_1410, out a2_1411, out a3_377, out a4_1412, out a5_1413, out a7_1414, out s2_1415, out s3_1416, out s4_1417, out s5_1418, out s6_1419, out s7_1420, out s8_1421, out s9_393, out s10_1422, out s11_1423), s9_393 + -808, a3_377, a0_344, dwLocB8, dwLoc70, dwLoc6C, a0_214, dwLoc24, out s1_183, out a0_1424, out a1_1425, out a2_1426, out a3_1427, out a4_1428, out a5_1429, out a7_1430, out s2_1431, out s3_1432, out s4_244, out s5_1433, out s6_1434, out s7_1435, out s8_1436, out s9_1437, out s10_247, out s11_243, out t4_1438);
				}
				word32 a5_1362;
				word32 a3_1360;
				word32 a4_1361;
				*lwip_htonl(s4_244, out a3_1360, out a4_1361, out a5_1362) = s0_222;
				*((word32) s0_222 + 4) = 0x00;
				*((word32) s0_222 + 8) = 0x00;
				do
				{
					Eq_2 a0_445;
					Eq_2 a2_447;
					word32 s4_459;
					word32 s8_1373;
					word32 a3_1372;
					ra_205 = lwip_sendto(ra_205, s0_222, s1_183, mstatus, dwLocB8, dwLocA8, dwLoc98, s2, dwLoc6C, dwLoc68, dwLoc58_1116, dwLoc38, dwLoc28, dwLoc18, s1, out s0_222, out s1_183, out a0_445, out a2_447, out a3_1372, out s2_248, out s3_245, out s4_459, out s5_246, out s8_1373, out mstatus);
					if (a0_445 > 0x00)
					{
						s10_247 = (word32) a0_445 + s10_247;
l23048BB0:
						s4_244 = s4_459 + 0x01;
						goto l23048ACA;
					}
					if (a0_445 == 0x00)
						goto l23048BB0;
				} while (a0_445 == ~0x00);
				Eq_2 a2_475;
				Eq_2 a3_476;
				Eq_2 a4_477;
				Eq_2 a5_478;
				word32 a1_1376;
				word32 s2_1377;
				word32 s4_1379;
				word32 s3_1378;
				word32 s5_1380;
				word32 s6_1381;
				word32 s1_1374;
				word32 a0_1375;
				lwip_close(ra_205, s1_183, a2_447, mstatus, dwLoc98, dwLoc58_1116, dwLoc28, dwLoc18, s9, dwArg48, out s1_1374, out a0_1375, out a1_1376, out a2_475, out a3_476, out a4_477, out a5_478, out s2_1377, out s3_1378, out s4_1379, out s5_1380, out s6_1381);
				Eq_2 a3_500;
				word32 s4_1390;
				word32 s8_1391;
				word32 s2_1388;
				word32 s3_1389;
				word32 a4_1386;
				word32 a5_1387;
				word32 a0_1383;
				word32 a1_1384;
				word32 a2_1385;
				word32 s1_1382;
				vTaskDelay(2000, a2_475, a3_476, a4_477, a5_478, mstatus, dwLocBC, dwLocB8, dwArg58, dwArg98, out s1_1382, out a0_1383, out a1_1384, out a2_1385, out a3_500, out a4_1386, out a5_1387, out s2_1388, out s3_1389, out s4_1390, out s8_1391);
				Eq_2 a5_516;
				Eq_2 a2_519;
				Eq_2 a3_520;
				Eq_2 a4_521;
				word32 s8_1402;
				word32 s10_1404;
				word32 s9_1403;
				word32 s11_1405;
				word32 t4_1406;
				word32 s5_1399;
				word32 s6_1400;
				word32 s7_1401;
				word32 s3_1397;
				word32 s4_1398;
				word32 s2_1396;
				word32 a1_1394;
				word32 a7_1395;
				word32 s1_1392;
				word32 a0_1393;
				printf(ra_205, &g_t23086BC0, a3_500, a0_445, dwLocB8, dwLoc70, dwLoc6C, a0_214, dwLoc24, out s1_1392, out a0_1393, out a1_1394, out a2_519, out a3_520, out a4_521, out a5_516, out a7_1395, out s2_1396, out s3_1397, out s4_1398, out s5_1399, out s6_1400, out s7_1401, out s8_1402, out s9_1403, out s10_1404, out s11_1405, out t4_1406);
				vTaskDelete(0x00, a2_519, a3_520, a4_521, a5_516, mstatus);
				return;
			}
			Eq_2 a2_563;
			Eq_2 s1_568;
			word32 a1_1346;
			word32 s2_1347;
			word32 s4_1349;
			word32 s3_1348;
			word32 s5_1350;
			word32 s6_1351;
			word32 s5_1336;
			word32 t4_1343;
			word32 s1_1344;
			word32 a0_1345;
			word32 s6_1337;
			word32 s8_1339;
			word32 s7_1338;
			word32 s11_1342;
			word32 s9_1340;
			word32 s10_1341;
			word32 s3_1334;
			word32 s4_1335;
			word32 a5_1331;
			word32 s2_1333;
			word32 a7_1332;
			word32 a1_1328;
			word32 a3_1329;
			word32 a4_1330;
			word32 a0_1327;
			lwip_close(printf(ra_114, &g_t23086C70, a3_151, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, s1, dwLoc24, out s1_568, out a0_1327, out a1_1328, out a2_563, out a3_1329, out a4_1330, out a5_1331, out a7_1332, out s2_1333, out s3_1334, out s4_1335, out s5_1336, out s6_1337, out s7_1338, out s8_1339, out s9_1340, out s10_1341, out s11_1342, out t4_1343), s1_568, a2_563, mstatus, dwLoc98, s5, dwLoc28, dwLoc18, s9, dwArg48, out s1_1344, out a0_1345, out a1_1346, out a2_584, out a3_585, out a4_586, out a5_587, out s2_1347, out s3_1348, out s4_1349, out s5_1350, out s6_1351);
		}
		word32 a4_1356;
		word32 s2_1357;
		word32 s8_1359;
		word32 s4_1358;
		word32 a0_1353;
		word32 a1_1354;
		word32 a3_1355;
		word32 s1_1352;
		vTaskDelay(1000, a2_584, a3_585, a4_586, a5_587, mstatus, dwLocBC, dwLocB8, dwArg58, dwArg98, out s1_1352, out a0_1353, out a1_1354, out a2_54, out a3_1355, out a4_1356, out a5_57, out s2_1357, out s3_62, out s4_1358, out s8_1359);
	}
	word32 t3_1268;
	word32 s1_1259;
	word32 a1_1261;
	word32 a6_1266;
	word32 a0_1260;
	word32 a2_1262;
	word32 s0_1258;
	word32 a3_1263;
	word32 s4_1267;
	word32 a5_1265;
	word32 a4_1264;
	vPortFree(s3_62, a2_54, a5_57, mstatus, dwArg78, s0, out s0_1258, out s1_1259, out a0_1260, out a1_1261, out a2_1262, out a3_1263, out a4_1264, out a5_1265, out a6_1266, out s4_1267, out t3_1268);
}

