pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23048BE2: void iperf_server(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8)
void iperf_server(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgC8)
{
	uint16 wLoc8E_934 = SLICE(dwLoc90, uint16, 16);
	Eq_2 a2_620;
	Eq_2 a5_623;
	Eq_2 s1_624;
	Eq_2 a3_45;
	Eq_2 a4_46;
	Eq_2 a5_47;
	word32 t1_1037;
	word32 a1_1039;
	word32 a0_1038;
	word32 a2_1040;
	Eq_2 ra_48 = memset(ra, fp + -0x0080, 0x00, 32, out t1_1037, out a0_1038, out a1_1039, out a2_1040, out a3_45, out a4_46, out a5_47);
	word32 a0_53;
	Eq_2 a3_56;
	word32 a5_1045;
	word32 s3_1048;
	word32 s4_1049;
	word32 a6_1046;
	word32 s1_1041;
	word32 a2_1043;
	word32 a4_1044;
	word32 s8_1050;
	word32 s2_1047;
	word32 a1_1042;
	pvPortMalloc(ra_48, a0, 0x01000450, a3_45, a4_46, a5_47, mstatus, dwLoc90, dwLoc8C, SLICE(a0, word32, 32), dwArg68, s4, out s1_1041, out a0_53, out a1_1042, out a2_1043, out a3_56, out a4_1044, out a5_1045, out a6_1046, out s2_1047, out s3_1048, out s4_1049, out s8_1050);
	Eq_2 dwLoc48_756 = a0;
	Eq_2 dwLoc4C_775 = SLICE(s3, word32, 32);
	if (a0_53 == 0x00)
	{
		word32 s11_1070;
		word32 s7_1066;
		word32 s6_1065;
		word32 a7_1060;
		word32 t4_1071;
		word32 s8_1067;
		word32 s9_1068;
		word32 s10_1069;
		word32 s2_1061;
		word32 s3_1062;
		word32 s4_1063;
		word32 s5_1064;
		word32 a0_1056;
		word32 a1_1057;
		word32 a3_1058;
		word32 a4_1059;
		printf(ra_48, &g_t23086BDC, a3_56, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_624, out a0_1056, out a1_1057, out a2_620, out a3_1058, out a4_1059, out a5_623, out a7_1060, out s2_1061, out s3_1062, out s4_1063, out s5_1064, out s6_1065, out s7_1066, out s8_1067, out s9_1068, out s10_1069, out s11_1070, out t4_1071);
	}
	else
	{
		Eq_2 a2_568;
		Eq_2 a5_571;
		Eq_2 s3_577;
		Eq_2 a3_74;
		word32 s2_80;
		word32 s5_1055;
		word32 a2_1052;
		word32 a4_1053;
		word32 s3_1054;
		word32 a1_1051;
		Eq_2 a0_93 = lwip_socket(ra_48, 0x01, 0x00, a3_56, mstatus, dwLoc9C, dwLoc68, dwLoc28, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, out a1_1051, out a2_1052, out a3_74, out a4_1053, out s2_80, out s3_1054, out s5_1055);
		if (a0_93 < 0x00)
		{
			word32 a3_1095;
			word32 s6_1101;
			word32 s11_1106;
			word32 t4_1107;
			word32 s7_1102;
			word32 s8_1103;
			word32 s9_1104;
			word32 s10_1105;
			word32 s5_1100;
			word32 a4_1096;
			word32 a7_1097;
			word32 s2_1098;
			word32 s4_1099;
			word32 s1_1092;
			word32 a0_1093;
			word32 a1_1094;
			printf(ra_48, &g_t23086BE8, a3_74, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, dwLoc38, dwLoc14, out s1_1092, out a0_1093, out a1_1094, out a2_568, out a3_1095, out a4_1096, out a5_571, out a7_1097, out s2_1098, out s3_577, out s4_1099, out s5_1100, out s6_1101, out s7_1102, out s8_1103, out s9_1104, out s10_1105, out s11_1106, out t4_1107);
		}
		else
		{
			struct Eq_274 * a0_533;
			word32 a5_1083;
			lwip_htons(s2_80 + 905, out a5_1083);
			word32 a5_1090;
			word32 t1_1084;
			word32 a4_1089;
			word32 a0_1085;
			word32 a1_1086;
			word32 a2_1087;
			word32 a3_1088;
			Eq_2 ra_111 = memset(ra_48, fp + -0x0098, 0x00, 0x08, out t1_1084, out a0_1085, out a1_1086, out a2_1087, out a3_1088, out a4_1089, out a5_1090);
			word32 a0_117;
			word32 s3_1091;
			Eq_2 a3_120;
			Eq_2 s0_125 = lwip_bind(a0_93, fp + -0x00A0, mstatus, dwLoc9C, dwLoc88, a0, dwLoc08, out a0_117, out a3_120, out s3_1091);
			if (a0_117 == ~0x00)
				a0_533 = (struct Eq_274 *) &g_t23086BF8;
			else
			{
				word32 a0_143;
				word32 s2_153;
				s0_125 = lwip_listen(s0_125, 0x05, mstatus, dwLoc8C, s6, 0x00, s5, out a0_143, out a3_120, out s2_153);
				if (a0_143 != s2_153)
				{
					Eq_5614 fs3_167 = g_t23087C48;
					real32 fs5_169 = g_r23087B80;
					Eq_5614 fs4_171 = 0x00;
					real32 fs2_172 = g_r23087B84;
l23048D00:
					word32 a0_1154;
					word32 a3_1155;
					Eq_2 ra_194 = lwip_accept(ra_111, s0_125, a3_120, mstatus, dwLocCC, 0x10, dwLoc68, dwLoc48_756, dwLoc2C, dwLoc28, dwLoc08, dwArg18, out a0_1154, out a3_1155, out mstatus);
					Eq_2 a3_215;
					word32 a5_1157;
					word32 a4_1156;
					Eq_2 a0_212 = ip4addr_ntoa(out a3_215, out a4_1156, out a5_1157);
					word32 a5_1158;
					lwip_htons((word32) wLoc8E_934, out a5_1158);
					Eq_2 s1_246;
					word32 t4_1176;
					word32 s9_1173;
					word32 s10_1174;
					word32 s11_1175;
					word32 s7_1171;
					word32 s8_1172;
					word32 s4_1168;
					word32 s5_1169;
					word32 s6_1170;
					word32 s3_1167;
					word32 s2_1166;
					word32 a7_1165;
					word32 a5_1164;
					word32 a4_1163;
					word32 a3_1162;
					word32 a2_1161;
					word32 a1_1160;
					word32 a0_1159;
					ra_111 = printf(ra_194, &g_t23086C1C, a3_215, a0_212, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_246, out a0_1159, out a1_1160, out a2_1161, out a3_1162, out a4_1163, out a5_1164, out a7_1165, out s2_1166, out s3_1167, out s4_1168, out s5_1169, out s6_1170, out s7_1171, out s8_1172, out s9_1173, out s10_1174, out s11_1175, out t4_1176);
					word32 a0_1177;
					word32 a3_1178;
					word32 s6_280;
					Eq_2 s3_277;
					Eq_2 s1_275;
					Eq_2 s2_276;
					Eq_2 s4_278;
					lwip_setsockopt(s1_246, 0x06, 0x01, fp + -0x00A4, mstatus, dwLocCC, dwLoc4C_775, 0x00, dwLoc18, s5, dwArg28, dwArg48, out s1_275, out a0_1177, out a3_1178, out s2_276, out s3_277, out s4_278, out s6_280);
					Eq_2 dwLocC8_766 = a0_212;
					word32 a5_1179;
					Eq_2 s10_292 = xTaskGetTickCount(out a5_1179);
					while (true)
					{
						Eq_2 s11_295 = s6_280 + 1104;
						do
						{
							int32 a0_309;
							Eq_2 a2_311;
							up32 s8_327;
							word32 s9_328;
							word32 s5_1144;
							word32 s6_1145;
							ra_111 = lwip_recv(ra_111, s1_275, s1_275, s3_277, s11_295, 0x00, s2_276, s3_277, s4_278, mstatus, dwLocC8_766, 0x10, dwLocB8, dwLocA8, dwLoc98, s6, dwLoc68, dwLoc48_756, 0x00, dwArg68, out s0_125, out s1_275, out a0_309, out a2_311, out a3_120, out s2_276, out s3_277, out s4_278, out s5_1144, out s6_1145, out s8_327, out s9_328, out mstatus);
							if (a0_309 <= 0x00)
							{
								if (s1_275 >= 0x00)
								{
									word32 s5_1189;
									word32 s6_1190;
									word32 s2_1186;
									word32 s3_1187;
									word32 s4_1188;
									word32 a4_1184;
									word32 a5_1185;
									word32 a1_1182;
									word32 a2_1183;
									word32 s1_1180;
									word32 a0_1181;
									s0_125 = lwip_close(ra_111, s1_275, a2_311, mstatus, dwLoc88, dwLoc48_756, dwLoc18, dwLoc08, s5, dwArg58, out s1_1180, out a0_1181, out a1_1182, out a2_1183, out a3_120, out a4_1184, out a5_1185, out s2_1186, out s3_1187, out s4_1188, out s5_1189, out s6_1190);
								}
								goto l23048D00;
							}
							int32 s9_360 = s9_328 + a0_309;
							word32 a5_1143;
							up32 a5_364 = xTaskGetTickCount(out a5_1143) - s10_292;
						} while (s8_327 >= a5_364);
						Eq_2 s9_372 = (word32) s2_276 + s9_360;
						real32 fa0_392;
						word32 s5_399;
						word32 s7_401;
						word32 s6_1152;
						word32 s9_1153;
						word32 s4_1151;
						word32 s2_1150;
						word32 a0_1146;
						word32 a1_1147;
						word32 a3_1148;
						word32 a5_1149;
						__floatundisf(ra_111, s9_372, (word32) s4_278 + (s9_360 >> 0x1F) + (word32) (s9_372 < s2_276), fflags, frm, out a0_1146, out a1_1147, out a3_1148, out a5_1149, out s2_1150, out s4_1151, out s5_399, out s6_1152, out s7_401, out s9_1153, out fa0_392, out fflags, out frm);
						Eq_5614 fs0_418 = (real32) s9_360 / fs5_169 / (real32) a5_364 * fs2_172 / fs2_172;
						Eq_5614 fs1_423 = fa0_392 / fs5_169 / (real32) (s7_401 - s5_399) * fs2_172 / fs2_172;
						if ((word32) (fs0_418 < fs3_167) != 0x00)
							fs3_167 = fs0_418;
						if ((word32) (fs4_171 < fs0_418) != 0x00)
							fs4_171 = fs0_418;
						word32 a1_1191;
						__extendsfdf2(ra_111, fs3_167, fflags, frm, out a1_1191);
						Eq_2 a1_454;
						Eq_2 a0_453 = __extendsfdf2(ra_111, fs0_418, fflags, frm, out a1_454);
						Eq_2 a1_462;
						dwLocCC = __extendsfdf2(ra_111, fs4_171, fflags, frm, out a1_462);
						Eq_2 a1_471;
						__extendsfdf2(ra_111, fs1_423, fflags, frm, out a1_471);
						dwLocC8_766 = a0_453;
						dwLoc48_756 = a1_454;
						dwLoc4C_775 = a1_462;
						Eq_2 a3_487;
						word32 a5_1198;
						word32 a7_1199;
						word32 a1_1195;
						word32 a2_1196;
						word32 a4_1197;
						word32 s0_1192;
						word32 s1_1193;
						word32 a0_1194;
						word32 s2_1200;
						word32 s3_1201;
						word32 s4_1202;
						word32 s5_1203;
						word32 s6_1204;
						word32 s7_1205;
						word32 s8_1206;
						word32 s9_1207;
						word32 s10_1208;
						word32 s11_1209;
						word32 a0_1210;
						word32 a1_1211;
						word32 a2_1212;
						word32 a3_1213;
						word32 a4_1214;
						word32 a5_1215;
						word32 a7_1216;
						word32 s5_1217;
						word32 s7_1218;
						word32 s8_1219;
						word32 s9_1220;
						word32 s11_1221;
						word32 t4_1222;
						ra_111 = printf(snprintf(ra_111, fp + -0x0080, 32, &g_t23086BA0, dwLocB8, dwLoc98, s0, a1_471, a1_462, dwLoc28, s11, out s0_1192, out s1_1193, out a0_1194, out a1_1195, out a2_1196, out a3_487, out a4_1197, out a5_1198, out a7_1199, out s2_1200, out s3_1201, out s4_1202, out s5_1203, out s6_1204, out s7_1205, out s8_1206, out s9_1207, out s10_1208, out s11_1209), &g_t23085CD8, a3_487, a0_453, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_275, out a0_1210, out a1_1211, out a2_1212, out a3_1213, out a4_1214, out a5_1215, out a7_1216, out s2_276, out s3_277, out s4_278, out s5_1217, out s6_280, out s7_1218, out s8_1219, out s9_1220, out s10_292, out s11_1221, out t4_1222);
					}
				}
				a0_533 = (struct Eq_274 *) &g_t23086C0C;
			}
			Eq_2 a2_545;
			word32 s6_1142;
			word32 a4_1138;
			word32 s2_1139;
			word32 s4_1140;
			word32 s5_1141;
			word32 a0_1135;
			word32 a1_1136;
			word32 a3_1137;
			word32 s10_1131;
			word32 s11_1132;
			word32 t4_1133;
			word32 s1_1134;
			word32 s9_1130;
			word32 s5_1126;
			word32 s6_1127;
			word32 s7_1128;
			word32 s8_1129;
			word32 a7_1122;
			word32 s2_1123;
			word32 s3_1124;
			word32 s4_1125;
			word32 a1_1118;
			word32 a3_1119;
			word32 a4_1120;
			word32 a5_1121;
			word32 s1_1116;
			word32 a0_1117;
			lwip_close(printf(ra_111, a0_533, a3_120, dwLocC8, dwLocA8, dwLoc60, dwLoc5C, 0x00, dwLoc14, out s1_1116, out a0_1117, out a1_1118, out a2_545, out a3_1119, out a4_1120, out a5_1121, out a7_1122, out s2_1123, out s3_1124, out s4_1125, out s5_1126, out s6_1127, out s7_1128, out s8_1129, out s9_1130, out s10_1131, out s11_1132, out t4_1133), s0_125, a2_545, mstatus, dwLoc88, a0, dwLoc18, dwLoc08, s5, dwArg58, out s1_1134, out a0_1135, out a1_1136, out a2_568, out a3_1137, out a4_1138, out a5_571, out s2_1139, out s3_577, out s4_1140, out s5_1141, out s6_1142);
		}
		word32 s4_1114;
		word32 t3_1115;
		word32 a1_1110;
		word32 a3_1111;
		word32 a4_1112;
		word32 a6_1113;
		word32 s0_1108;
		word32 a0_1109;
		vPortFree(s3_577, a2_568, a5_571, mstatus, dwArg88, dwArgC8, out s0_1108, out s1_624, out a0_1109, out a1_1110, out a2_620, out a3_1111, out a4_1112, out a5_623, out a6_1113, out s4_1114, out t3_1115);
	}
	if (s1_624 != 0x00)
	{
		word32 s0_1072;
		word32 a3_1077;
		word32 a5_1079;
		word32 a4_1078;
		word32 a1_1075;
		word32 a6_1080;
		word32 s4_1081;
		word32 t3_1082;
		word32 a2_1076;
		word32 s1_1073;
		word32 a0_1074;
		vPortFree(s1_624, a2_620, a5_623, mstatus, dwArg88, dwArgC8, out s0_1072, out s1_1073, out a0_1074, out a1_1075, out a2_1076, out a3_1077, out a4_1078, out a5_1079, out a6_1080, out s4_1081, out t3_1082);
	}
}

// 23048E3A: void iperf_client_tcp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8)
void iperf_client_tcp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s3, Eq_2 s7, Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgD8)
{
	Eq_2 a3_45;
	Eq_2 a4_46;
	Eq_2 a5_47;
	word32 a1_949;
	word32 t1_947;
	word32 a2_950;
	word32 a0_948;
	Eq_2 ra_48 = memset(ra, fp + -0x0080, 0x00, 32, out t1_947, out a0_948, out a1_949, out a2_950, out a3_45, out a4_46, out a5_47);
	Eq_2 dwLoc4C_881 = SLICE(s3, word32, 32);
	ptr32 a0_53;
	Eq_2 a2_55;
	Eq_2 a5_58;
	word32 s4_957;
	word32 a6_954;
	word32 s8_958;
	word32 s3_956;
	word32 s2_955;
	word32 a4_953;
	word32 a1_952;
	word32 s1_951;
	Eq_2 a3_492;
	Eq_2 s0_60 = pvPortMalloc(ra_48, s1, 0x01000450, a3_45, a4_46, a5_47, mstatus, dwLoc80, dwLoc7C, dwLoc34, dwArg78, s0, out s1_951, out a0_53, out a1_952, out a2_55, out a3_492, out a4_953, out a5_58, out a6_954, out s2_955, out s3_956, out s4_957, out s8_958);
	if (a0_53 == 0x00)
	{
		word32 a0_961;
		word32 s0_959;
		word32 t3_969;
		word32 a2_963;
		word32 a4_965;
		word32 a6_967;
		word32 s4_968;
		word32 a5_966;
		word32 a3_964;
		word32 a1_962;
		word32 s1_960;
		vPortFree(a0, a2_55, a5_58, mstatus, dwArg98, dwArgD8, out s0_959, out s1_960, out a0_961, out a1_962, out a2_963, out a3_964, out a4_965, out a5_966, out a6_967, out s4_968, out t3_969);
		return;
	}
	int32 a5_69 = 0x00;
	do
	{
		a0_53 + a5_69 = (byte *) (byte) a5_69;
		++a5_69;
	} while (a5_69 != (word32) s0_60 + 1104);
	Eq_5614 fs3_293 = g_t23087C48;
	real32 fs5_80 = g_r23087B80;
	Eq_5614 fs4_298 = 0x00;
	real32 fs2_83 = g_r23087B84;
	while (true)
	{
l23048EE2:
		Eq_2 a2_538;
		Eq_2 a3_539;
		Eq_2 a4_540;
		Eq_2 a5_541;
		Eq_2 a3_96;
		Eq_2 s5_105;
		word32 s3_997;
		word32 a1_993;
		word32 s2_996;
		word32 a4_995;
		word32 a2_994;
		if (lwip_socket(ra_48, 0x01, 0x06, a3_492, mstatus, dwLoc8C, a0, dwLoc18, dwArg28, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, out a1_993, out a2_994, out a3_96, out a4_995, out s2_996, out s3_997, out s5_105) < 0x00)
			break;
		word32 a5_970;
		lwip_htons(0x01000389, out a5_970);
		dwLoc28 = a0_125;
		Eq_2 a0_125;
		word32 a0_147;
		Eq_2 a3_150;
		word32 a4_974;
		word32 a1_972;
		word32 s2_975;
		word32 a2_973;
		word32 a3_971;
		word32 s3_976;
		word32 s4_977;
		Eq_2 s0_155 = lwip_connect(ipaddr_addr(s5_105, out a0_125, out a3_971), fp + -144, mstatus, dwLoc8C, s10, dwLoc38, s9, out a0_147, out a1_972, out a2_973, out a3_150, out a4_974, out s2_975, out s3_976, out s4_977);
		if (a0_147 == ~0x00)
		{
			Eq_2 a2_517;
			word32 t4_1039;
			word32 s11_1038;
			word32 s10_1037;
			word32 s9_1036;
			word32 s8_1035;
			word32 s7_1034;
			word32 s6_1033;
			word32 s5_1032;
			word32 s4_1031;
			word32 s3_1030;
			word32 s2_1029;
			word32 a7_1028;
			word32 a5_1027;
			word32 a4_1026;
			word32 a3_1025;
			word32 a1_1024;
			word32 a0_1023;
			word32 s1_1022;
			ra_48 = printf(ra_48, &g_t23086B30, a3_150, dwLocB8, dwLoc98, s3, dwLoc4C_881, a0_125, dwLoc04, out s1_1022, out a0_1023, out a1_1024, out a2_517, out a3_1025, out a4_1026, out a5_1027, out a7_1028, out s2_1029, out s3_1030, out s4_1031, out s5_1032, out s6_1033, out s7_1034, out s8_1035, out s9_1036, out s10_1037, out s11_1038, out t4_1039);
			word32 s1_1040;
			word32 s6_1047;
			word32 s5_1046;
			word32 s4_1045;
			word32 a0_1041;
			word32 a1_1042;
			word32 s2_1043;
			word32 s3_1044;
			lwip_close(ra_48, s0_155, a2_517, mstatus, s10, dwLoc38, dwLoc08, s9, s1, dwArg68, out s1_1040, out a0_1041, out a1_1042, out a2_538, out a3_539, out a4_540, out a5_541, out s2_1043, out s3_1044, out s4_1045, out s5_1046, out s6_1047);
			goto l23048EFE;
		}
		word32 s9_1013;
		word32 s4_1008;
		word32 s3_1007;
		word32 a3_1002;
		word32 s10_1014;
		word32 s11_1015;
		word32 t4_1016;
		word32 s8_1012;
		word32 s7_1011;
		word32 s6_1010;
		word32 s5_1009;
		word32 a4_1003;
		word32 s2_1006;
		word32 a7_1005;
		word32 a5_1004;
		word32 s1_998;
		word32 a2_1001;
		word32 a1_1000;
		word32 a0_999;
		Eq_2 ra_181 = printf(ra_48, &g_t23086B44, a3_150, dwLocB8, dwLoc98, s3, dwLoc4C_881, a0_125, dwLoc04, out s1_998, out a0_999, out a1_1000, out a2_1001, out a3_1002, out a4_1003, out a5_1004, out a7_1005, out s2_1006, out s3_1007, out s4_1008, out s5_1009, out s6_1010, out s7_1011, out s8_1012, out s9_1013, out s10_1014, out s11_1015, out t4_1016);
		word32 s1_211;
		word32 s6_1020;
		word32 s3_1019;
		word32 a3_1018;
		word32 a0_1017;
		Eq_2 s2_212;
		word32 s4_214;
		Eq_2 s0_210 = lwip_setsockopt(s0_155, 0x06, 0x01, fp + -0x0094, mstatus, dwLocBC, dwLoc3C, a0_125, dwLoc08, s1, dwArg38, dwArg58, out s1_211, out a0_1017, out a3_1018, out s2_212, out s3_1019, out s4_214, out s6_1020);
		up32 s8_227 = s1_211 + 903;
		word32 a5_1021;
		Eq_2 s11_229 = xTaskGetTickCount(out a5_1021);
		int32 s10_230 = 0x00;
		do
		{
			while (true)
			{
				word32 a5_1070;
				up32 a5_236 = xTaskGetTickCount(out a5_1070) - s11_229;
				if (s8_227 < a5_236)
				{
					Eq_2 s10_246 = (word32) s2_212 + s10_230;
					word32 a5_1065;
					real32 fa0_266;
					word32 s6_274;
					word32 s7_275;
					word32 s2_1066;
					word32 s4_1067;
					word32 s5_1068;
					word32 s9_1069;
					word32 a3_1064;
					word32 a1_1063;
					word32 a0_1062;
					__floatundisf(ra_181, s10_246, s4_214 + (s10_230 >> 0x1F) + (word32) (s10_246 < s2_212), fflags, frm, out a0_1062, out a1_1063, out a3_1064, out a5_1065, out s2_1066, out s4_1067, out s5_1068, out s6_274, out s7_275, out s9_1069, out fa0_266, out fflags, out frm);
					Eq_5614 fs0_291 = (real32) s10_230 / fs5_80 / (real32) a5_236 * fs2_83 / fs2_83;
					Eq_5614 fs1_295 = fa0_266 / fs5_80 / (real32) (s7_275 - s6_274) * fs2_83 / fs2_83;
					if ((word32) (fs0_291 < fs3_293) != 0x00)
						fs3_293 = fs0_291;
					if ((word32) (fs4_298 < fs0_291) != 0x00)
						fs4_298 = fs0_291;
					word32 a1_1071;
					__extendsfdf2(ra_181, fs3_293, fflags, frm, out a1_1071);
					Eq_2 a1_327;
					Eq_2 a0_326 = __extendsfdf2(ra_181, fs0_291, fflags, frm, out a1_327);
					Eq_2 a1_335;
					dwLocBC = __extendsfdf2(ra_181, fs4_298, fflags, frm, out a1_335);
					Eq_2 a1_344;
					__extendsfdf2(ra_181, fs1_295, fflags, frm, out a1_344);
					dwLocB8 = a0_326;
					dwLoc38 = a1_327;
					dwLoc3C = a1_335;
					Eq_2 a3_360;
					word32 s9_376;
					word32 s1_1072;
					word32 t4_1104;
					word32 s7_1101;
					word32 s8_1102;
					word32 s9_1103;
					word32 s4_1098;
					word32 s5_1099;
					word32 s6_1100;
					word32 a7_1095;
					word32 s2_1096;
					word32 s3_1097;
					word32 a3_1092;
					word32 a4_1093;
					word32 a5_1094;
					word32 a0_1089;
					word32 a1_1090;
					word32 a2_1091;
					word32 s1_1088;
					word32 s11_1087;
					word32 s10_1086;
					word32 s8_1085;
					word32 s7_1084;
					word32 s6_1083;
					word32 s5_1082;
					word32 s4_1081;
					word32 s3_1080;
					word32 s2_1079;
					word32 a7_1078;
					word32 a5_1077;
					word32 a0_1073;
					word32 a1_1074;
					word32 a2_1075;
					word32 a4_1076;
					ra_181 = printf(snprintf(ra_181, fp + -0x0080, 32, &g_t23086BA0, dwLocA8, dwLoc88, dwLoc5C, a1_344, a1_335, dwLoc18, s7, out s0_210, out s1_1072, out a0_1073, out a1_1074, out a2_1075, out a3_360, out a4_1076, out a5_1077, out a7_1078, out s2_1079, out s3_1080, out s4_1081, out s5_1082, out s6_1083, out s7_1084, out s8_1085, out s9_376, out s10_1086, out s11_1087), s9_376 + -808, a3_360, a0_326, dwLoc98, s3, dwLoc4C_881, a0_125, dwLoc04, out s1_1088, out a0_1089, out a1_1090, out a2_1091, out a3_1092, out a4_1093, out a5_1094, out a7_1095, out s2_1096, out s3_1097, out s4_1098, out s5_1099, out s6_1100, out s7_1101, out s8_1102, out s9_1103, out s10_230, out s11_229, out t4_1104);
				}
				int32 a0_421;
				Eq_2 a2_423;
				word32 mstatus_1061;
				word32 s5_1060;
				word32 s3_1059;
				word32 a3_1058;
				s0_210 = lwip_send(s0_210, 0x00, mstatus, dwLoc98, a0, dwLoc18, out a0_421, out a2_423, out a3_1058, out s2_212, out s3_1059, out s4_214, out s5_1060, out s8_227, out mstatus_1061);
				if (a0_421 <= 0x00)
					break;
				s10_230 += a0_421;
			}
		} while (a0_421 == 0x00);
		Eq_2 a2_448;
		Eq_2 a3_449;
		Eq_2 a4_450;
		Eq_2 a5_451;
		word32 s4_1110;
		word32 s5_1111;
		word32 s6_1112;
		word32 a1_1107;
		word32 s2_1108;
		word32 s3_1109;
		word32 s1_1105;
		word32 a0_1106;
		lwip_close(ra_181, s0_210, a2_423, mstatus, s10, dwLoc38, dwLoc08, s9, s1, dwArg68, out s1_1105, out a0_1106, out a1_1107, out a2_448, out a3_449, out a4_450, out a5_451, out s2_1108, out s3_1109, out s4_1110, out s5_1111, out s6_1112);
		Eq_2 a3_473;
		word32 s8_1122;
		word32 s3_1120;
		word32 s4_1121;
		word32 a5_1118;
		word32 s2_1119;
		word32 a4_1117;
		word32 a0_1114;
		word32 a1_1115;
		word32 a2_1116;
		word32 s1_1113;
		vTaskDelay(2000, a2_448, a3_449, a4_450, a5_451, mstatus, dwLoc9C, dwLoc98, dwArg78, s0, out s1_1113, out a0_1114, out a1_1115, out a2_1116, out a3_473, out a4_1117, out a5_1118, out s2_1119, out s3_1120, out s4_1121, out s8_1122);
		word32 t4_1140;
		word32 s10_1138;
		word32 s11_1139;
		word32 s8_1136;
		word32 s9_1137;
		word32 s6_1134;
		word32 s7_1135;
		word32 s4_1132;
		word32 s5_1133;
		word32 s2_1130;
		word32 s3_1131;
		word32 a5_1128;
		word32 a7_1129;
		word32 a2_1126;
		word32 a4_1127;
		word32 a0_1124;
		word32 a1_1125;
		word32 s1_1123;
		ra_48 = printf(ra_181, &g_t23086B6C, a3_473, dwLocB8, dwLoc98, s3, dwLoc4C_881, a0_125, dwLoc04, out s1_1123, out a0_1124, out a1_1125, out a2_1126, out a3_492, out a4_1127, out a5_1128, out a7_1129, out s2_1130, out s3_1131, out s4_1132, out s5_1133, out s6_1134, out s7_1135, out s8_1136, out s9_1137, out s10_1138, out s11_1139, out t4_1140);
	}
	word32 s11_991;
	word32 t4_992;
	word32 s10_990;
	word32 s5_985;
	word32 a1_980;
	word32 s6_986;
	word32 s9_989;
	word32 s8_988;
	word32 s7_987;
	word32 a7_981;
	word32 s4_984;
	word32 s3_983;
	word32 s2_982;
	word32 a0_979;
	word32 s1_978;
	ra_48 = printf(ra_48, &g_t23086B88, a3_96, dwLocB8, dwLoc98, s3, dwLoc4C_881, dwLoc28, dwLoc04, out s1_978, out a0_979, out a1_980, out a2_538, out a3_539, out a4_540, out a5_541, out a7_981, out s2_982, out s3_983, out s4_984, out s5_985, out s6_986, out s7_987, out s8_988, out s9_989, out s10_990, out s11_991, out t4_992);
l23048EFE:
	word32 s2_1054;
	word32 s3_1055;
	word32 s4_1056;
	word32 s8_1057;
	word32 a5_1053;
	word32 a4_1052;
	word32 s1_1048;
	word32 a0_1049;
	word32 a1_1050;
	word32 a2_1051;
	vTaskDelay(1000, a2_538, a3_539, a4_540, a5_541, mstatus, dwLoc9C, dwLoc98, dwArg78, s0, out s1_1048, out a0_1049, out a1_1050, out a2_1051, out a3_492, out a4_1052, out a5_1053, out s2_1054, out s3_1055, out s4_1056, out s8_1057);
	goto l23048EE2;
}

