pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23049070: void ipus_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipus_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t23086DF4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 0x2307C4CC;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t23086E34, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_server_udp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 230490AC: void ipu_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipu_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t23086D7C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 587754944;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t23086DD0, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_client_udp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 230490E8: void ipc_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ipc_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a0_170;
		word32 a1_171;
		word32 a2_172;
		word32 a3_173;
		word32 a4_174;
		word32 a5_175;
		word32 a7_176;
		word32 s2_177;
		word32 s3_178;
		word32 s4_179;
		word32 s5_180;
		word32 s6_181;
		word32 s7_182;
		word32 s8_183;
		word32 s9_184;
		word32 s10_185;
		word32 s11_186;
		word32 t4_187;
		ra = printf(ra, &g_t23086AC8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out a7_176, out s2_177, out s3_178, out s4_179, out s5_180, out s6_181, out s7_182, out s8_183, out s9_184, out s10_185, out s11_186, out t4_187);
		a0.u0 = 587754944;
	}
	else if (a2 != 0x02)
	{
		word32 s1_188;
		word32 a0_189;
		word32 a1_190;
		word32 a2_191;
		word32 a3_192;
		word32 a4_193;
		word32 a5_194;
		word32 a7_195;
		word32 s2_196;
		word32 s3_197;
		word32 s4_198;
		word32 s5_199;
		word32 s6_200;
		word32 s7_201;
		word32 s8_202;
		word32 s9_203;
		word32 s10_204;
		word32 s11_205;
		word32 t4_206;
		printf(ra, &g_t23086B0C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a7_195, out s2_196, out s3_197, out s4_198, out s5_199, out s6_200, out s7_201, out s8_202, out s9_203, out s10_204, out s11_205, out t4_206);
		return;
	}
	iperf_client_tcp_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 23049124: void ips_test_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ips_test_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, word32 dwArg44, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	if (a2 == 0x01)
	{
		word32 a4_155;
		word32 a2_154;
		word32 a1_153;
		word32 a0_152;
		word32 a5_156;
		word32 s4_157;
		word32 s8_158;
		s1 = puts(587754784, out a0_152, out a1_153, out a2_154, out a4_155, out a5_156, out s4_157, out s8_158);
		a0.u0 = 587754944;
	}
	else if (a2 != 0x02)
	{
		word32 s1_159;
		word32 a0_160;
		word32 a1_161;
		word32 a2_162;
		word32 a3_163;
		word32 a4_164;
		word32 a5_165;
		word32 a7_166;
		word32 s2_167;
		word32 s3_168;
		word32 s4_169;
		word32 s5_170;
		word32 s6_171;
		word32 s7_172;
		word32 s8_173;
		word32 s9_174;
		word32 s10_175;
		word32 s11_176;
		word32 t4_177;
		printf(ra, &g_t23086D58, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out a7_166, out s2_167, out s3_168, out s4_169, out s5_170, out s6_171, out s7_172, out s8_173, out s9_174, out s10_175, out s11_176, out t4_177);
		return;
	}
	iperf_server_entry(ra, s1, a0, mstatus, dwArg04, dwArg20, dwArg24, dwArg44, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

