pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23049160: void network_netutils_iperf_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_iperf_cli_register()
{
}

// 23049164: void cmd_netstat(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_netstat(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	word32 s1_36;
	word32 a0_37;
	word32 a3_38;
	word32 a4_39;
	word32 s2_40;
	word32 s3_41;
	word32 s4_42;
	word32 s6_43;
	tcpip_callback(587469446, 0x00, a3, a4, mstatus, dwArgD8, dwArg0118, dwArg0158, out s1_36, out a0_37, out a3_38, out a4_39, out s2_40, out s3_41, out s4_42, out s6_43);
}

// 23049172: void network_netutils_netstat_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_netstat_cli_register()
{
}

// 23049176: void ping_usage(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
// Called from:
//      ping_cmd
void ping_usage(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t23085CD8, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 2304918A: void ping_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0198)
void ping_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0198)
{
	word32 s1_16 = 0x23087000;
	while (true)
	{
		Eq_47572 s0_20 = *((word32) a5 + 32);
		if (a5 == 0x00)
			break;
		word32 a5_166;
		lwip_htons((word32) *((word32) a5 + 4), out a5_166);
		struct Eq_108479 * a5_31;
		Eq_242805 a2_34;
		Eq_2 a4_36;
		word32 a0_167;
		word32 a1_168;
		word32 a3_169;
		word32 a7_170;
		word32 s2_171;
		word32 s3_172;
		word32 s4_173;
		word32 s5_174;
		word32 s6_175;
		word32 s7_176;
		word32 s8_177;
		word32 s9_178;
		word32 s10_179;
		word32 s11_180;
		word32 t4_181;
		ra = printf(ra, s1_16 + -84, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_16, out a0_167, out a1_168, out a2_34, out a3_169, out a4_36, out a5_31, out a7_170, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out t4_181);
		word32 a5_182;
		word32 a2_183;
		word32 a4_184;
		a0 = utils_memp_free(*((word32) s0_20 + 24), utils_list_pop_front(a4_36, a5_31, out a5_182), a2_34, a4_36, out a2_183, out a3, out a4_184);
		word32 a5_63 = (word32) *((word32) s0_20 + 18);
		((word32) s0_20 + 18)->u1 = (byte) (a5_63 + ~0x00);
		a5 = a5_63 + ~0x00;
	}
	Eq_2 a2_72;
	Eq_2 a5_75;
	Eq_2 a5_84;
	word32 a3_185;
	word32 a4_186;
	Eq_2 s0_86 = utils_memp_deinit(raw_remove(a0, a3, a5, mstatus, out a2_72, out a3_185, out a4_186, out a5_75), a2_72, a5_75, mstatus, dwArg0128, dwArg0168, out a5_84);
	word32 s0_187;
	word32 s1_188;
	word32 a0_189;
	word32 a1_190;
	word32 a2_191;
	word32 a3_192;
	word32 a4_193;
	word32 a5_194;
	word32 a6_195;
	word32 s4_196;
	word32 t3_197;
	vPortFree(s0_86, dwArg48, a5_84, mstatus, dwArg0158, dwArg0198, out s0_187, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a6_195, out s4_196, out t3_197);
}

// 230491F2: void ping_timeout(Register Eq_2 ra, Register Eq_2 s1, Register Eq_242805 a2, Register Eq_2 a3, Register (ptr32 Eq_242936) a4, Register (ptr32 Eq_242937) a5, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void ping_timeout(Eq_2 ra, Eq_2 s1, Eq_242805 a2, Eq_2 a3, struct Eq_242936 * a4, struct Eq_242937 * a5, Eq_2 s2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, word32 dwArg18, Eq_2 dwArg24, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 s1_20 = 0x23087000;
	while (true)
	{
		Eq_2 s0_24 = a5->t0020;
		if (a5 == null)
			break;
		struct Eq_242964 * a5_26;
		Eq_190356 a0_25 = sys_now(out a5_26);
		s0_24 = a4->t0020;
		struct Eq_242973 * a4_29 = a5_26->ptr0008;
		if ((word32) *((word32) s0_24 + 16) >= a0_25 - a5_26)
			break;
		word32 a5_561;
		lwip_htons((word32) a4_29->w0004, out a5_561);
		struct Eq_108479 * a5_42;
		Eq_242805 a2_45;
		Eq_2 a4_47;
		word32 a0_562;
		word32 s3_567;
		word32 a1_563;
		word32 a7_565;
		word32 s2_566;
		word32 s4_568;
		word32 s5_569;
		word32 t4_575;
		word32 s9_572;
		word32 s10_573;
		word32 a3_564;
		word32 s8_571;
		word32 s11_574;
		word32 s6_570;
		ra = printf(ra, (word32) s1_20 - 84, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_20, out a0_562, out a1_563, out a2_45, out a3_564, out a4_47, out a5_42, out a7_565, out s2_566, out s3_567, out s4_568, out s5_569, out s6_570, out s7, out s8_571, out s9_572, out s10_573, out s11_574, out t4_575);
		word32 a5_576;
		utils_memp_free(*((word32) s0_24 + 24), utils_list_pop_front(a4_47, a5_42, out a5_576), a2_45, a4_47, out a2, out a3, out a4);
		word32 a5_74 = (word32) *((word32) s0_24 + 18);
		*((word32) s0_24 + 18) = (byte) (a5_74 + ~0x00);
		a5 = a5_74 + ~0x00;
	}
	Eq_2 a4_115 = (word32) *((word32) s0_24 + 18);
	if (a4_115 == 0x0A)
	{
		s0_24 = *((word32) s1_20 + 24);
		word32 a5_559;
		word32 a2_560;
		utils_memp_free(s1_20, utils_list_pop_front(a4_115, (struct Eq_108479 *) 0x0A, out a5_559), a2, a4_115, out a2_560, out a3, out a4_115);
		*((word32) s0_24 + 18) = (byte) ((word32) *((word32) s0_24 + 18) + ~0x00);
	}
	Eq_2 a0_120;
	Eq_2 s1_126;
	Eq_2 s3_132;
	Eq_2 s6_139;
	word32 s0_551;
	word32 a1_552;
	word32 a2_553;
	word32 a5_554;
	word32 a7_555;
	word32 s5_557;
	word32 s8_558;
	word32 s2_556;
	Eq_2 s4_133;
	ptr32 mstatus_136;
	Eq_2 a4_123;
	Eq_2 a3_122;
	Eq_2 ra_137 = pbuf_alloc(ra, s0_24, s1_20, 0x00A2, (word32) (word16) ((word32) *((word32) s0_24 + 0x0A) + 0x08), 640, a3, a4_115, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_551, out s1_126, out a0_120, out a1_552, out a2_553, out a3_122, out a4_123, out a5_554, out a7_555, out s2_556, out s3_132, out s4_133, out s5_557, out s6_139, out s8_558, out mstatus_136);
	Eq_2 s2_145 = a0_120;
	if (a0_120 != 0x00)
	{
		Eq_2 a4_146 = (word32) *((word32) a0_120 + 0x0A);
		Eq_2 a5_147 = (word32) *((word32) a0_120 + 8);
		if (a4_146 == a5_147 && a5_147 == 0x00)
		{
			Eq_243206 a0_149 = *((word32) s1_126 + 4);
			struct Eq_243210 * s0_150 = *((word32) a0_149 + 24);
			Eq_2 a0_151 = utils_memp_malloc(a0_149, a3_122, a4_146, out a4_146);
			s4_133 = a0_151;
			if (a0_151 != 0x00)
			{
				s1_126->u1 = 0x08;
				((word32) s1_126 + 1)->u1 = 0x00;
				((word32) s1_126 + 2)->u1 = 0x00;
				((word32) s1_126 + 3)->u1 = 0x00;
				uint32 a5_160 = (word32) s0_150->w000E;
				*((word32) s1_126 + 4) = (byte) a5_160;
				((word32) s1_126 + 5)->u1 = (byte) (a5_160 >> 8);
				uint32 a0_167 = (word32) s0_150->w000C + 0x01 << 16;
				s0_150->w000C = (word16) (a0_167 >> 16);
				word32 a5_594;
				Eq_2 a0_170 = lwip_htons(a0_167 >> 16, out a5_594);
				*((word32) s1_126 + 6) = (byte) a0_170;
				*((word32) s1_126 + 7) = (byte) (a0_170 >> 8);
				Eq_243287 a5_175 = 0x00;
				while (a5_175 < (word32) s3_132 - 8)
				{
					a4_146 = s1_126 + a5_175;
					((word32) a4_146 + 8)->u1 = (byte) a5_175;
					a5_175 = (word32) a5_175 + 1;
				}
				word32 a4_597;
				word32 a5_598;
				word32 a2_595;
				word32 a3_596;
				Eq_2 a0_186 = inet_chksum(s1_126, s3_132, a4_146, out a2_595, out a3_596, out a4_597, out a5_598);
				ui32 a5_193 = (word32) *((word32) s1_126 + 7);
				ui32 a4_194 = (word32) *((word32) s1_126 + 6);
				((word32) s1_126 + 2)->u1 = (byte) a0_186;
				*((word32) s1_126 + 3) = (byte) (a0_186 >> 8);
				Eq_2 a5_198 = a5_193 << 8 | a4_194;
				*((word32) a0_151 + 4) = (word16) a5_198;
				struct Eq_243335 * s0_225;
				word32 a5_600;
				word32 a0_599;
				ra_137 = raw_sendto(ra_137, a0_186 >> 8, a0_120, (a0_186 >> 8)->dw001C + 20, a5_198, a0_151, (word32) s3_132 - 8, s6_139, s7, mstatus_136, s4, dwArg04, dwArg18, s1, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_225, out a0_599, out a3_122, out a4_146, out a5_600, out s2_145, out s4_133, out mstatus_136);
				struct Eq_109009 * a5_243;
				*((word32) s4_133 + 8) = sys_now(out a5_243);
				utils_list_push_back(s4_133, a5_243);
				struct Eq_243366 * a5_248 = (word32) s0_225->b0012;
				s0_225->b0012 = (byte) ((char *) a5_248 + 1);
				a5_248->dw0006 = a5_248->dw0005;
			}
		}
		word32 s5_591;
		word32 s6_592;
		word32 s8_593;
		word32 a7_587;
		word32 s2_588;
		word32 s3_589;
		word32 s4_590;
		word32 a0_583;
		word32 a1_584;
		word32 a2_585;
		word32 a5_586;
		word32 s0_581;
		word32 s1_582;
		pbuf_free(ra_137, s2_145, a3_122, a4_146, s4_133, mstatus_136, dwArg0108, out s0_581, out s1_582, out a0_583, out a1_584, out a2_585, out a3_122, out a4_123, out a5_586, out a7_587, out s2_588, out s3_589, out s4_590, out s5_591, out s6_592, out s8_593, out mstatus_136);
	}
	int32 * a4_301;
	int32 * a5_302;
	word32 s1_304;
	word32 a3_579;
	word32 s8_580;
	word32 a0_577;
	word32 a2_578;
	sys_timeout(0x23049000, &g_t230491F2, a3_122, a4_123, mstatus_136, dwArg24, out s1_304, out a0_577, out a2_578, out a3_579, out a4_301, out a5_302, out s8_580);
	int32 s0_309 = *a5_302;
	if (a4_301 != a5_302)
		return;
	Eq_2 a3_323;
	Eq_2 a4_324;
	Eq_2 s1_327 = sys_untimeout(s1_304 + 498, s0_309, mstatus_136, out a3_323, out a4_324);
	word32 a5_606;
	word32 s8_607;
	word32 a2_603;
	word32 a3_604;
	word32 a4_605;
	word32 s1_601;
	word32 a0_602;
	sys_timeout(s1_327, &g_t2304918A, a3_323, a4_324, mstatus_136, dwArg44, out s1_601, out a0_602, out a2_603, out a3_604, out a4_605, out a5_606, out s8_607);
}

// 230493B4: void ping_recv(Register Eq_2 ra, Register (ptr32 Eq_243413) s1, Register (ptr32 Eq_243414) a0, Register (ptr32 Eq_243415) a1, Register (ptr32 Eq_243416) a2, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg94, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void ping_recv(Eq_2 ra, struct Eq_243413 * s1, struct Eq_243414 * a0, struct Eq_243415 * a1, struct Eq_243416 * a2, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg94, Eq_2 dwArgF8, word32 dwArg0128)
{
	struct Eq_243415 * a4_7 = (word32) a2->w0008;
	if (a4_7 != (word32) a0->w000A + 0x1C)
		return;
	struct Eq_243437 * a0_11 = a1->ptr0014;
	if (a1 != a4_7)
		return;
	word32 a7_395;
	word32 a6_394;
	word32 a5_393;
	word32 a4_392;
	word32 a3_391;
	word32 a2_390;
	word32 a1_389;
	memcpy(fp + -24, &a1->ptr0014, 0x08, out a1_389, out a2_390, out a3_391, out a4_392, out a5_393, out a6_394, out a7_395);
	struct Eq_243464 * a5_46 = (word32) bLoc18 | (word32) bLoc17;
	if (a5_46 == null && ((word32) wLoc14 == (word32) a0_11->w000E && (word32) a0_11->b0012 != 0x00))
	{
		word32 s0_51 = s1->dw0020;
		struct Eq_243464 * a4_52 = (word32) wLoc12;
		if (s1 == null)
			goto l230494A0;
		struct Eq_243464 * a3_53 = (word32) s1->w0004;
		if (a4_52 >= a3_53)
		{
			if (a4_52 == a3_53)
			{
				a5_46->dw0020 = s0_51;
				goto l2304941C;
			}
			do
			{
				struct Eq_243502 * s1_56 = a3_53->ptr0000;
				if (a3_53 == null)
					goto l230494A0;
				struct Eq_243464 * a2_57 = (word32) a3_53->w0004;
			} while (a2_57 < a4_52);
			if (a4_52 == a2_57)
			{
				word32 s0_61 = a5_46->dw0024;
				if (a3_53 == a5_46)
					s1_56->dw0024 = s0_61;
				a4_52->ptr0000 = a5_46->ptr0000;
l2304941C:
				Eq_2 a3_87;
				word32 a5_397;
				word32 a4_396;
				ip4addr_ntoa(out a3_87, out a4_396, out a5_397);
				word32 a5_398;
				lwip_htons((word32) wLoc12, out a5_398);
				word32 a5_399;
				sys_now(out a5_399);
				0x00 = dwArg94;
				Eq_2 a0_119;
				Eq_242805 a2_123;
				Eq_2 a4_125;
				Eq_2 s1_128;
				Eq_2 s2_131;
				Eq_2 s4_133;
				word32 t4_412;
				word32 s11_411;
				word32 s10_410;
				word32 s9_409;
				word32 s8_408;
				word32 s7_407;
				word32 s6_406;
				word32 s5_405;
				word32 s3_404;
				word32 a7_403;
				word32 a5_402;
				word32 a3_401;
				word32 a1_400;
				Eq_2 ra_127 = printf(ra, &g_t23086FD0, a3_87, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_128, out a0_119, out a1_400, out a2_123, out a3_401, out a4_125, out a5_402, out a7_403, out s2_131, out s3_404, out s4_133, out s5_405, out s6_406, out s7_407, out s8_408, out s9_409, out s10_410, out s11_411, out t4_412);
				struct Eq_243594 * s0_141 = *((word32) a0_119 + 24);
				Eq_2 a3_144;
				Eq_2 a4_146;
				word32 a2_413;
				utils_memp_free(a0_119, s1_128, a2_123, a4_125, out a2_413, out a3_144, out a4_146);
				s0_141->b0012 = (byte) ((word32) s0_141->b0012 + ~0x00);
				word32 a7_422;
				word32 a4_420;
				word32 a5_421;
				word32 a3_419;
				word32 s2_423;
				word32 s3_424;
				word32 s4_425;
				word32 s5_426;
				word32 s6_427;
				word32 mstatus_429;
				word32 s8_428;
				word32 a2_418;
				word32 a1_417;
				word32 a0_416;
				word32 s1_415;
				word32 s0_414;
				pbuf_free(ra_127, s2_131, a3_144, a4_146, s4_133, mstatus, dwArgF8, out s0_414, out s1_415, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s8_428, out mstatus_429);
				goto l230494A0;
			}
		}
	}
l230494A0:
	0x00 = dwArg0128;
}

// 230494B4: void ping_api_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack (ptr32 Eq_243659) dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack (ptr32 Eq_52584) dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      ping_cmd
void ping_api_init(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, struct Eq_243659 * dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, struct Eq_52584 * dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_27;
	word32 a1_28;
	Eq_2 a3_30;
	word32 s2_36;
	Eq_2 s3_37;
	word32 s1_300;
	word32 a2_301;
	word32 a4_302;
	word32 a5_303;
	word32 a6_304;
	word32 s4_305;
	word32 s8_306;
	pvPortMalloc(ra, a4, 40, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_300, out a0_27, out a1_28, out a2_301, out a3_30, out a4_302, out a5_303, out a6_304, out s2_36, out s3_37, out s4_305, out s8_306);
	if (a0_27 == 0x00)
	{
		word32 s1_310;
		word32 a0_311;
		word32 a1_312;
		word32 a2_313;
		word32 a3_314;
		word32 a4_315;
		word32 a5_316;
		word32 a7_317;
		word32 s2_318;
		word32 s3_319;
		word32 s4_320;
		word32 s5_321;
		word32 s6_322;
		word32 s7_323;
		word32 s8_324;
		word32 s9_325;
		word32 s10_326;
		word32 s11_327;
		word32 t4_328;
		printf(ra, &g_t23086ECC, a3_30, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_310, out a0_311, out a1_312, out a2_313, out a3_314, out a4_315, out a5_316, out a7_317, out s2_318, out s3_319, out s4_320, out s5_321, out s6_322, out s7_323, out s8_324, out s9_325, out s10_326, out s11_327, out t4_328);
		goto l230494E6;
	}
	struct Eq_274 * a0_122;
	dwArg34->dw0000 = (word32) a0_27;
	*((word32) a0_27 + 0x0A) = (word16) a1_28;
	*((word32) a0_27 + 4) = 0x00;
	*((word32) a0_27 + 8) = (word16) s3_37;
	*((word32) a0_27 + 0x0C) = 0x00;
	word32 a0_49;
	Eq_2 a4_52;
	struct Eq_243725 * a5_53;
	word32 a1_307;
	word32 a3_308;
	word32 s4_309;
	bl_rand(a0_27, dwArg34, out a0_49, out a1_307, out a3_308, out a4_52, out a5_53, out s4_309);
	*((word32) a1 + 0x0E) = (word16) a0_49;
	*((word32) a1 + 16) = (word16) s2_36;
	((word32) a1 + 18)->u1 = 0x00;
	a5_53->t0014 = a1;
	word32 a0_69;
	Eq_2 a4_73;
	Eq_2 a3_126;
	Eq_2 s0_76 = utils_memp_init(ra, 0x0C, 0x0A, 0x04, a4_52, s3_37, mstatus, s2, s0, dwArg04, dwArgD8, dwArgF8, dwArg0118, out a0_69, out a3_126, out a4_73);
	if (a0_69 != 0x00)
		a0_122 = (struct Eq_274 *) &g_t23086EE4;
	else
	{
		utils_list_init((word32) s0_76 + 32);
		Eq_2 a4_88;
		word32 s1_329;
		word32 a2_330;
		word32 a5_331;
		ra = raw_new(ra, 0x01, a3_126, a4_73, mstatus, out s1_329, out a2_330, out a3_126, out a4_88, out a5_331);
		if (true)
		{
			*(union Eq_2 *) 0x1D = s0_76;
			raw_recv(0x01, &g_t230493B4, s0_76);
			raw_bind(0x01, 587783820);
			word32 s1_332;
			word32 a0_333;
			word32 a2_334;
			word32 a3_335;
			word32 a4_336;
			word32 a5_337;
			word32 s8_338;
			sys_timeout(0x01, &g_t230491F2, a3_126, a4_88, mstatus, dwArg14, out s1_332, out a0_333, out a2_334, out a3_335, out a4_336, out a5_337, out s8_338);
			goto l230494E6;
		}
		a0_122 = (struct Eq_274 *) &g_t23086EF8;
	}
	Eq_2 a3_135;
	Eq_2 a5_155;
	Eq_2 a2_158;
	word32 s1_339;
	word32 a0_340;
	word32 a1_341;
	word32 a2_342;
	word32 a4_343;
	word32 a5_344;
	word32 a7_345;
	word32 s2_346;
	word32 s3_347;
	word32 s4_348;
	word32 s5_349;
	word32 s6_350;
	word32 s7_351;
	word32 s8_352;
	word32 s9_353;
	word32 s10_354;
	word32 s11_355;
	word32 t4_356;
	word32 s1_357;
	word32 a0_358;
	word32 a1_359;
	word32 a3_360;
	word32 a4_361;
	word32 a7_362;
	word32 s2_363;
	word32 s3_364;
	word32 s4_365;
	word32 s5_366;
	word32 s6_367;
	word32 s7_368;
	word32 s8_369;
	word32 s9_370;
	word32 s10_371;
	word32 s11_372;
	word32 t4_373;
	printf(printf(ra, a0_122, a3_126, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_339, out a0_340, out a1_341, out a2_342, out a3_135, out a4_343, out a5_344, out a7_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355, out t4_356), &g_t23086F34, a3_135, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_357, out a0_358, out a1_359, out a2_158, out a3_360, out a4_361, out a5_155, out a7_362, out s2_363, out s3_364, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out t4_373);
	word32 s0_374;
	word32 s1_375;
	word32 a0_376;
	word32 a1_377;
	word32 a2_378;
	word32 a3_379;
	word32 a4_380;
	word32 a5_381;
	word32 a6_382;
	word32 s4_383;
	word32 t3_384;
	vPortFree(s0_76, a2_158, a5_155, mstatus, dwArg0128, dwArg0168, out s0_374, out s1_375, out a0_376, out a1_377, out a2_378, out a3_379, out a4_380, out a5_381, out a6_382, out s4_383, out t3_384);
l230494E6:
	0x00 = (uint16) dwArg0128;
}

