pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23049598: void ping_cmd(Register Eq_2 ra, Register (ptr32 Eq_120302) a2, Register (ptr32 (arr (ptr32 Eq_250642))) a3, Register (ptr32 Eq_120302) a4, Register Eq_2 s2, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void ping_cmd(Eq_2 ra, struct Eq_120302 * a2, struct Eq_250642 * (* a3)[], struct Eq_120302 * a4, Eq_2 s2, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	utils_getopt_init(fp + -84, null);
	struct Eq_120302 * s5_34 = a2;
	word32 s8_345 = 0x23087000;
	ra_179 = ra;
l230495E2:
	Eq_2 ra_179;
	do
	{
		Eq_2 a0_60;
		Eq_2 s10_72;
		Eq_2 s11_73;
		Eq_2 s6_78;
		Eq_2 s7_79;
		Eq_2 s9_81;
		word32 s3_620;
		word32 s4_621;
		word32 a1_619;
		Eq_2 a3_161;
		ra_179 = utils_getopt(ra_179, fp + -84, s5_34, a3, s8_345 + -0x0098, a4, s10, dwArg00, dwArg04, dwArg28, ra, out a0_60, out a1_619, out a3_161, out s3_620, out s4_621, out s5_34, out s6_78, out s7_79, out s8_345, out s9_81, out s10_72, out s11_73);
		a4 = (struct Eq_120302 *) 87;
		if (a0_60 == s7_79)
		{
			if (s5_34 != (struct Eq_120302 *) 0x40)
			{
				word32 a0_574;
				word32 s11_589;
				word32 t4_590;
				word32 a2_576;
				word32 s1_573;
				word32 a1_575;
				word32 a4_577;
				word32 a5_578;
				word32 a7_579;
				word32 s4_582;
				word32 s3_581;
				word32 s2_580;
				word32 s6_584;
				word32 s7_585;
				word32 s9_587;
				word32 s8_586;
				word32 s10_588;
				word32 s5_583;
				ra_179 = printf(ra_179, &g_t23086F94, a3_161, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_573, out a0_574, out a1_575, out a2_576, out a3_161, out a4_577, out a5_578, out a7_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590);
				goto l23049676;
			}
			else
			{
				word32 a0_250;
				Eq_2 a3_253;
				Eq_2 a4_254;
				Eq_2 s1_259;
				Eq_2 s2_260;
				Eq_2 s3_261;
				word32 a5_591;
				Eq_2 s0_258 = lwip_gethostbyname(ra_179, *a0_60, a0_60, a3_161, mstatus, dwArg18, dwArg58, dwArg98, dwArgA8, dwArgD8, dwArgE8, out s1_259, out a0_250, out a3_253, out a4_254, out a5_591, out s2_260, out s3_261);
				if (a0_250 == 0x00)
				{
					word32 s11_609;
					word32 t4_610;
					word32 s6_604;
					word32 s9_607;
					word32 s10_608;
					word32 s7_605;
					word32 s8_606;
					word32 s3_601;
					word32 s4_602;
					word32 s5_603;
					word32 a5_598;
					word32 a7_599;
					word32 s2_600;
					word32 a0_593;
					word32 a3_596;
					word32 a4_597;
					word32 a1_594;
					word32 a2_595;
					word32 s1_592;
					printf(ra_179, &g_t23086F74, a3_253, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_592, out a0_593, out a1_594, out a2_595, out a3_596, out a4_597, out a5_598, out a7_599, out s2_600, out s3_601, out s4_602, out s5_603, out s6_604, out s7_605, out s8_606, out s9_607, out s10_608, out s11_609, out t4_610);
				}
				else
					ping_api_init(ra_179, s0_258, s3_261, s1_259, a4_254, *a4_254, s2_260, s3_261, mstatus, dwLoc5C, dwLoc50, dwLoc4C, dwLoc2C, dwLoc20, dwLoc1C, dwArg08, dwArg2C, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108);
				return;
			}
		}
		if (a0_60 == s6_78)
		{
			word32 a5_614;
			word32 a2_612;
			word32 a3_613;
			word32 a1_611;
			atoi(a0_60, out a1_611, out a2_612, out a3_613, out a4, out a5_614);
			goto l230495E2;
		}
		if (s6_78 < a0_60)
		{
			if (a0_60 == s9_81)
			{
				word32 a3_624;
				word32 a5_625;
				word32 a1_622;
				word32 a2_623;
				atoi(a0_60, out a1_622, out a2_623, out a3_624, out a4, out a5_625);
				goto l230495E2;
			}
			if (a0_60 == s10_72)
			{
				word32 a3_628;
				word32 a5_629;
				word32 a1_626;
				word32 a2_627;
				atoi(a0_60, out a1_626, out a2_627, out a3_628, out a4, out a5_629);
				goto l230495E2;
			}
			else
			{
				if (a0_60 == s11_73)
					goto l23049676;
				continue;
			}
		}
		struct Eq_274 * a0_142;
		if (a0_60 == 63)
		{
			a0_142 = (struct Eq_274 *) &g_t2307D904;
			goto l23049664;
		}
		if (a0_60 == 87)
		{
			word32 a3_617;
			word32 a5_618;
			word32 a1_615;
			word32 a2_616;
			atoi(a0_60, out a1_615, out a2_616, out a3_617, out a4, out a5_618);
			goto l230495E2;
		}
		a3_161.u0 = 58;
	} while (a0_60 != 58);
	a0_142 = (struct Eq_274 *) &g_t23086F48;
l23049664:
	word32 s11_646;
	word32 t4_647;
	word32 s9_644;
	word32 s10_645;
	word32 s7_642;
	word32 s8_643;
	word32 s5_640;
	word32 s6_641;
	word32 s3_638;
	word32 s4_639;
	word32 a7_636;
	word32 s2_637;
	word32 a4_634;
	word32 a5_635;
	word32 a1_632;
	word32 a2_633;
	word32 s1_630;
	word32 a0_631;
	ra_179 = printf(ra_179, a0_142, a3_161, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_630, out a0_631, out a1_632, out a2_633, out a3_161, out a4_634, out a5_635, out a7_636, out s2_637, out s3_638, out s4_639, out s5_640, out s6_641, out s7_642, out s8_643, out s9_644, out s10_645, out s11_646, out t4_647);
l23049676:
	ping_usage(ra_179, a3_161, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C);
}

// 230496E2: void network_netutils_ping_cli_register()
// Called from:
//      aos_loop_proc
void network_netutils_ping_cli_register()
{
}

// 230496E6: Register Eq_2 dirent_type(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      file_info
//      romfs_readdir
//      romfs_stat
Eq_2 dirent_type(Eq_2 a0, union Eq_2 & a5Out)
{
	Eq_2 a0_11;
	ui32 a5_5 = (word32) *((word32) a0 + 3);
	if ((a5_5 & 0x07) != 0x00)
	{
		a0_11.u0 = 0x02;
		if ((a5_5 & 0x07) != 0x02)
		{
			a0_11.u0 = 0x03;
			if ((a5_5 & 0x07) == 0x01)
			{
				a5Out.u0 = <invalid>;
				return 0x01;
			}
		}
	}
	else
		a0_11.u0 = 0x00;
	a5Out.u0 = <invalid>;
	return a0_11;
}

// 23049706: Register ui32 dirent_hardfh(Register Eq_2 a5, Register out (ptr32 Eq_244288) a5Out)
// Called from:
//      file_info
//      romfs_readdir
ui32 dirent_hardfh(Eq_2 a5, struct Eq_244288 & a5Out)
{
	struct Eq_244288 * a5_16 = a5 >> 8 & 0x0FFFFF00;
	a5Out = a5_16;
	return (a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5_16) & ~0x0F;
}

// 2304972E: Register ui32 dirent_childaddr(Register Eq_2 a5, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      dirent_file
//      romfs_opendir
ui32 dirent_childaddr(Eq_2 a5, union Eq_2 & a5Out)
{
	union Eq_2 * a5_16 = a5 >> 8 & 0x0FFFFF00;
	a5Out = a5_16;
	return (a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5_16) & ~0x0F;
}

// 23049756: Register ui32 dirent_size(Register uint32 a5, Register out ptr32 a3Out)
// Called from:
//      romfs_ioctl
//      romfs_read
//      romfs_lseek
//      romfs_stat
ui32 dirent_size(uint32 a5, ptr32 & a3Out)
{
	a3Out = 0x00FF0000;
	return a5 << 0x18 | a5 >> 0x18 | a5 << 0x08 & 0x00FF0000 | a5 >> 8 & 0x0FFFFF00;
}

// 2304977C: void romfs_close(Register (ptr32 Eq_244347) a0)
void romfs_close(struct Eq_244347 * a0)
{
	a0->dw0004 = 0x00;
	a0->dw0008 = 0x00;
}

