pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23049A16: void romfs_closedir(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void romfs_closedir(Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a1 == 0x00)
		return;
	word32 s1_52;
	word32 a0_53;
	word32 a2_54;
	word32 a3_55;
	word32 a4_56;
	word32 a5_57;
	word32 a6_58;
	word32 t3_59;
	aos_free(a1, a2, a5, mstatus, dwArg0148, dwArg0188, out s1_52, out a0_53, out a2_54, out a3_55, out a4_56, out a5_57, out a6_58, out t3_59);
}

// 23049A2E: void romfs_lseek(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register uint32 a5, Stack Eq_2 dwArg08, Stack word32 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void romfs_lseek(Eq_2 ra, word32 a0, Eq_2 a1, uint32 a5, Eq_2 dwArg08, word32 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_244396 * a1_12 = (struct Eq_244396 *) ~0x00;
	if (a0 == 0x00)
		return;
	Eq_2 a3_18;
	struct Eq_244396 * a0_17 = dirent_size(a5, out a3_18);
	Eq_2 s0_21 = a1;
	if (dwArg44 == 0x00)
	{
		if (true)
		{
			word32 t4_277;
			word32 s10_275;
			word32 s11_276;
			word32 s8_273;
			word32 s9_274;
			word32 s6_271;
			word32 s7_272;
			word32 s4_269;
			word32 s5_270;
			word32 s2_267;
			word32 s3_268;
			word32 a5_265;
			word32 a7_266;
			word32 a3_263;
			word32 a4_264;
			word32 a1_261;
			word32 a2_262;
			word32 s1_259;
			word32 a0_260;
			printf(ra, &g_t230872BC, a3_18, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_259, out a0_260, out a1_261, out a2_262, out a3_263, out a4_264, out a5_265, out a7_266, out s2_267, out s3_268, out s4_269, out s5_270, out s6_271, out s7_272, out s8_273, out s9_274, out s10_275, out s11_276, out t4_277);
			return;
		}
	}
	else
	{
		if (dwArg44 == 0x02)
		{
			if (false)
			{
				word32 s1_297;
				word32 a0_298;
				word32 a1_299;
				word32 a2_300;
				word32 a3_301;
				word32 a4_302;
				word32 a5_303;
				word32 a7_304;
				word32 s2_305;
				word32 s3_306;
				word32 s4_307;
				word32 s5_308;
				word32 s6_309;
				word32 s7_310;
				word32 s8_311;
				word32 s9_312;
				word32 s10_313;
				word32 s11_314;
				word32 t4_315;
				printf(ra, &g_t230872BC, a3_18, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303, out a7_304, out s2_305, out s3_306, out s4_307, out s5_308, out s6_309, out s7_310, out s8_311, out s9_312, out s10_313, out s11_314, out t4_315);
				return;
			}
			a1_12 = (struct Eq_244396 *) ((char *) a0_17 - 1);
		}
		else
		{
			if (dwArg44 != 0x01)
			{
				word32 s1_316;
				word32 a0_317;
				word32 a1_318;
				word32 a2_319;
				word32 a3_320;
				word32 a4_321;
				word32 a5_322;
				word32 a7_323;
				word32 s2_324;
				word32 s3_325;
				word32 s4_326;
				word32 s5_327;
				word32 s6_328;
				word32 s7_329;
				word32 s8_330;
				word32 s9_331;
				word32 s10_332;
				word32 s11_333;
				word32 t4_334;
				printf(ra, &g_t230872BC, a3_18, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_316, out a0_317, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a7_323, out s2_324, out s3_325, out s4_326, out s5_327, out s6_328, out s7_329, out s8_330, out s9_331, out s10_332, out s11_333, out t4_334);
				return;
			}
			s0_21 = *(union Eq_2 *) 0x09;
			a1_12 = null;
		}
		if (a1_12 < null)
		{
l23049A8A:
			word32 a0_279;
			word32 a2_281;
			word32 a3_282;
			word32 a4_283;
			word32 a5_284;
			word32 s2_286;
			word32 a7_285;
			word32 s3_287;
			word32 s4_288;
			word32 a1_280;
			word32 s1_278;
			word32 s5_289;
			word32 s6_290;
			word32 s7_291;
			word32 s8_292;
			word32 s9_293;
			word32 s10_294;
			word32 s11_295;
			word32 t4_296;
			printf(ra, &g_t230872BC, a3_18, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_278, out a0_279, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a7_285, out s2_286, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
			return;
		}
	}
	if (a0_17 >= a1_12)
	{
		a1_12->t0008 = s0_21;
		return;
	}
	goto l23049A8A;
}

// 23049ABA: void romfs_readdir(Register (ptr32 Eq_3005) a1, Register Eq_2 a5, Stack word32 dwArg1C, Stack word32 dwArg0128)
void romfs_readdir(struct Eq_3005 * a1, Eq_2 a5, word32 dwArg1C, word32 dwArg0128)
{
	if (a1 == null)
		return;
	a1_70 = a1;
	do
	{
		struct Eq_3005 * a1_70;
		struct Eq_245115 * s0_41 = *((word32) a5 + 16);
		if (a5 != 0x00)
		{
			Eq_2 s8_42 = s0_41->t000C;
			if (a5 < s8_42)
			{
				Eq_2 s9_44 = g_t4200DFC8;
				while (true)
				{
					Eq_2 s7_48 = s0_41->t0010;
					if (s7_48 >= s8_42)
						break;
					word32 a5_351;
					struct Eq_244601 * a0_52 = dirent_hardfh(a5, out a5_351);
					if (a0_52 == null)
						goto l23049AFE;
					if (s7_48 == 0x00)
						break;
					if (dirent_type(s7_48, out a5) <= ~0x01)
						goto l23049AFE;
					Mem66[a0_52 + s9_44 + 16:word32] = s0_41;
				}
			}
			goto l23049B34;
		}
		*((word32) a5 + 16) = *((word32) a5 + 8);
l23049AFE:
		Eq_2 a5_81;
		word32 a4_353;
		word32 a3_352;
		a1_70 = strncpy((char *) a1 + 25, (char *) a1_70 + 16, 64, out a3_352, out a4_353, out a5_81);
		a1->ptr0029->b0059 = 0x00;
		Eq_2 a5_100;
		struct Eq_244601 * a0_103 = dirent_hardfh(a5_81, out a5_100);
		if (a0_103 != null)
		{
			a5_100 = g_t4200DFC8;
			a0_103 += a5_100;
		}
		struct Eq_245133 * s0_102 = *((word32) a5_100 + 24);
		a0_103->ptr0010 = s0_102;
		a5 = a5_100 & 0x00FFFF00;
		if (a5 == 0x002E2E00)
		{
			a5 = (word32) s0_102->b001B;
			if (a5 != 0x00)
				break;
			continue;
		}
	} while (a5 == 0x02FFFE00);
l23049B34:
	0x00 = dwArg0128;
	0x00 = dwArg1C;
}

// 23049B98: Register Eq_2 dirent_file(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_245211) a1, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack word32 dwArg4C, Stack ptr32 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_2) a5Out, Register out (ptr32 Eq_245211) s2Out, Register out (ptr32 Eq_245224) s3Out)
// Called from:
//      romfs_opendir
//      romfs_stat
//      romfs_open
Eq_2 dirent_file(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_245211 * a1, Eq_2 a2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg18, word32 dwArg4C, ptr32 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a5Out, struct Eq_245211 & s2Out, struct Eq_245224 & s3Out)
{
	ptr32 a0_122;
	Eq_2 s0_171 = a0;
	struct Eq_245211 * s2_172 = a1;
	Eq_2 s1_162 = a2;
	struct Eq_245224 * s3_113 = &g_t23081000;
	word32 a4_776;
	word32 a3_771;
	word32 a5_773;
	word32 a2_770;
	word32 a1_769;
	word32 a4_772;
	word32 a3_775;
	word32 a1_774;
	union Eq_2 * a5_120;
	ptr32 a2_166;
	if (strlen(a0, out a1_769, out a2_770, out a3_771, out a4_772, out a5_773) < strlen(587732124, out a1_774, out a2_166, out a3_775, out a4_776, out a5_120))
	{
l23049C0E:
		a0_122 = ~0x00;
		goto l23049DAE;
	}
	struct Eq_274 * a0_204;
	Eq_2 ra_130;
	word32 a2_783;
	word32 a3_784;
	word32 a5_781;
	word32 a1_782;
	word32 a3_779;
	word32 a2_778;
	word32 a1_777;
	word32 a4_780;
	word32 a4_785;
	word32 a5_786;
	if (memcmp(a0, 587732124, strlen(587732124, out a1_777, out a2_778, out a3_779, out a4_780, out a5_781), out a1_782, out a2_783, out a3_784, out a4_785, out a5_786) == 0x00)
	{
		word32 a1_787;
		word32 a5_791;
		word32 a2_788;
		word32 a3_789;
		word32 a4_790;
		s0_171 = a0 + strlen(587732124, out a1_787, out a2_788, out a3_789, out a4_790, out a5_791);
		int32 a5_67 = (word32) *s0_171;
		if (a5_67 != 47)
		{
			if (a5_67 != 0x00)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_795;
					xTaskGetTickCountFromISR(out a5_795);
				}
				else
				{
					word32 a5_794;
					xTaskGetTickCount(out a5_794);
				}
l23049BF0:
				a0_204 = (struct Eq_274 *) &g_t2308711C;
				ra_130 = ra;
l23049C0A:
				word32 s8_834;
				word32 s11_837;
				word32 s10_836;
				word32 s9_835;
				word32 a3_828;
				word32 s5_831;
				word32 s7_833;
				word32 s6_832;
				word32 s4_830;
				word32 a4_829;
				word32 s1_825;
				word32 a1_827;
				word32 a0_826;
				bl_printk(ra_130, a0_204, 587756004, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_825, out a0_826, out a1_827, out a2_166, out a3_828, out a4_829, out a5_120, out s2_172, out s3_113, out s4_830, out s5_831, out s6_832, out s7_833, out s8_834, out s9_835, out s10_836, out s11_837);
				goto l23049C0E;
			}
		}
		else
			s0_171 = (word32) s0_171 + 1;
		a2_166 = 0x4200E000;
		Eq_2 s4_109 = 0x00;
		s3_113 = (struct Eq_245224 *) &g_t4200DFC8;
		Eq_2 s7_110 = 0x01;
		s6_115 = s6;
		ra_130 = ra;
		while (true)
		{
			Eq_2 s6_115;
			a5_120 = (word32) *s0_171;
			if (a5_120 == null)
				break;
			Eq_2 a5_102;
			word32 a3_797;
			word32 a4_798;
			word32 a1_796;
			Eq_2 a0_103 = strchr(s0_171, 47, out a1_796, out a2_166, out a3_797, out a4_798, out a5_102);
			if (s4_109 == s7_110)
			{
				s4_109 = s3_113->dw0000;
				if (s6_115 == (word32) s4_109 + dirent_childaddr(a5_102, out a5_120))
				{
					a0_122 = ~0x01;
					goto l23049DAE;
				}
			}
			if (a0_103 == 0x00)
			{
				word32 a3_816;
				word32 a5_818;
				word32 a4_817;
				word32 a2_815;
				word32 a1_814;
				if (strlen(s0_171, out a1_814, out a2_815, out a3_816, out a4_817, out a5_818) <= 64)
				{
					word32 a0_216;
					word32 s7_822;
					word32 s0_819;
					word32 s6_821;
					word32 s5_820;
					Eq_2 ra_230 = file_info(ra_130, s0_171, s1_162, s0_171, fp + -0x007C, fp + -0x0078, s4_109, dwLoc68, dwLoc54, s6, s4, s0, dwLoc04, dwArg4C, dwArg0118, out s0_819, out s1_162, out a0_216, out a2_166, out a5_120, out s2_172, out s3_113, out s5_820, out s6_821, out s7_822);
					if (a0_216 == 0x00)
						break;
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_839;
						xTaskGetTickCountFromISR(out a5_839);
					}
					else
					{
						word32 a5_838;
						xTaskGetTickCount(out a5_838);
					}
					word32 s9_852;
					word32 s10_853;
					word32 s11_854;
					word32 a4_846;
					word32 s6_849;
					word32 s8_851;
					word32 s7_850;
					word32 s5_848;
					word32 s4_847;
					word32 a0_843;
					word32 a3_845;
					word32 a1_844;
					word32 s1_842;
					bl_printk(ra_230, &g_t23087168, 587756004, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_842, out a0_843, out a1_844, out a2_166, out a3_845, out a4_846, out a5_120, out s2_172, out s3_113, out s4_847, out s5_848, out s6_849, out s7_850, out s8_851, out s9_852, out s10_853, out s11_854);
					s0_171 = dwLoc58;
					goto l23049C0E;
				}
				else
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_824;
						xTaskGetTickCountFromISR(out a5_824);
					}
					else
					{
						word32 a5_823;
						xTaskGetTickCount(out a5_823);
					}
					a0_204 = (struct Eq_274 *) &g_t23087144;
					goto l23049C0A;
				}
			}
			word32 a2_802;
			word32 t1_799;
			word32 a0_800;
			word32 a1_801;
			word32 a3_803;
			word32 a4_804;
			word32 a5_805;
			Eq_2 ra_137 = memset(ra_130, fp + -116, 0x00, 65, out t1_799, out a0_800, out a1_801, out a2_802, out a3_803, out a4_804, out a5_805);
			word32 a5_810;
			word32 a3_808;
			word32 a2_807;
			word32 a1_806;
			word32 a4_809;
			word32 a6_811;
			word32 a7_812;
			memcpy(fp + -116, s0_171, a0_103 - s0_171, out a1_806, out a2_807, out a3_808, out a4_809, out a5_810, out a6_811, out a7_812);
			word32 a0_164;
			word32 s5_174;
			word32 a5_813;
			ra_130 = file_info(ra_137, s0_171, s1_162, fp + -116, fp + -0x007C, fp + -0x0078, s4_109, dwLoc68, dwLoc54, s6, s4, s0, dwLoc04, dwArg4C, dwArg0118, out s0_171, out s1_162, out a0_164, out a2_166, out a5_813, out s2_172, out s3_113, out s5_174, out s6_115, out s7_110);
			if (a0_164 != 0x00)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_841;
					xTaskGetTickCountFromISR(out a5_841);
				}
				else
				{
					word32 a5_840;
					xTaskGetTickCount(out a5_840);
				}
				a0_204 = (struct Eq_274 *) &g_t230871BC;
				goto l23049C0A;
			}
			s0_171 = s5_174 + 1;
			s4_109.u0 = 0x01;
		}
		s2_172->dw0000 = a5_120;
		*a5_120 = (union Eq_2 *) s1_162;
		a0_122 = 0x00;
		s0_171 = dwArg64;
l23049DAE:
		s0Out = s0_171;
		s1Out = dwArg0118;
		a0Out = a0_122;
		a2Out = a2_166;
		a5Out = a5_120;
		s2Out = s2_172;
		s3Out = s3_113;
		return dwArg0158;
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_793;
			xTaskGetTickCountFromISR(out a5_793);
		}
		else
		{
			word32 a5_792;
			xTaskGetTickCount(out a5_792);
		}
		goto l23049BF0;
	}
}

// 23049DC8: void romfs_opendir(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s6, Register ptr32 mstatus, Stack (ptr32 Eq_245612) dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg2C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack ptr32 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
void romfs_opendir(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s6, ptr32 mstatus, struct Eq_245612 * dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg2C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	if (g_t4200DFC8 != 0x00)
	{
		Eq_2 a0_22;
		Eq_2 s1_30;
		Eq_2 s4_33;
		word32 s3_305;
		word32 s2_304;
		word32 a5_303;
		word32 a4_302;
		word32 a3_301;
		aos_malloc(ra, a1, 93, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_30, out a0_22, out a3_301, out a4_302, out a5_303, out s2_304, out s3_305, out s4_33);
		if (a0_22 == 0x00)
			return;
		word32 a0_53;
		Eq_2 a2_55;
		Eq_2 a5_58;
		Eq_2 s0_61;
		Eq_245667 s1_62;
		union Eq_245667 * s2_63;
		word32 s3_315;
		word32 a5_314;
		word32 a4_313;
		word32 a3_312;
		word32 a2_311;
		word32 a1_310;
		word32 a0_309;
		word32 t1_308;
		dirent_file(memset(ra, a0_22, 0x00, 93, out t1_308, out a0_309, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314), a0_22, s1_30, fp + ~0x17, fp + ~0x13, s4_33, s6, dwLoc08, dwArg2C, dwArgF8, out s0_61, out s1_62, out a0_53, out a2_55, out a5_58, out s2_63, out s3_315);
		if (a0_53 != 0x00)
		{
			word32 a2_318;
			word32 a3_319;
			word32 a0_317;
			word32 s1_316;
			word32 a4_320;
			word32 a5_321;
			word32 a6_322;
			word32 t3_323;
			aos_free(s0_61, a2_55, a5_58, mstatus, dwArg0138, dwArg0178, out s1_316, out a0_317, out a2_318, out a3_319, out a4_320, out a5_321, out a6_322, out t3_323);
		}
		else
		{
			struct Eq_245724 * a5_100;
			Eq_245667 s2_95 = *s2_63;
			if (s1_62 == s2_95)
			{
				word32 a1_324;
				word32 a2_325;
				word32 a3_326;
				word32 a4_327;
				(word32) s1_62.u1 + (((word32) strlen((word32) s1_62.u1 + 16, out a1_324, out a2_325, out a3_326, out a4_327, out a5_100) + 16 & ~0x0F) + 80) + 8 = dwArg04;
			}
			else
			{
				word32 a0_97 = dirent_childaddr(a5_58, out a5_100);
				if (a0_97 == 0x00)
					return;
				dwArg04->dw0008 = (word32) s2_95.u0 + a0_97;
			}
			dwArg04->dw0010 = 0x00;
			a5_100->ptr000C = dwArg04;
		}
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_307;
			xTaskGetTickCountFromISR(out a5_307);
		}
		else
		{
			word32 a5_306;
			xTaskGetTickCount(out a5_306);
		}
		word32 s1_328;
		word32 a0_329;
		word32 a1_330;
		word32 a2_331;
		word32 a3_332;
		word32 a4_333;
		word32 a5_334;
		word32 s2_335;
		word32 s3_336;
		word32 s4_337;
		word32 s5_338;
		word32 s6_339;
		word32 s7_340;
		word32 s8_341;
		word32 s9_342;
		word32 s10_343;
		word32 s11_344;
		bl_printk(ra, &g_t23087374, 587756004, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_328, out a0_329, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334, out s2_335, out s3_336, out s4_337, out s5_338, out s6_339, out s7_340, out s8_341, out s9_342, out s10_343, out s11_344);
	}
}

// 23049E8C: void romfs_stat(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack word32 dwArg2C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack ptr32 dwArgF8)
void romfs_stat(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg08, word32 dwArg2C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 dwArgF8)
{
	word32 a0_22;
	struct Eq_245822 * s1_31;
	Eq_2 s2_32;
	word32 s0_263;
	word32 s3_266;
	word32 a5_265;
	word32 a2_264;
	Eq_2 ra_29 = dirent_file(ra, s0, a1, fp + ~0x17, fp + ~0x13, s4, s6, dwLoc08, dwArg2C, dwArgF8, out s0_263, out s1_31, out a0_22, out a2_264, out a5_265, out s2_32, out s3_266);
	if (a0_22 == 0x00)
	{
		if (s2_32 != g_t4200DFC8)
		{
			struct Eq_245861 * a5_107;
			word32 a5_269;
			up32 a0_55 = dirent_type(s2_32, out a5_269);
			if (a0_55 == 0x01)
			{
				s1_31->dw0010 = 0x00;
				a5_107 = (struct Eq_245861 *) 0x04000000;
			}
			else
			{
				if (a0_55 != 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_289;
						xTaskGetTickCountFromISR(out a5_289);
					}
					else
					{
						word32 a5_288;
						xTaskGetTickCount(out a5_288);
					}
					word32 s1_290;
					word32 a0_291;
					word32 a1_292;
					word32 a2_293;
					word32 a3_294;
					word32 a4_295;
					word32 a5_296;
					word32 s2_297;
					word32 s3_298;
					word32 s4_299;
					word32 s5_300;
					word32 s6_301;
					word32 s7_302;
					word32 s8_303;
					word32 s9_304;
					word32 s10_305;
					word32 s11_306;
					bl_printk(ra_29, &g_t230874D8, 587756004, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_290, out a0_291, out a1_292, out a2_293, out a3_294, out a4_295, out a5_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s7_302, out s8_303, out s9_304, out s10_305, out s11_306);
					return;
				}
				word32 a3_270;
				dirent_size(0x02, out a3_270)->ptr0010 = s1_31;
				a5_107 = (struct Eq_245861 *) 0x08000000;
			}
			a5_107->ptr0004 = s1_31;
		}
		else
			s1_31->dw0010 = 0x00;
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_268;
			xTaskGetTickCountFromISR(out a5_268);
		}
		else
		{
			word32 a5_267;
			xTaskGetTickCount(out a5_267);
		}
		word32 s6_282;
		word32 s7_283;
		word32 s8_284;
		word32 s9_285;
		word32 s10_286;
		word32 s11_287;
		word32 s5_281;
		word32 s4_280;
		word32 a4_276;
		word32 s3_279;
		word32 s2_278;
		word32 a5_277;
		word32 a3_275;
		word32 s1_271;
		word32 a2_274;
		word32 a1_273;
		word32 a0_272;
		bl_printk(ra_29, &g_t230874AC, 587756004, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_271, out a0_272, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277, out s2_278, out s3_279, out s4_280, out s5_281, out s6_282, out s7_283, out s8_284, out s9_285, out s10_286, out s11_287);
	}
}

