pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304A394: void sntp_cli_init()
// Called from:
//      aos_loop_proc
void sntp_cli_init()
{
}

// 2304A398: void sntp_retry(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34)
// Called from:
//      sntp_recv
//      sntp_dns_found
void sntp_retry(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34)
{
	word32 * a3_20;
	word32 s8_58;
	word32 a5_57;
	word32 a4_56;
	word32 a2_55;
	word32 a0_54;
	word32 s1_53;
	sys_timeout(s1, &g_t2304A608, a3, a4, mstatus, dwArg34, out s1_53, out a0_54, out a2_55, out a3_20, out a4_56, out a5_57, out s8_58);
	word32 s0_28 = *a3_20;
	if (a3_20 << 0x01 <= 150000 && a3_20 < a3_20 << 0x01)
		null[a3_20].dw0000 = s0_28;
}

// 2304A3D6: void sntp_recv(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void sntp_recv(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, word32 dwArg0128)
{
	word32 s8_436;
	word32 s7_435;
	word32 s6_434;
	word32 s5_433;
	word32 s3_432;
	word32 s2_431;
	word32 a5_429;
	word32 a7_430;
	word32 a0_425;
	word32 a1_426;
	word32 a2_427;
	word32 a4_428;
	word32 s9_437;
	word32 s10_438;
	word32 s11_439;
	word32 t4_440;
	Eq_2 s1_108;
	Eq_2 a3_104;
	Eq_2 s4_113;
	Eq_2 ra_107 = printf(ra, &g_t230876C0, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_108, out a0_425, out a1_426, out a2_427, out a3_104, out a4_428, out a5_429, out a7_430, out s2_431, out s3_432, out s4_113, out s5_433, out s6_434, out s7_435, out s8_436, out s9_437, out s10_438, out s11_439, out t4_440);
	Eq_2 a4_105 = (word32) *((word32) s1_108 + 8);
	if (a4_105 == 48)
	{
		Eq_2 a0_46 = pbuf_get_at(s1_108, 0x00, out a3_104, out a4_105);
		word32 a5_53 = (word32) g_b4200DFD4;
		if (a5_53 == 0x00)
		{
			if ((a0_46 & 0x07) != 0x04)
				goto l2304A444;
		}
		else
		{
			a4_105.u0 = 0x01;
			if (a5_53 != 0x01 || (a0_46 & 0x07) != 0x05)
				goto l2304A444;
		}
		Eq_2 a3_65;
		word32 a4_469;
		if (pbuf_get_at(s1_108, 0x01, out a3_65, out a4_469) == 0x00)
		{
			word32 a0_477;
			word32 a1_478;
			word32 a2_479;
			word32 a5_480;
			word32 a7_481;
			word32 s2_482;
			word32 s3_483;
			word32 s5_484;
			word32 s6_485;
			word32 s7_486;
			word32 s8_487;
			word32 s9_488;
			word32 s10_489;
			word32 s11_490;
			word32 t4_491;
			ra_107 = printf(ra_107, &g_t230876D0, a3_65, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_108, out a0_477, out a1_478, out a2_479, out a3_104, out a4_105, out a5_480, out a7_481, out s2_482, out s3_483, out s4_113, out s5_484, out s6_485, out s7_486, out s8_487, out s9_488, out s10_489, out s11_490, out t4_491);
		}
		else
		{
			word32 a0_470;
			word32 a1_471;
			word32 a2_472;
			word32 a5_473;
			word32 s2_474;
			word32 s3_475;
			word32 s8_476;
			pbuf_copy_partial(s1_108, fp + -40, 0x08, 40, out s1_108, out a0_470, out a1_471, out a2_472, out a3_104, out a4_105, out a5_473, out s2_474, out s3_475, out s4_113, out s8_476);
		}
	}
l2304A444:
	word32 s0_135;
	Eq_2 a3_139;
	ptr32 mstatus_156;
	Eq_2 a0_160;
	Eq_2 a3_165;
	Eq_2 a4_166;
	Eq_2 s1_169;
	word32 s1_441;
	word32 a0_442;
	word32 a1_443;
	word32 a2_444;
	word32 a4_445;
	word32 a5_446;
	word32 a7_447;
	word32 s2_448;
	word32 s3_449;
	word32 s4_450;
	word32 s5_451;
	word32 s6_452;
	word32 s8_453;
	word32 a1_454;
	word32 a2_455;
	word32 a5_456;
	word32 a7_457;
	word32 s2_458;
	word32 s3_459;
	word32 s4_460;
	word32 s5_461;
	word32 s6_462;
	word32 s7_463;
	word32 s8_464;
	word32 s9_465;
	word32 s10_466;
	word32 s11_467;
	word32 t4_468;
	Eq_2 ra_168 = printf(pbuf_free(ra_107, s1_108, a3_104, a4_105, s4_113, mstatus, dwArgF8, out s0_135, out s1_441, out a0_442, out a1_443, out a2_444, out a3_139, out a4_445, out a5_446, out a7_447, out s2_448, out s3_449, out s4_450, out s5_451, out s6_452, out s8_453, out mstatus_156), &g_t230876F4, a3_139, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_169, out a0_160, out a1_454, out a2_455, out a3_165, out a4_166, out a5_456, out a7_457, out s2_458, out s3_459, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467, out t4_468);
	if (s0_135 == 0x00)
	{
		word32 a3_492;
		word32 a4_493;
		word32 a5_494;
		Eq_2 a0_199 = lwip_htonl(a0_160, out a3_492, out a4_493, out a5_494);
		Eq_2 a3_208;
		word32 a4_495;
		word32 a5_496;
		lwip_htonl(a0_199, out a3_208, out a4_495, out a5_496);
		Eq_2 a3_219;
		Eq_2 a4_220;
		uint32 s1_223;
		uint32 * s2_226;
		union Eq_247203 * s3_227;
		word32 a0_497;
		word32 a1_498;
		word32 a2_499;
		word32 a5_500;
		word32 a7_501;
		word32 s4_502;
		word32 s5_503;
		word32 s6_504;
		word32 s7_505;
		word32 s8_506;
		word32 s9_507;
		word32 s10_508;
		word32 s11_509;
		word32 t4_510;
		Eq_2 ra_222 = printf(ra_168, &g_t23087704, a3_208, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_223, out a0_497, out a1_498, out a2_499, out a3_219, out a4_220, out a5_500, out a7_501, out s2_226, out s3_227, out s4_502, out s5_503, out s6_504, out s7_505, out s8_506, out s9_507, out s10_508, out s11_509, out t4_510);
		word32 a5_511;
		vTaskEnterCritical(a4_220, mstatus_156, out a5_511);
		*s3_227 = (word32) a0_199 + 0x7C558180;
		*s2_226 = s1_223;
		word32 a5_512;
		g_t4200EFE0 = xTaskGetTickCount(out a5_512);
		Eq_247203 a1_249 = *s3_227;
		uint32 a0_253 = (*s2_226 >> 1000) + ((word32) a1_249.u1 + 1000);
		bl_sys_time_update(a0_253, (bool) ((a1_249 > 1000) + (a0_253 < (word32) a1_249.u1 + 1000)));
		word32 a4_513;
		word32 a5_514;
		word32 s1_515;
		word32 a0_516;
		word32 a1_517;
		word32 a2_518;
		word32 a3_519;
		word32 a4_520;
		word32 a5_521;
		word32 a7_522;
		word32 s2_523;
		word32 s3_524;
		word32 s4_525;
		word32 s5_526;
		word32 s6_527;
		word32 s7_528;
		word32 s8_529;
		word32 s9_530;
		word32 s10_531;
		word32 s11_532;
		word32 t4_533;
		printf(ra_222, &g_t23087714, vTaskExitCritical(a3_219, mstatus_156, out a4_513, out a5_514), dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_515, out a0_516, out a1_517, out a2_518, out a3_519, out a4_520, out a5_521, out a7_522, out s2_523, out s3_524, out s4_525, out s5_526, out s6_527, out s7_528, out s8_529, out s9_530, out s10_531, out s11_532, out t4_533);
		g_b4201528C = (byte) ((word32) g_b4201528C | 1);
		if ((word32) g_b4200DFD4 == 0x00)
		{
			word32 a3_534;
			word32 a4_535;
			sys_untimeout(587506584, 0x00, mstatus_156, out a3_534, out a4_535);
			Eq_2 a3_317;
			word32 a4_536;
			Eq_2 s1_321 = sys_untimeout(587507208, 0x00, mstatus_156, out a3_317, out a4_536);
			g_dw4200EFDC = 0x03FFFA98;
			word32 s1_537;
			word32 a0_538;
			word32 a2_539;
			word32 a3_540;
			word32 a4_541;
			word32 a5_542;
			word32 s8_543;
			sys_timeout(s1_321, &g_t2304A608, a3_317, 0x4200E000, mstatus_156, dwArg14, out s1_537, out a0_538, out a2_539, out a3_540, out a4_541, out a5_542, out s8_543);
		}
	}
	else if (s0_135 == 0x01 && (word32) g_b4200DFD4 == 0x00)
		sntp_retry(s1_169, a3_165, a4_166, mstatus_156, dwArg04);
	0x00 = dwArg0128;
}

// 2304A57C: void sntp_send_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
// Called from:
//      sntp_request
//      sntp_dns_found
void sntp_send_request(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	struct Eq_224941 * a1_129;
	word32 a0_20;
	Eq_55976 s2_31;
	Eq_2 s4_33;
	word32 s0_197;
	word32 a1_198;
	word32 a2_199;
	word32 a5_200;
	word32 a7_201;
	word32 s3_202;
	word32 s5_203;
	word32 s6_204;
	word32 s8_205;
	Eq_2 s1_106;
	ptr32 mstatus_120;
	Eq_2 a4_127;
	Eq_2 a3_103;
	Eq_2 ra_37 = pbuf_alloc(ra, s0, s1, 0x00B6, 48, 640, a3, a4, mstatus, s0, dwArg34, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0148, out s0_197, out s1_106, out a0_20, out a1_198, out a2_199, out a3_103, out a4_127, out a5_200, out a7_201, out s2_31, out s3_202, out s4_33, out s5_203, out s6_204, out s8_205, out mstatus_120);
	if (a0_20 != 0x00)
	{
		Eq_2 a0_48 = *((word32) s1_106 + 4);
		word32 t1_206;
		word32 a0_207;
		word32 a1_208;
		word32 a2_209;
		word32 a3_210;
		word32 a4_211;
		word32 a5_212;
		Eq_2 ra_59 = memset(ra_37, s1_106, 0x00, 48, out t1_206, out a0_207, out a1_208, out a2_209, out a3_210, out a4_211, out a5_212);
		s1_106->u1 = 0x23;
		Eq_2 a3_72;
		Eq_2 a4_73;
		ptr32 mstatus_77;
		Eq_2 s0_79;
		Eq_2 s4_83;
		word32 s1_213;
		word32 a0_214;
		word32 s3_215;
		word32 s5_216;
		word32 s9_217;
		word32 s0_218;
		word32 a0_219;
		word32 a1_220;
		word32 a2_221;
		word32 a4_222;
		word32 a5_223;
		word32 a7_224;
		word32 s2_225;
		word32 s3_226;
		word32 s4_227;
		word32 s5_228;
		word32 s6_229;
		word32 s8_230;
		pbuf_free(udp_sendto(ra_59, g_t4200DFD8, a0_48, s2_31, 0x007B, s4_33, mstatus_120, dwArg04, dwArg18, dwArg38, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_79, out s1_213, out a0_214, out a3_72, out a4_73, out s3_215, out s4_83, out s5_216, out s9_217, out mstatus_77), s0_79, a3_72, a4_73, s4_83, mstatus_77, dwArg0118, out s0_218, out s1_106, out a0_219, out a1_220, out a2_221, out a3_103, out a4_222, out a5_223, out a7_224, out s2_225, out s3_226, out s4_227, out s5_228, out s6_229, out s8_230, out mstatus_120);
		ui32 a4_124 = (word32) g_b4201528C;
		g_b4201528C = (byte) (a4_124 << 1);
		a4_127 = a4_124 << 1;
		a1_129 = &g_t2304A398;
	}
	else
		a1_129 = &g_t2304A608;
	0x00 = (uint16) dwArg38;
	word32 s1_231;
	word32 a0_232;
	word32 a2_233;
	word32 a3_234;
	word32 a4_235;
	word32 a5_236;
	word32 s8_237;
	sys_timeout(s1_106, a1_129, a3_103, a4_127, mstatus_120, dwArg44, out s1_231, out a0_232, out a2_233, out a3_234, out a4_235, out a5_236, out s8_237);
}

// 2304A608: void sntp_request(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_247528) a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void sntp_request(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, struct Eq_247528 * a5, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 s0_12;
	struct Eq_247553 * s0_8 = *a0;
	if (a0 != 0x00)
	{
		s0_8->dw0004 = 0x00;
		word32 a0_24;
		word32 s2_229;
		word32 s3_230;
		word32 s4_231;
		ra = dns_gethostbyname(ra, a0, fp + ~0x13, 0x00, s2, s5, s6, s8, mstatus, dwLoc18, dwLoc04, dwArg18, dwArg28, dwArg48, dwArg58, dwArg68, dwArg88, dwArg98, dwArgC8, dwArg0108, dwArg0148, out s0_12, out s1, out a0_24, out a3, out a4, out s2_229, out s3_230, out s4_231, out mstatus);
		if (a0_24 == ~0x04)
			return;
		if (a0_24 == 0x00)
		{
			*(union Eq_2 *) ~0x00 = s0_12;
l2304A63A:
			sntp_send_request(ra, s0_12, s1, a3, a4, mstatus, dwLoc1C, dwLoc08, dwArg14, dwArg18, dwArg24, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128);
			return;
		}
	}
	else
	{
		s0_12 = a5->t0004;
		if (a5 != null)
			goto l2304A63A;
	}
	word32 s1_232;
	word32 a0_233;
	word32 a2_234;
	word32 a3_235;
	word32 a4_236;
	word32 a5_237;
	word32 s8_238;
	sys_timeout(s1, &g_t2304A398, a3, a4, mstatus, dwArg24, out s1_232, out a0_233, out a2_234, out a3_235, out a4_236, out a5_237, out s8_238);
}

