pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304A664: void sntp_dns_found(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void sntp_dns_found(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	if (a1 == 0x00)
		sntp_retry(s1, a3, a4, mstatus, dwArg34);
	else
	{
		g_t42015288 = a4;
		sntp_send_request(ra, s0, s1, a3, a4, mstatus, dwArg04, dwArg18, dwArg34, dwArg38, dwArg44, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0148);
	}
}

// 2304A67C: void sntp_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 word32) a5, Register ptr32 mstatus, Stack (ptr32 Eq_2) dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      _startup_sntp
void sntp_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, word32 * a5, ptr32 mstatus, union Eq_2 * dwArg10, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s0_8 = *a5;
	if (a5 != null)
		return;
	Eq_2 a3_18;
	word32 s1_196;
	word32 a4_197;
	word32 a5_198;
	Eq_2 ra_21 = udp_new_ip_type(ra, s1, a3, a4, mstatus, out s1_196, out a3_18, out a4_197, out a5_198);
	*(word32 *) 46 = s0_8;
	Eq_2 a0_30;
	word32 s1_199;
	word32 a1_200;
	word32 a2_201;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 a7_205;
	word32 s2_206;
	word32 s3_207;
	word32 s4_208;
	word32 s5_209;
	word32 s6_210;
	word32 s7_211;
	word32 s8_212;
	word32 s9_213;
	word32 s10_214;
	word32 s11_215;
	word32 t4_216;
	printf(ra_21, &g_t230876A4, a3_18, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_199, out a0_30, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
	if (a0_30 == 0x00)
		return;
	udp_recv(a0_30, &g_t2304A3D6, 0x00);
	word32 a5_57 = (word32) g_b4200DFD4;
	if (a5_57 != 0x00)
	{
		if (a5_57 != 0x01)
			return;
		((word32) a0_30 + 9)->u1 = (byte) ((word32) *((word32) a0_30 + 9) | 32);
		word32 a3_228;
		word32 a4_229;
		word32 a5_230;
		udp_bind(a0_30, 587783820, dwArg10, out a3_228, out a4_229, out a5_230);
	}
	else
	{
		g_dw4200EFDC = 0x03FFFA98;
		Eq_2 a3_86;
		Eq_2 a4_87;
		word32 a0_217;
		word32 a1_218;
		word32 a5_219;
		word32 s4_220;
		Eq_2 s1_89 = bl_rand(a0_30, null, out a0_217, out a1_218, out a3_86, out a4_87, out a5_219, out s4_220);
		word32 s1_221;
		word32 a0_222;
		word32 a2_223;
		word32 a3_224;
		word32 a4_225;
		word32 a5_226;
		word32 s8_227;
		sys_timeout(s1_89, &g_t2304A608, a3_86, a4_87, mstatus, dwArg44, out s1_221, out a0_222, out a2_223, out a3_224, out a4_225, out a5_226, out s8_227);
	}
}

// 2304A724: void sntp_setoperatingmode(Register word32 a0)
// Called from:
//      _startup_sntp
void sntp_setoperatingmode(word32 a0)
{
	g_b4200EFD4 = (byte) a0;
}

// 2304A72E: Register (ptr32 Eq_2) sntp_get_time(Register (ptr32 Eq_2) a0, Register Eq_246724 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out Eq_2 a3Out)
// Called from:
//      cmd_sntp_date
//      cmd_sntp_time
union Eq_2 * sntp_get_time(union Eq_2 * a0, Eq_246724 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, word32 dwArg38, union Eq_2 & a3Out)
{
	word32 a5_20;
	vTaskEnterCritical(a4, mstatus, out a5_20);
	if (a5_20 == 0x00)
	{
		*a0 = (union Eq_2 *) 0x00;
		(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&a1.a0000[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (Eq_246724) 0x00;
	}
	else
	{
		word32 a5_69;
		ui32 a0_30 = xTaskGetTickCount(out a5_69) - g_dw4200DFE0;
		Eq_247795 a5_32 = g_t4200DFCC;
		a3 = (a0_30 ^ 1000) + a2;
		*a0 = (union Eq_2 *) a3;
		Mem39[(a0_30 | 1000) + (a5_32 >>u 1000):word32] = a1;
	}
	word32 a5_71;
	word32 a4_70;
	Eq_2 a3_46 = vTaskExitCritical(a3, mstatus, out a4_70, out a5_71);
	0x00 = dwArg38;
	a3Out = a3_46;
	return null;
}

// 2304A79A: Register word32 sntp_setservername(Register word32 a0, Register word32 a1)
// Called from:
//      _startup_sntp
word32 sntp_setservername(word32 a0, word32 a1)
{
	if (a0 == 0x00)
	{
		g_dw42015284 = a1;
		a5 = 0x42015000;
	}
	return a5;
}

// 2304A7A6: void utils_bin2hex(Register (ptr32 Eq_123623) a0, Register (ptr32 Eq_123641) a1, Register int32 a2)
// Called from:
//      wifi_mgmr_psk_cal
void utils_bin2hex(struct Eq_123623 * a0, struct Eq_123641 * a1, int32 a2)
{
	struct Eq_123641 * a7_6 = a1 + a2;
	struct Eq_123623 * a4_15 = a0;
	while (a1 != a7_6)
	{
		++a1;
		uint32 a5_14 = (word32) a1->bFFFFFFFF;
		++a4_15;
		word32 a5_23 = (word32) (a5_14 & 0x0F)->b23087730;
		a4_15[0x07FF] = (struct Eq_123623) (byte) (word32) (a5_14 >> 0x04)->b23087730;
		a4_15->b0FFF = (byte) a5_23;
	}
}

// 2304A7E2: void utils_sha256_init(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void utils_sha256_init(Eq_2 ra, Eq_2 a0)
{
	word32 t1_16;
	word32 a0_17;
	word32 a1_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	memset(ra, a0, 0x00, 0x006C, out t1_16, out a0_17, out a1_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 2304A7EC: void utils_sha256_free(Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void utils_sha256_free(Eq_2 a0)
{
	a0_5 = a0;
	if (a0 != 0x00)
	{
		while (true)
		{
			Eq_2 a0_5;
			if (a0_5 == (word32) a0 + 0x006C)
				break;
			a0_5->u1 = 0x00;
			a0_5 = (word32) a0_5 + 1;
		}
	}
}

// 2304A800: void utils_sha256_starts(Register Eq_2 a0)
// Called from:
//      ota_tcp_cmd
void utils_sha256_starts(Eq_2 a0)
{
	*(union Eq_2 *) 1779033711 = a0;
	*(union Eq_2 *) 3144134289 = a0;
	*(union Eq_2 *) 0x3C6EF382 = a0;
	*(union Eq_2 *) 2773480782 = a0;
	*(union Eq_2 *) 1359893143 = a0;
	*(union Eq_2 *) 2600822952 = a0;
	*(union Eq_2 *) 528734667 = a0;
	*a0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	*(union Eq_2 *) 1541459261 = a0;
	((word32) a0 + 0x0068)->u0 = 0x00;
}

// 2304A85E: Register uint32 utils_sha256_process(Register uint32 t1, Register word32 a0, Register (ptr32 Eq_247927) a1, Register Eq_2 a3, Register Eq_135580 a7, Register out Eq_247930 a3Out, Register out Eq_135580 a7Out)
// Called from:
//      utils_sha256_update
uint32 utils_sha256_process(uint32 t1, word32 a0, struct Eq_247927 * a1, Eq_2 a3, Eq_135580 a7, union Eq_247930 & a3Out, union Eq_135580 & a7Out)
{
	struct Eq_247932 * s2_9 = a0 + 8;
	int32 * s3_10 = fp + -336;
	struct Eq_247939 * a4_26 = fp + -336;
	do
	{
		word32 a5_30 = *a3;
		++a4_26;
		a4_26[0x03FF] = (struct Eq_247939) a3;
	} while (a0 + 40 != a5_30 + 0x04);
	struct Eq_247955 * a4_116 = fp + -304;
	a1_350 = a1;
	do
	{
		struct Eq_247927 * a1_350;
		++a1_350;
		ui32 a3_54 = (word32) a1_350->bFFFFFFFE;
		++a4_116;
		uint32 a5_120 = (word32) a1_350->b0000 << 24 | (word32) a1_350->b0001 << 16 | (word32) a1_350->bFFFFFFFF | a3_54 << 8;
		a4_116[0x03FF] = (struct Eq_247955) a5_120;
		Eq_247930 a3_113 = a3_54 << 8;
	} while (a1 + 16 != a1_350);
	0x00 = dwLocCC;
	struct Eq_248000 * t3_401 = dwLoc0148;
	uint32 a6_274 = dwLoc0128;
	uint32 a2_101 = dwLoc6C;
	struct Eq_248006 * s1_448 = &g_a23087728->dw001C;
	struct Eq_248000 * t6_70 = dwLoc0148;
	struct Eq_248009 * t4_71 = &g_a23087728->dw001C;
	do
	{
		word32 a6_100 = a6_274 + (((((a7 >> 0x06 | a7 << 0x1A) ^ (a7 >> 11 | a7 << 0x15)) ^ (a7 << 0x07 | a7 >> 0x19)) + (t4_71->dw0000 + t6_70->dw0000)) + ((t1 ^ a1_350) & a7 ^ t1));
		++t6_70;
		++t4_71;
		uint32 a5_121 = a5_120 + a6_100;
		int32 t5_142 = ((a5_121 >> 0x06 | a5_121 << 0x1A) ^ (a5_121 >> 11 | a5_121 << 0x15) ^ (a5_121 << 0x07 | a5_121 >> 0x19)) + ((t1 + (t4_71->dwFFFFFFE4 + t6_70->dwFFFFFFE4)) + ((a7 ^ a1_350) & a5_121 ^ a1_350));
		uint32 a6_123 = a6_100 + ((((a2_101 >> 0x02 | a2_101 << 0x1E) ^ (a2_101 >> 0x0D | a2_101 << 0x13)) ^ (a2_101 << 0x0A | a2_101 >> 22)) + ((a2_101 | a3_113) & a4_116 | a2_101 & a3_113));
		Eq_248103 a4_160 = a4_116 + t5_142 / 4;
		ui32 t5_180 = a1_350 + (t4_71->dwFFFFFFE8 + t6_70->dwFFFFFFE8) / 4 + ((a5_121 ^ a7) & a4_160 ^ a7) / 4 + (((a4_160 >> 0x06 | a4_160 << 0x1A) ^ (a4_160 >> 11 | a4_160 << 0x15)) ^ (a4_160 << 0x07 | a4_160 >> 0x19)) / 4;
		uint32 t1_159 = ((a6_123 >> 0x02 | a6_123 << 0x1E) ^ (a6_123 >> 0x0D | a6_123 << 0x13) ^ (a6_123 << 0x0A | a6_123 >> 22)) + ((a6_123 | a2_101) & a3_113 | a6_123 & a2_101) + t5_142;
		uint32 a3_198 = (word32) a3_113.u0 + t5_180;
		uint32 t5_218 = ((a3_198 >> 0x06 | a3_198 << 0x1A) ^ (a3_198 >> 11 | a3_198 << 0x15) ^ (a3_198 << 0x07 | a3_198 >> 0x19)) + (((word32) a7.u0 + (t4_71->dwFFFFFFEC + t6_70->dwFFFFFFEC)) + ((a5_121 ^ a4_160) & a3_198 ^ a5_121));
		uint32 a1_197 = ((t1_159 >> 0x02 | t1_159 << 0x1E) ^ (t1_159 >> 0x0D | t1_159 << 0x13) ^ (t1_159 << 0x0A | t1_159 >> 22)) + ((a6_123 | t1_159) & a2_101 | a6_123 & t1_159) + t5_180;
		uint32 a2_236 = a2_101 + t5_218;
		uint32 t5_256 = ((a2_236 >> 0x06 | a2_236 << 0x1A) ^ (a2_236 >> 11 | a2_236 << 0x15) ^ (a2_236 << 0x07 | a2_236 >> 0x19)) + ((a5_121 + (t4_71->dwFFFFFFF0 + t6_70->dwFFFFFFF0)) + ((a4_160 ^ a3_198) & a2_236 ^ a4_160));
		uint32 a7_235 = ((a1_197 >> 0x02 | a1_197 << 0x1E) ^ (a1_197 >> 0x0D | a1_197 << 0x13) ^ (a1_197 << 0x0A | a1_197 >> 22)) + ((t1_159 | a1_197) & a6_123 | t1_159 & a1_197) + t5_218;
		a6_274 = a6_123 + t5_256;
		word32 t5_294 = ((a6_274 >>u 0x06 | a6_274 << 0x1A) ^ (a6_274 >>u 11 | a6_274 << 0x15) ^ (a6_274 << 0x07 | a6_274 >>u 0x19)) + ((a4_160 + (Mem57[t4_71 + -0x0C:int32] + Mem57[t6_70 + -0x0C:int32])) + ((a3_198 ^ a2_236) & a6_274 ^ a3_198));
		a5_120 = ((a7_235 >> 0x02 | a7_235 << 0x1E) ^ (a7_235 >> 0x0D | a7_235 << 0x13) ^ (a7_235 << 0x0A | a7_235 >> 22)) + ((a1_197 | a7_235) & t1_159 | a1_197 & a7_235) + t5_256;
		t1 = t1_159 + t5_294;
		uint32 t5_332 = ((t1 >> 0x06 | t1 << 0x1A) ^ (t1 >> 11 | t1 << 0x15) ^ (t1 << 0x07 | t1 >> 0x19)) + ((a3_198 + (t4_71->dwFFFFFFF8 + t6_70->dwFFFFFFF8)) + ((a2_236 ^ a6_274) & t1 ^ a2_236));
		a4_116 = ((a5_120 >> 0x02 | a5_120 << 0x1E) ^ (a5_120 >> 0x0D | a5_120 << 0x13) ^ (a5_120 << 0x0A | a5_120 >> 22)) + ((a7_235 | a5_120) & a1_197 | a7_235 & a5_120) + t5_294;
		a1_350 = a1_197 + t5_332;
		uint32 t5_370 = ((a1_350 >> 0x06 | a1_350 << 0x1A) ^ (a1_350 >> 11 | a1_350 << 0x15) ^ (a1_350 << 0x07 | a1_350 >> 0x19)) + ((a2_236 + (t4_71->dwFFFFFFFC + t6_70->dwFFFFFFFC)) + ((a6_274 ^ t1) & a1_350 ^ a6_274));
		a3_113 = ((a4_116 >> 0x02 | a4_116 << 0x1E) ^ (a4_116 >> 0x0D | a4_116 << 0x13) ^ (a4_116 << 0x0A | a4_116 >> 22)) + ((a5_120 | a4_116) & a7_235 | a5_120 & a4_116) + t5_332;
		a7 = a7_235 + t5_370;
		a2_101 = ((a3_113 >> 0x02 | a3_113 << 0x1E) ^ (a3_113 >> 0x0D | a3_113 << 0x13) ^ (a3_113 << 0x0A | a3_113 >> 22)) + ((a4_116 | a3_113) & a5_120 | a4_116 & a3_113) + t5_370;
	} while (t4_71 != &g_t23087784);
	do
	{
		Eq_248465 s5_403 = t3_401->dw0038;
		Eq_248469 t5_404 = t3_401->dw0004;
		uint32 t4_429 = ((s5_403 << 0x0F | s5_403 >> 0x11) ^ (s5_403 << 0x0D | s5_403 >> 0x13) ^ s5_403 >> 0x0A) + (t3_401->dw0024 + t3_401->dw0000) + (((t5_404 >> 0x07 | t5_404 << 0x19) ^ (t5_404 << 0x0E | t5_404 >> 0x12)) ^ t5_404 >> 0x03);
		uint32 a6_456 = a6_274 + ((((((a7 >> 0x06 | a7 << 0x1A) ^ (a7 >> 11 | a7 << 0x15)) ^ (a7 << 0x07 | a7 >> 0x19)) + ((t1 ^ a1_350) & a7 ^ t1)) + s1_448->dw0040) + t4_429);
		Eq_248539 s6_405 = t3_401->dw003C;
		Eq_248543 t6_486 = t3_401->dw0008;
		uint32 a5_484 = a5_120 + a6_456;
		word32 s0_498 = ((s6_405 << 0x0F | s6_405 >>u 0x11) ^ (s6_405 << 0x0D | s6_405 >>u 0x13) ^ s6_405 >>u 0x0A) + (t5_404 + Mem402[t3_401 + 40:int32]) + (((t6_486 >>u 0x07 | t6_486 << 0x19) ^ (t6_486 << 0x0E | t6_486 >>u 0x12)) ^ t6_486 >>u 0x03);
		Eq_248584 t5_517 = ((a7 ^ a1_350) & a5_484 ^ a1_350) + ((t1 + s1_448->dw0044) + s0_498) + (((a5_484 >> 0x06 | a5_484 << 0x1A) ^ (a5_484 >> 11 | a5_484 << 0x15)) ^ (a5_484 << 0x07 | a5_484 >> 0x19));
		Eq_248612 s7_452 = t3_401->dw000C;
		uint32 a6_485 = a6_456 + ((((a2_101 >> 0x02 | a2_101 << 0x1E) ^ (a2_101 >> 0x0D | a2_101 << 0x13)) ^ (a2_101 << 0x0A | a2_101 >> 22)) + ((a2_101 | a3_113) & a4_116 | a2_101 & a3_113));
		word32 a4_535 = a4_116 + t5_517;
		word32 t2_558 = ((t4_429 << 0x0F | t4_429 >>u 0x11) ^ (t4_429 << 0x0D | t4_429 >>u 0x13) ^ t4_429 >>u 0x0A) + (t6_486 + Mem402[t3_401 + 44:int32]) + (((s7_452 >>u 0x07 | s7_452 << 0x19) ^ (s7_452 << 0x0E | s7_452 >>u 0x12)) ^ s7_452 >>u 0x03);
		word32 t5_577 = ((a7 ^ a5_484) & a4_535 ^ a7) + ((a1_350 + Mem402[s1_448 + 72:int32]) + t2_558) + (((a4_535 >>u 0x06 | a4_535 << 0x1A) ^ (a4_535 >>u 11 | a4_535 << 0x15)) ^ (a4_535 << 0x07 | a4_535 >>u 0x19));
		t3_401->dw0044 = s0_498;
		Eq_248708 t5_606 = t3_401->dw0010;
		uint32 t1_534 = (word32) t5_517 + ((((a6_485 >> 0x02 | a6_485 << 0x1E) ^ (a6_485 >> 0x0D | a6_485 << 0x13)) ^ (a6_485 << 0x0A | a6_485 >> 22)) + ((a2_101 | a6_485) & a3_113 | a2_101 & a6_485));
		uint32 a3_605 = (word32) a3_113.u0 + t5_577;
		word32 t0_619 = ((s0_498 << 0x0F | s0_498 >>u 0x11) ^ (s0_498 << 0x0D | s0_498 >>u 0x13) ^ s0_498 >>u 0x0A) + (s7_452 + Mem600[t3_401 + 48:int32]) + (((t5_606 >>u 0x07 | t5_606 << 0x19) ^ (t5_606 << 0x0E | t5_606 >>u 0x12)) ^ t5_606 >>u 0x03);
		struct Eq_248773 * s1_618 = (t5_606 >> 0x03)->ptr004C;
		t3_401->dw0048 = (word32) t2_558;
		Eq_248781 s7_667 = t3_401->dw0014;
		uint32 t6_637 = ((a5_484 ^ a4_535) & a3_605 ^ a5_484) + (((word32) a7.u0 + (t5_606 >> 0x03)) + t0_619) + (((a3_605 >> 0x06 | a3_605 << 0x1A) ^ (a3_605 >> 11 | a3_605 << 0x15)) ^ (a3_605 << 0x07 | a3_605 >> 0x19));
		uint32 a1_604 = ((t1_534 >> 0x02 | t1_534 << 0x1E) ^ (t1_534 >> 0x0D | t1_534 << 0x13) ^ (t1_534 << 0x0A | t1_534 >> 22)) + ((a6_485 | t1_534) & a2_101 | a6_485 & t1_534) + t5_577;
		word32 t6_681 = ((t2_558 << 0x0F | t2_558 >>u 0x11) ^ (t2_558 << 0x0D | t2_558 >>u 0x13) ^ t2_558 >>u 0x0A) + (t5_606 + Mem663[t3_401 + 52:int32]) + (((s7_667 >>u 0x07 | s7_667 << 0x19) ^ (s7_667 << 0x0E | s7_667 >>u 0x12)) ^ s7_667 >>u 0x03);
		uint32 a2_655 = a2_101 + t6_637;
		uint32 t5_699 = ((a2_655 >> 0x06 | a2_655 << 0x1A) ^ (a2_655 >> 11 | a2_655 << 0x15) ^ (a2_655 << 0x07 | a2_655 >> 0x19)) + (((a4_535 ^ a3_605) & a2_655 ^ a4_535) + (a5_484 + (s1_618->dw0050 + t6_681)));
		Eq_248900 s0_720 = t3_401->dw0018;
		t3_401->dw004C = t0_619;
		uint32 a7_654 = ((a1_604 >> 0x02 | a1_604 << 0x1E) ^ (a1_604 >> 0x0D | a1_604 << 0x13) ^ (a1_604 << 0x0A | a1_604 >> 22)) + ((t1_534 | a1_604) & a6_485 | t1_534 & a1_604) + t6_637;
		word32 t5_740 = ((t0_619 << 0x0F | t0_619 >>u 0x11) ^ (t0_619 << 0x0D | t0_619 >>u 0x13) ^ t0_619 >>u 0x0A) + (s5_403 + s7_667) + (((s0_720 >>u 0x07 | s0_720 << 0x19) ^ (s0_720 << 0x0E | s0_720 >>u 0x12)) ^ s0_720 >>u 0x03);
		a6_274 = a6_485 + t5_699;
		word32 t0_758 = ((a6_274 >>u 0x06 | a6_274 << 0x1A) ^ (a6_274 >>u 11 | a6_274 << 0x15) ^ (a6_274 << 0x07 | a6_274 >>u 0x19)) + (((a3_605 ^ a2_655) & a6_274 ^ a3_605) + (a4_535 + (Mem724[s1_618 + 84:int32] + t5_740)));
		Eq_248992 t0_783 = t3_401->dw001C;
		t3_401->dw0050 = t6_681;
		a5_120 = ((a7_654 >> 0x02 | a7_654 << 0x1E) ^ (a7_654 >> 0x0D | a7_654 << 0x13) ^ (a7_654 << 0x0A | a7_654 >> 22)) + ((a1_604 | a7_654) & t1_534 | a1_604 & a7_654) + t5_699;
		word32 s6_800 = s6_405 + s0_720 + (((t6_681 << 0x0F | t6_681 >>u 0x11) ^ (t6_681 << 0x0D | t6_681 >>u 0x13)) ^ t6_681 >>u 0x0A) + (((t0_783 >>u 0x07 | t0_783 << 0x19) ^ (t0_783 << 0x0E | t0_783 >>u 0x12)) ^ t0_783 >>u 0x03);
		t1 = t1_534 + t0_758;
		uint32 t6_818 = ((t1 >> 0x06 | t1 << 0x1A) ^ (t1 >> 11 | t1 << 0x15) ^ (t1 << 0x07 | t1 >> 0x19)) + (((a2_655 ^ a6_274) & t1 ^ a2_655) + (a3_605 + ((word32) s6_800 + s1_618->dw0058)));
		Eq_249083 t2_842 = t3_401[1];
		t3_401->dw0054 = (word32) t5_740;
		t3_401[2] = (struct Eq_248000) t4_429;
		uint32 t4_861 = (word32) t0_783 + t4_429 + (((t5_740 << 0x0F | t5_740 >> 0x11) ^ (t5_740 << 0x0D | t5_740 >> 0x13)) ^ t5_740 >> 0x0A) + (((t2_842 >> 0x07 | t2_842 << 0x19) ^ (t2_842 << 0x0E | t2_842 >> 0x12)) ^ t2_842 >> 0x03);
		a1_350 = a1_604 + t6_818;
		uint32 a2_867 = a2_655 + (s1_618->dw005C + t4_861) + ((a6_274 ^ t1) & a1_350 ^ a6_274);
		t3_401->dw005C = t4_861;
		a4_116 = ((a5_120 >> 0x02 | a5_120 << 0x1E) ^ (a5_120 >> 0x0D | a5_120 << 0x13) ^ (a5_120 << 0x0A | a5_120 >> 22)) + ((a7_654 | a5_120) & a1_604 | a7_654 & a5_120) + t0_758;
		t3_401->dw0058 = (word32) s6_800;
		uint32 t4_880 = ((a1_350 >> 0x06 | a1_350 << 0x1A) ^ (a1_350 >> 11 | a1_350 << 0x15) ^ (a1_350 << 0x07 | a1_350 >> 0x19)) + a2_867;
		a3_113 = ((a4_116 >> 0x02 | a4_116 << 0x1E) ^ (a4_116 >> 0x0D | a4_116 << 0x13) ^ (a4_116 << 0x0A | a4_116 >> 22)) + ((a5_120 | a4_116) & a7_654 | a5_120 & a4_116) + t6_818;
		++t3_401;
		a7 = a7_654 + t4_880;
		a2_101 = ((a3_113 >> 0x02 | a3_113 << 0x1E) ^ (a3_113 >> 0x0D | a3_113 << 0x13) ^ (a3_113 << 0x0A | a3_113 >> 22)) + ((a4_116 | a3_113) & a5_120 | a4_116 & a3_113) + t4_880;
		s1_448 = (struct Eq_248006 *) ((char *) s1_618 + 32);
	} while (dwLoc0148 + 6 != t3_401);
	do
	{
		++s2_9;
		s2_9[0x03FF] = (struct Eq_247932) (s2_9->dw0000 + *s3_10);
		++s3_10;
	} while (a0 + 40 != s2_9);
	a3Out = a3_113;
	a7Out = a7;
	return t1;
}

// 2304B4C2: Register uint32 utils_sha256_update.part.0(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_135580 a7, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_249265 a5Out, Register out Eq_135580 a7Out)
// Called from:
//      utils_sha256_update
//      utils_sha256_finish
uint32 utils_sha256_update.part.0(uint32 t1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_135580 a7, Eq_2 dwArg48, Eq_2 dwArgA8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_249265 & a5Out, union Eq_135580 & a7Out)
{
	word32 a0_21 = *a5;
	word32 a5_27 = a5 + a2;
	*a5_27 = a0_21;
	Eq_2 s2_24 = a1;
	ui32 s3_139 = a5 & 63;
	Eq_2 s0_29 = a2;
	if (a5_27 < a2)
		*((word32) a5_27 + 5) = *((word32) a5_27 + 4);
	if ((a5 & 63) != 0x00)
	{
		Eq_2 s4_35 = 64 - (a5 & 63);
		if (a2 >= s4_35)
		{
			s0_29 = (word32) (a5 & 63) + ((word32) a2 - 64);
			word32 a6_265;
			Eq_135580 a7_45;
			Eq_2 a3_48;
			word32 a4_263;
			word32 a5_264;
			word32 a2_262;
			word32 a1_261;
			t1 = utils_sha256_process(memcpy(a0_21 + 40 + (a5 & 63), a1, s4_35, out a1_261, out a2_262, out a3_48, out a4_263, out a5_264, out a6_265, out a7_45), a0_21, a0_21 + 40, a3_48, a7_45, out a3, out a7);
			s2_24 = a1 + s4_35;
			s3_139 = 0x00;
		}
	}
	Eq_2 s4_108 = s0_29;
	word32 s6_81 = s2_24 + s0_29;
	while (true)
	{
		struct Eq_247927 * a1_85 = s6_81 - s4_108;
		if (s4_108 <= 63)
			break;
		t1 = utils_sha256_process(t1, a0_21, a1_85, a3, a7, out a3, out a7);
		s4_108 = (word32) s4_108 - 64;
	}
	uint32 a2_110 = s0_29 >> 0x06;
	Eq_2 a1_115 = (word32) s2_24 + (a2_110 << 0x06);
	if ((word32) s0_29 + (a2_110 + -64) == 0x00)
	{
		0x00 = (uint16) dwArgA8;
		s0Out.u0 = <invalid>;
		s1Out.u0 = <invalid>;
		a3Out = a3;
		a5Out.u0 = -64;
		a7Out = a7;
		return t1;
	}
	else
	{
		0x00 = (uint16) dwArgA8;
		Eq_2 a0_140 = a0_21 + 40 + s3_139;
		word32 a1_266;
		Eq_249265 a5_144;
		Eq_135580 a7_145;
		Eq_2 a3_148;
		word32 a2_267;
		word32 a4_268;
		word32 a6_269;
		uint32 t1_151 = memcpy(a0_140, a1_115, dwArg48, out a1_266, out a2_267, out a3_148, out a4_268, out a5_144, out a6_269, out a7_145);
		s0Out.u0 = <invalid>;
		s1Out.u0 = <invalid>;
		a3Out = a3_148;
		a5Out = a5_144;
		a7Out = a7_145;
		return t1_151;
	}
}

// 2304B584: Register uint32 utils_sha256_update(Register uint32 t1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register Eq_135580 a7, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out Eq_135580 a7Out)
// Called from:
//      ota_tcp_cmd
//      utils_sha256_finish
uint32 utils_sha256_update(uint32 t1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, Eq_135580 a7, Eq_2 dwArg48, Eq_2 dwArgA8, union Eq_2 & a3Out, union Eq_2 & a5Out, union Eq_135580 & a7Out)
{
	if (a2 == 0x00)
	{
		a3Out = a3;
		a5Out = a5;
		a7Out = a7;
		return t1;
	}
	else
	{
		Eq_2 a3_13;
		Eq_2 a5_15;
		Eq_135580 a7_17;
		word32 s0_82;
		word32 s1_83;
		uint32 t1_27 = utils_sha256_update.part.0(t1, a1, a2, a3, a5, a7, dwArg48, dwArgA8, out s0_82, out s1_83, out a3_13, out a5_15, out a7_17);
		a3Out = a3_13;
		a5Out = a5_15;
		a7Out = a7_17;
		return t1_27;
	}
}

