pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304B58C: void utils_sha256_finish(Register uint32 t1, Register Eq_2 a2, Register Eq_2 a5, Register Eq_135580 a7, Stack Eq_2 dwArg28, Stack Eq_2 dwArg88)
// Called from:
//      ota_tcp_cmd
void utils_sha256_finish(uint32 t1, Eq_2 a2, Eq_2 a5, Eq_135580 a7, Eq_2 dwArg28, Eq_2 dwArg88)
{
	Eq_2 a5_43;
	ui32 a5_17 = a5 << 3 | a2 >> 0x1D;
	if ((a2 & 63) <= 55)
		a5_43.u0 = 56;
	else
		a5_43.u0 = 0x0078;
	Eq_2 a3_62;
	Eq_2 a5_64;
	Eq_135580 a7_66;
	struct Eq_249439 * s0_94;
	struct Eq_249412 * s1_95;
	word32 a7_234;
	word32 a5_233;
	word32 a3_232;
	utils_sha256_update.part.0(utils_sha256_update(t1, 587757636, a5_43 - (a2 & 63), a5_17 << 0x08, a5_43, a7, dwArg28, dwArg88, out a3_62, out a5_64, out a7_66), fp + ~0x17, 0x08, a3_62, a5_64, a7_66, dwArg28, dwArg88, out s0_94, out s1_95, out a3_232, out a5_233, out a7_234);
	s1_95->b0000 = (byte) (word32) s0_94->b000B;
	uint32 a5_112 = (word32) s0_94->w000A;
	s1_95->b0001 = (byte) a5_112;
	s1_95->b0002 = (byte) (a5_112 >> 8);
	struct Eq_249487 * s0_117 = (a5_112 >> 8)->ptr0008;
	s1_95->b0003 = (byte) (a5_112 >> 8);
	s1_95->b0004 = (byte) (word32) s0_117->b000F;
	uint32 a5_121 = (word32) s0_117->w000E;
	s1_95->b0005 = (byte) a5_121;
	s1_95->b0006 = (byte) (a5_121 >> 8);
	struct Eq_249520 * s0_126 = (a5_121 >> 8)->ptr000C;
	s1_95->b0007 = (byte) (a5_121 >> 8);
	s1_95->b0008 = (byte) (word32) s0_126->b0013;
	uint32 a5_130 = (word32) s0_126->w0012;
	s1_95->b0009 = (byte) a5_130;
	s1_95->b000A = (byte) (a5_130 >> 8);
	struct Eq_249553 * s0_135 = (a5_130 >> 8)->ptr0010;
	s1_95->b000B = (byte) (a5_130 >> 8);
	s1_95->b000C = (byte) (word32) s0_135->b0017;
	uint32 a5_139 = (word32) s0_135->w0016;
	s1_95->b000D = (byte) a5_139;
	s1_95->b000E = (byte) (a5_139 >> 8);
	struct Eq_249586 * s0_144 = (a5_139 >> 8)->ptr0014;
	s1_95->b000F = (byte) (a5_139 >> 8);
	s1_95->b0010 = (byte) (word32) s0_144->b001B;
	uint32 a5_148 = (word32) s0_144->w001A;
	s1_95->b0011 = (byte) a5_148;
	s1_95->b0012 = (byte) (a5_148 >> 8);
	struct Eq_249619 * s0_153 = (a5_148 >> 8)->ptr0018;
	s1_95->b0013 = (byte) (a5_148 >> 8);
	s1_95->b0014 = (byte) (word32) s0_153->b001F;
	uint32 a5_157 = (word32) s0_153->w001E;
	s1_95->b0015 = (byte) a5_157;
	s1_95->b0016 = (byte) (a5_157 >> 8);
	struct Eq_249652 * s0_162 = (a5_157 >> 8)->ptr001C;
	s1_95->b0017 = (byte) (a5_157 >> 8);
	s1_95->b0018 = (byte) (word32) s0_162->b0023;
	uint32 a5_166 = (word32) s0_162->w0022;
	s1_95->b0019 = (byte) a5_166;
	s1_95->b001A = (byte) (a5_166 >> 8);
	s1_95->b001B = (byte) (a5_166 >> 8);
	struct Eq_249406 * s0_173 = (a5_166 >> 8)->ptr0068;
	if (a5_166 >> 8 == 0x00)
	{
		s1_95->b001C = (byte) (word32) s0_173->b0027;
		uint32 a5_176 = (word32) s0_173->w0026;
		s1_95->b001D = (byte) a5_176;
		s1_95->b001E = (byte) (a5_176 >> 8);
		s1_95->b001F = (byte) (a5_176 >> 8);
	}
}

// 2304B718: Register Eq_2 bl_printk(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out Eq_1382 s1Out, Register out (ptr32 Eq_274) a0Out, Register out (ptr32 Eq_1384) a1Out, Register out Eq_1385 a2Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_1387) a4Out, Register out (ptr32 Eq_1388) a5Out, Register out Eq_1389 s2Out, Register out Eq_1390 s3Out, Register out (ptr32 Eq_1391) s4Out, Register out Eq_1392 s5Out, Register out (ptr32 Eq_1393) s6Out, Register out Eq_1394 s7Out, Register out (ptr32 Eq_1395) s8Out, Register out (ptr32 Eq_1396) s9Out, Register out (ptr32 Eq_1397) s10Out, Register out (ptr32 Eq_1398) s11Out)
// Called from:
//      get_dts_addr.part.2
//      bl_main_cfg_task_req
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      cmd_blog_info_dump
//      cmd_blog_set_level
//      blog_init
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      _cb_cmd
//      bl_cks_test
//      _cb_cmd
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      bl_dma_test
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      bl_sec_test
//      _dump_rsa_data
//      _pka_test_case2
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      Aes_Compare_Data
//      _dump_iv_status
//      bl_sec_aes_IRQHandler
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      bl_sec_aes_test
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      sha256_test_case0
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      _dump_partition
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      log_buf_out
//      bl_mtd_write
//      bloop_run
Eq_2 bl_printk(Eq_2 ra, struct Eq_274 * a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, union Eq_1382 & s1Out, struct Eq_274 & a0Out, struct Eq_1384 & a1Out, union Eq_1385 & a2Out, union Eq_2 & a3Out, struct Eq_1387 & a4Out, struct Eq_1388 & a5Out, union Eq_1389 & s2Out, union Eq_1390 & s3Out, struct Eq_1391 & s4Out, union Eq_1392 & s5Out, struct Eq_1393 & s6Out, union Eq_1394 & s7Out, struct Eq_1395 & s8Out, struct Eq_1396 & s9Out, struct Eq_1397 & s10Out, struct Eq_1398 & s11Out)
{
	ui32 a5_7 = (word32) g_b4200D94A;
	struct Eq_1388 * a5_22 = a5_7 & 0x00FF;
	if ((a5_7 & 0x00FF) != 0x00)
	{
		word32 a7_120;
		word32 t4_121;
		ra = vprint(ra, a0, fp + -28, dwArg08, dwArg28, a3, dwArg70, dwArg74, dwArg98, dwArgBC, out s1, out a0, out a1, out a2, out a3, out a4, out a5_22, out a7_120, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_121);
	}
	s1Out = s1;
	a0Out = a0;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_22;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 2304B746: Register Eq_2 log_buf_out(Register Eq_2 ra, Register Eq_2 a2, Register Eq_131453 a3, Register Eq_131454 a4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack word32 dwArg010C, Register out (ptr32 Eq_131465) s0Out, Register out ptr32 s1Out, Register out Eq_131453 a3Out, Register out Eq_131454 a4Out, Register out Eq_131469 a5Out, Register out Eq_131453 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_131475) s7Out, Register out ptr32 s8Out, Register out Eq_131477 s9Out)
// Called from:
//      tc_fdt_wifi_module
//      hal_board_cfg
//      file_info
//      romfs_register
Eq_2 log_buf_out(Eq_2 ra, Eq_2 a2, Eq_131453 a3, Eq_131454 a4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, word32 dwArg010C, struct Eq_131465 & s0Out, ptr32 & s1Out, union Eq_131453 & a3Out, union Eq_131454 & a4Out, union Eq_131469 & a5Out, union Eq_131453 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, struct Eq_131475 & s7Out, ptr32 & s8Out, union Eq_131477 & s9Out)
{
	if (a3 <= 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		return ra;
	}
	else
	{
		Eq_131453 s2_200;
		Eq_2 s6_204;
		Eq_131477 s9_118;
		ptr32 s3_110;
		struct Eq_131475 * s7_205;
		Eq_131469 a5_210 = 50;
		Eq_131454 s1_10 = a4;
		Eq_131454 a4_11 = a3 | 50;
		Eq_2 s0_221 = a2;
		Eq_2 s5_203 = a1;
		Eq_2 s8_206 = a3 ^ 50;
		if ((a3 | 50) == 0x00)
		{
			s3_110 = 0x42015000;
			s7_205 = &g_t23088000;
			s9_118.u0 = 0x23088000;
			Eq_2 s8_219 = (word32) a2 + ((a3 ^ 50) + 50);
			s6_204 = s6;
			s2_200 = s2;
			while (s8_219 != s0_221)
			{
				word32 s6_240 = 0x00;
				Eq_131454 s10_242 = 0x01;
				Eq_131454 s11_243 = 0x02;
				do
				{
					struct Eq_274 * a1_258;
					Eq_2 a0_250 = s6_240 + 0x42015290;
					if (s1_10 != s10_242)
					{
						a1_258 = (word32) s9_118.u0 - 0x0774;
						if (s1_10 != s11_243)
							a1_258 = (struct Eq_274 *) &g_t23087894;
					}
					else
						a1_258 = (struct Eq_274 *) ((char *) s7_205 - 0x077C);
					word32 a0_271;
					word32 s0_279;
					word32 s2_283;
					Eq_2 s4_285;
					word32 s6_287;
					word32 s5_771;
					word32 a5_769;
					word32 s3_770;
					ra = sprintf(ra, a0_250, a1_258, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_279, out s1_10, out a0_271, out a5_769, out s2_283, out s3_770, out s4_285, out s5_771, out s6_287, out s7_205, out s9_118, out s10_242, out s11_243);
					s6_240 = s6_287 + a0_271;
				} while (s2_283 != ~0x30);
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_773;
					xTaskGetTickCountFromISR(out a5_773);
				}
				else
				{
					word32 a5_772;
					xTaskGetTickCount(out a5_772);
				}
				word32 a3_777;
				word32 a2_776;
				word32 s4_778;
				word32 s10_779;
				word32 s11_780;
				word32 a0_774;
				word32 a1_775;
				ra = bl_printk(ra, &g_t230878AC, s4_285, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_10, out a0_774, out a1_775, out a2_776, out a3_777, out a4_11, out a5_210, out s2_200, out s3_110, out s4_778, out s5_203, out s6_204, out s7_205, out s8_219, out s9_118, out s10_779, out s11_780);
				s0_221 = s0_279 + 50;
			}
		}
		else
		{
			Eq_2 s6_214 = 0x00;
			s3_110 = 0x42015290;
			s9_118.u0 = 0x23088000;
			word32 s10_123 = 0x23088000;
			word32 s11_121 = 0x23088000;
			while (true)
			{
				Eq_2 s4_146;
				word32 s2_105 = 0x00;
				if (s8_206 == s6_214)
				{
					do
					{
						struct Eq_274 * a1_119;
						Eq_2 a0_112 = s3_110 + s2_105;
						if (s1_10 != 0x01)
						{
							a1_119 = s11_121 + -0x0774;
							if (s1_10 != 0x02)
								a1_119 = s10_123 + -1900;
						}
						else
							a1_119 = (word32) s9_118.u0 - 0x077C;
						word32 a0_132;
						word32 a5_137;
						word32 s2_144;
						word32 s7_149;
						word32 s5_782;
						word32 s0_781;
						word32 s6_783;
						ra = sprintf(ra, a0_112, a1_119, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_781, out s1_10, out a0_132, out a5_137, out s2_144, out s3_110, out s4_146, out s5_782, out s6_783, out s7_149, out s9_118, out s10_123, out s11_121);
						s2_105 = s2_144 + a0_132;
					} while (a5_137 != s7_149 + 0x01);
				}
				else
				{
					do
					{
						struct Eq_274 * a1_67;
						Eq_2 a0_60 = s3_110 + s2_105;
						if (s1_10 != 0x01)
						{
							a1_67 = s11_121 + -0x0774;
							if (s1_10 != 0x02)
								a1_67 = s10_123 + -1900;
						}
						else
							a1_67 = (word32) s9_118.u0 - 0x077C;
						word32 a0_80;
						word32 s2_92;
						word32 s7_97;
						word32 s6_787;
						word32 s5_786;
						word32 s0_784;
						word32 a5_785;
						ra = sprintf(ra, a0_60, a1_67, s6, dwLoc18, dwArg14, dwArg30, a3 | 50, dwArg58, dwArg7C, out s0_784, out s1_10, out a0_80, out a5_785, out s2_92, out s3_110, out s4_146, out s5_786, out s6_787, out s7_97, out s9_118, out s10_123, out s11_121);
						s2_105 = s2_92 + a0_80;
					} while (s7_97 != ~0x30);
				}
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_789;
					xTaskGetTickCountFromISR(out a5_789);
				}
				else
				{
					word32 a5_788;
					xTaskGetTickCount(out a5_788);
				}
				word32 s4_795;
				word32 a5_794;
				word32 a3_793;
				word32 a2_792;
				word32 a1_791;
				word32 a0_790;
				ra = bl_printk(ra, &g_t230878AC, s4_146, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_10, out a0_790, out a1_791, out a2_792, out a3_793, out a4_11, out a5_794, out s2_200, out s3_110, out s4_795, out s5_203, out s6_204, out s7_205, out s8_206, out s9_118, out s10_123, out s11_121);
				a5_210 = (word32) s6_204 + 1;
				if (s6_204 >= s8_206)
					break;
				s6_214 = (word32) s6_204 + 1;
			}
		}
		0x00 = dwArg010C;
		s0Out = dwArgCC;
		s1Out = dwLoc4C;
		a3Out = s2;
		a4Out = a4_11;
		a5Out = a5_210;
		s2Out = s2_200;
		s3Out = s3_110;
		s4Out = dwArg0168;
		s5Out = s5_203;
		s6Out = s6_204;
		s7Out = s7_205;
		s8Out = dwArg0148;
		s9Out = s9_118;
		return dwLoc08;
	}
}

// 2304B90E: Register Eq_2 utils_dns_domain_get(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 int32) a2, Register out ptr32 a4Out, Register out (ptr32 Eq_142580) a5Out)
// Called from:
//      get_dns_request
Eq_2 utils_dns_domain_get(Eq_2 a0, Eq_2 a1, int32 * a2, ptr32 & a4Out, struct Eq_142580 & a5Out)
{
	int32 a7_12 = *a2;
	ptr32 a4_11 = (word32) *a0;
	struct Eq_142580 * a5_19 = null;
	int32 t1_14 = 0x01;
	while (a4_11 != 0x00 && a7_12 > 0x00)
	{
		Mem22[a1 + a5_19:byte] = SLICE(CONVERT(Mem16[a0 + t1_14:byte], byte, word32), byte, 0);
		a4_11 += ~0x00;
		int32 a3_23 = t1_14 + 1;
		struct Eq_142580 * a6_24 = (char *) &a5_19->t0000 + 1;
		a7_12 += ~0x00;
		if (a4_11 == 0x00 && a7_12 != 0x00)
		{
			Mem28[a6_24 + a1:byte] = 0x2E;
			a4_11 = (word32) *((word32) a0 + a3_23);
			a6_24 = a5_19 + 1;
			a3_23 = t1_14 + 2;
		}
		a5_19 = a6_24;
		t1_14 = a3_23;
	}
	a5_19->t0000 = a2;
	a4Out = a4_11;
	a5Out = a5_19;
	return 0x00;
}

// 2304B966: void utils_list_init(Register (ptr32 Eq_99482) a0)
// Called from:
//      ipc_host_init
//      bl_dma_init
//      ping_api_init
//      bloop_init
void utils_list_init(struct Eq_99482 * a0)
{
	a0->dw0000 = 0x00;
	a0->dw0004 = 0x00;
}

// 2304B970: Register (ptr32 Eq_109009) utils_list_push_back(Register Eq_2 a1, Register (ptr32 Eq_109009) a5)
// Called from:
//      bl_output
//      bl_dma_copy
//      ping_timeout
struct Eq_109009 * utils_list_push_back(Eq_2 a1, struct Eq_109009 * a5)
{
	struct Eq_109009 * a0_10 = a5->ptr0000;
	if (a5 == null)
		*a1 = a0_10;
	else
	{
		a0_10 = a5->ptr0004;
		*a1 = a5;
	}
	*((word32) a1 + 4) = a0_10;
	*a1 = null;
	return a0_10;
}

// 2304B984: Register (ptr32 Eq_108479) utils_list_pop_front(Register Eq_2 a4, Register (ptr32 Eq_108479) a5, Register out (ptr32 Eq_108479) a5Out)
// Called from:
//      bl_tx_try_flush
//      bl_dma_IRQHandler
//      ping_free
//      ping_timeout
//      bloop_run
struct Eq_108479 * utils_list_pop_front(Eq_2 a4, struct Eq_108479 * a5, struct Eq_108479 & a5Out)
{
	struct Eq_108479 * a0_5 = a5->ptr0000;
	if (a5 != null)
	{
		a5 = (struct Eq_108479 *) *a4;
		*a4 = a0_5;
	}
	a5Out = a5;
	return a5;
}

// 2304B990: Register Eq_2 utils_hexdump(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s10, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out)
// Called from:
//      cmd_wifi_mib
//      hexdump_cmd
Eq_2 utils_hexdump(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s10, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArg0198, ptr32 & s0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out)
{
	Eq_2 s2_103 = a1;
	word32 s1_35 = 0x00;
	if ((a1 & 0x0F) != 0x00)
		s1_35 = 0x10 - (a1 & 0x0F);
	Eq_2 s1_100 = (word32) a1 + s1_35;
	Eq_2 s0_199 = 0x00;
	word32 s6_107 = 0x23088000;
	word32 s7_108 = 0x23088000;
	word32 s8_109 = 0x23088000;
	while (s1_100 != s0_199)
	{
		if ((s0_199 & 0x0F) == 0x00)
		{
			word32 s9_516;
			word32 a5_510;
			word32 s1_505;
			word32 a0_506;
			word32 a1_507;
			word32 a2_508;
			word32 a7_511;
			word32 a4_509;
			word32 s4_513;
			word32 s3_512;
			word32 s5_514;
			word32 s6_515;
			word32 t4_519;
			word32 s10_517;
			word32 s11_518;
			ra = printf(ra, s6_107 + -1848, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_505, out a0_506, out a1_507, out a2_508, out a3, out a4_509, out a5_510, out a7_511, out s2_103, out s3_512, out s4_513, out s5_514, out s6_515, out s7_108, out s8_109, out s9_516, out s10_517, out s11_518, out t4_519);
		}
		int32 s3_104;
		byte (* s4_105)[];
		word32 s10_101;
		word32 s9_110;
		word32 s11_102;
		if (s0_199 < s2_103)
		{
			word32 a5_530;
			word32 a7_531;
			word32 s5_532;
			word32 t4_533;
			word32 a2_529;
			word32 a0_527;
			word32 a1_528;
			ra = printf(ra, s8_109 + -1900, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_100, out a0_527, out a1_528, out a2_529, out a3, out a4, out a5_530, out a7_531, out s2_103, out s3_104, out s4_105, out s5_532, out s6_107, out s7_108, out s8_109, out s9_110, out s10_101, out s11_102, out t4_533);
		}
		else
		{
			word32 a5_523;
			word32 a1_521;
			word32 a0_520;
			word32 a2_522;
			word32 a7_524;
			word32 t4_526;
			word32 s5_525;
			ra = printf(ra, s7_108 + -0x072C, a3, s10, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_100, out a0_520, out a1_521, out a2_522, out a3, out a4, out a5_523, out a7_524, out s2_103, out s3_104, out s4_105, out s5_525, out s6_107, out s7_108, out s8_109, out s9_110, out s10_101, out s11_102, out t4_526);
		}
		Eq_2 s5_143 = (word32) s0_199 + 1;
		if (s11_102 == s9_110)
		{
			Eq_2 s11_146 = (word32) s0_199 - 0x0F;
			word32 a5_147 = 0x11;
			if (s5_143 < s11_146)
				a5_147 = 0x01;
			Eq_2 s0_152 = (word32) s0_199 - 16 + a5_147;
			while (s11_146 != s0_152)
			{
				Eq_250258 a0_155 = 32;
				if (s11_146 < s2_103)
				{
					a0_155 = CONVERT(Mem29[s4_105 + s11_146:byte], byte, word32);
					if (((word32) *((word32) a0_155 + s3_104) & 151) == 0x00)
						a0_155.u0 = 46;
				}
				s0_152 = bl_putchar(s1_100, a0_155, out s4_105);
				s11_146 = (word32) s11_146 + 1;
			}
			word32 s4_538;
			word32 a5_537;
			word32 a1_535;
			word32 a2_536;
			word32 a0_534;
			s1_100 = puts(s10_101 + 2044, out a0_534, out a1_535, out a2_536, out a4, out a5_537, out s4_538, out s8_109);
		}
		s0_199 = s5_143;
	}
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	a2Out = dwArg2C;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_103;
	return ra;
}

// 2304BA80: void utils_time_date_from_epoch(Register Eq_2 a0, Register (ptr32 Eq_136078) a1)
// Called from:
//      cmd_sys_time_now
//      cmd_sntp_date
void utils_time_date_from_epoch(Eq_2 a0, struct Eq_136078 * a1)
{
	a1->t0006.u1 = 0x00;
	a1->b0002 = (byte) (a0 & 60);
	a1->b0001 = (byte) (a0 >> 60 & 60);
	a1->b0000 = (byte) (a0 >> 0x00FFFE10 & 0x18);
	(a0 >> 0x15000180)->ptr000C = a1;
	a1->b0003 = (byte) (word32) ((a0 >> 0x15000180 & 0x07) + fp)->bFFFFFFEC;
	struct Eq_250342 * a0_51 = (a0 >> 31536000) + 0x07B2;
	a0_51->ptr0008 = a1;
	struct Eq_250342 * a4_50 = (struct Eq_250342 *) 0x07B4;
	while (a4_50 < a0_51)
	{
		if ((a4_50 | 100) != 0x00 || (a4_50 | 400) == 0x00)
			a1->t0006 = (byte) ((word32) a1->t0006 + 0x01);
		a4_50 = (struct Eq_250342 *) ((char *) a4_50 + 4);
	}
	uint32 a5_74 = (a0 >> 0x15000180) - (word32) a1->t0006;
	struct Eq_250363 * a4_77 = (a5_74 >> 365) + 0x07B2;
	a4_77->ptr0008 = a1;
	struct Eq_250371 * a5_80 = (a5_74 & 365) + 0x01;
	a5_80->ptr0010 = a1;
	if ((a4_77 & 3) == 0x00 && (a4_77 & 100) != 0x00 || (a4_77 & 400) == 0x00)
		a1->b0007 = 0x01;
	a1->b0005 = 0x00;
	struct Eq_250371 * a4_100 = null;
	while (true)
	{
		Eq_250435 a3_104 = (word32) a1->b0005;
		struct Eq_250418 * a2_107 = (word32) a3_104 + fp;
		if (a3_104 > 11 || a4_100 >= a5_80)
			break;
		word32 a2_111 = (word32) a2_107->bFFFFFFF4;
		a1->b0005 = (byte) ((word32) a3_104 + 1);
		a4_100 = (word32) (word16) (a4_100 + a2_111 / 20);
	}
	a1->b0004 = (byte) (a5_80 - (a4_100 - (word32) a2_107->bFFFFFFF3));
}

// 2304BBC0: void utils_getopt_init(Register Eq_2 a0, Register (ptr32 Eq_120324) a1)
// Called from:
//      cmd_wifi_cfg
//      ping_cmd
void utils_getopt_init(Eq_2 a0, struct Eq_120324 * a1)
{
	if (a0 == 0x00)
		return;
	*a0 = 0x00;
	*(union Eq_2 *) 0x05 = a0;
	a1->t0008 = a0;
	*((word32) a0 + 0x0C) = 0x00;
	*((word32) a0 + 16) = 0x00;
}

