pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304BBDC: Register Eq_2 utils_getopt(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_120302) a1, Register (arr (ptr32 Eq_250642)) a2, Register Eq_2 a3, Register (ptr32 Eq_120302) a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_120607) a0Out, Register out (ptr32 Eq_120302) a1Out, Register out Eq_2 a3Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_120612 s5Out, Register out Eq_120613 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      cmd_wifi_cfg
//      ping_cmd
Eq_2 utils_getopt(Eq_2 ra, ptr32 a0, struct Eq_120302 * a1, struct Eq_250642 * a2[], Eq_2 a3, struct Eq_120302 * a4, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_120607 & a0Out, struct Eq_120302 & a1Out, union Eq_2 & a3Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_120612 & s5Out, union Eq_120613 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a0 == 0x00)
	{
l2304BC30:
		a0Out = (struct Eq_120607 *) ~0x00;
		a1Out = a1;
		a3Out = a3;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	Eq_2 a0_6 = a4->t0004;
	if (a4 >= a1)
	{
l2304BD32:
		a0Out = (struct Eq_120607 *) ~0x00;
		a1Out = a1;
		a3Out = a3;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
	struct Eq_250493 ** a2_13 = a2 + (a4 << 0x02) / 4;
	struct Eq_250493 * a6_14 = *a2_13;
	if (a6_14 == null)
		goto l2304BD32;
	int32 t1_15 = (word32) a6_14->a0000[0].t0000;
	if (t1_15 != 45)
	{
		a3 = (word32) *a3;
		if (a3 == 45)
		{
			a4->t0005 = a0_6;
			a4->t0001 = a0_6;
			a0Out = (struct Eq_120607 *) 0x01;
			a1Out = a1;
			a3Out = a3;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			s9Out = s9;
			s10Out = s10;
			s11Out = s11;
			return ra;
		}
		goto l2304BD32;
	}
	int32 t3_17 = (word32) a6_14->b0001;
	struct Eq_250511 * a0_18 = (struct Eq_250511 *) ~0x00;
	if (t3_17 == 0x00)
		goto l2304BD32;
	if (t3_17 == t1_15)
	{
		a0_18 = (word32) a6_14->b0002;
		if (a0_18 == null)
		{
			a4->t0005 = a0_6;
			goto l2304BC30;
		}
	}
	Eq_2 a5_26 = a0_18->t0010;
	if (a0_18 == null)
		*(union Eq_2 *) 0x11 = a5_26;
	int32 t3_31 = *((word32) a5_26 + 16);
	struct Eq_120607 * a0_119 = (word32) *((char *) *a2_13 + t3_31);
	int32 t1_38 = (word32) (a0_119 != null) + t3_31;
	*((word32) a5_26 + 16) = t1_38;
	if ((word32) *((char *) *a2_13 + t1_38) == 0x00)
	{
		a4->t0005 = a5_26;
		*((word32) a5_26 + 16) = 0x00;
	}
	if (((word32) *a3 + -43 & 0x00FD) == 0x00)
		a3 = (word32) a3 + 1;
	int32 a4_57 = 0x00;
	while (true)
	{
		struct Eq_274 * a0_131;
		struct Eq_250627 * a4_61 = (word32) a3 + a4_57;
		int32 a2_59 = a4_57 + 1;
		struct Eq_120607 * t1_63 = (word32) a4_61->b0000;
		if (t1_63 == null)
			break;
		if (a0_119 == t1_63)
		{
			if (a0_119 == (struct Eq_120607 *) 58)
				goto l2304BC96;
			goto l2304BCB4;
		}
		a4_57 = a2_59;
	}
	if (a0_119 != null)
	{
l2304BC96:
		a0_119->t000C = a5_26;
		a3 = (word32) *a3;
		if (a3 == 58 || *((word32) a5_26 + 8) == 0x00)
			goto l2304BCA4;
		a0_131 = (struct Eq_274 *) &g_t230878D8;
		goto l2304BD2C;
	}
	else
	{
l2304BCB4:
		struct Eq_120302 * t1_71 = (word32) *((word32) a3 + a2_59);
		if (t1_71 != (struct Eq_120302 *) 58)
			goto l2304BCA8;
		*a5_26 = 0x00;
		struct Eq_120302 * a4_100 = (word32) a4_61->b0002;
		if (a4_100 != t1_71 || true)
		{
			Eq_2 a5_83 = a4_100->t0004;
			*((word32) a5_83 + 4) = &a4_100->t0001;
			struct Eq_250642 * a4_95 = a2[a4_100];
			*((word32) a5_83 + 16) = 0x00;
			a4_95->t003A = a5_83;
			a4_100 = (struct Eq_120302 *) &a4_95->t003A;
		}
		Eq_2 a5_102 = a4_100->t0004;
		if (a1 < a4_100)
		{
			a0_119->t000C = a5_102;
			a3 = (word32) *a3;
			a0_119 = (struct Eq_120607 *) 58;
			if (a3 != 58)
			{
				if (*((word32) a5_102 + 8) == 0x00)
					goto l2304BCA4;
				a0_131 = (struct Eq_274 *) &g_t230878F8;
l2304BD2C:
				word32 s2_572;
				word32 t4_573;
				word32 a2_568;
				word32 a4_569;
				word32 a5_570;
				word32 a7_571;
				word32 a0_567;
				word32 s1_566;
				ra = printf(ra, a0_131, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_566, out a0_567, out a1, out a2_568, out a3, out a4_569, out a5_570, out a7_571, out s2_572, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_573);
l2304BCA4:
				a0_119 = (struct Eq_120607 *) 63;
				goto l2304BCA8;
			}
		}
l2304BCA8:
		a0Out = a0_119;
		a1Out = a1;
		a3Out = a3;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		return ra;
	}
}

// 2304BD34: Register Eq_2 Bl_F_fast.constprop.0(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      utils_wifi_psk_cal_fast_bin
Eq_2 Bl_F_fast.constprop.0(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0198, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a3_36;
	word32 a5_325;
	word32 a2_323;
	word32 a4_324;
	word32 a1_322;
	strlen(a2, out a1_322, out a2_323, out a3_36, out a4_324, out a5_325);
	word32 a5_50;
	Eq_2 a2_53;
	Eq_2 a3_54;
	word32 a7_329;
	word32 a4_327;
	word32 a6_328;
	word32 a1_326;
	memcpy(a0, a3_36, a4, out a1_326, out a2_53, out a3_54, out a4_327, out a5_50, out a6_328, out a7_329);
	word32 a4_63 = a0 + dwArgA4;
	a4_63->u1 = 0x00;
	*((word32) a4_63 + 3) = (byte) a5_50;
	((word32) a4_63 + 1)->u1 = 0x00;
	((word32) a4_63 + 2)->u1 = 0x00;
	Eq_2 s1_77;
	Eq_2 s2_78;
	Eq_2 s3_79;
	Eq_2 s4_80;
	Eq_2 s5_88;
	Eq_2 ra_85 = bl_sha_mutex_take(ra, a2_53, a3_54, a4_63, mstatus, s4, s2, dwArg20, dwArg24, dwArg48, s3, dwArg6C, dwArgC8, dwArg0108, out s1_77, out s2_78, out s3_79, out s4_80, out s5_88);
	utils_hmac_sha1_fast(ra_85, 0x01, s3_79, s4_80, s2_78);
	word32 a6_335;
	word32 a7_336;
	word32 a4_333;
	word32 a5_334;
	word32 a2_331;
	word32 a3_332;
	word32 a1_330;
	memcpy(s5_88, s2_78, 0x14, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334, out a6_335, out a7_336);
	word32 s0_137;
	for (s0_137 = 0x00FFFFFF; s0_137 != 0x00; s0_137 += ~0x00)
	{
		utils_hmac_sha1_fast(ra_85, 0x01, s3_79, s4_80, s1_77);
		word32 a7_343;
		word32 a5_341;
		word32 a6_342;
		word32 a3_339;
		word32 a4_340;
		word32 a1_337;
		word32 a2_338;
		memcpy(s2_78, s1_77, 0x14, out a1_337, out a2_338, out a3_339, out a4_340, out a5_341, out a6_342, out a7_343);
		int32 a5_190;
		for (a5_190 = 0x00; a5_190 != 0x14; ++a5_190)
		{
			byte * a3_193 = (word32) s5_88 + a5_190;
			Eq_2 a4_200 = (word32) *((word32) s1_77 + a5_190) ^ (word32) (*a3_193);
			*a3_193 = (byte) a4_200;
		}
	}
	ptr32 s1_219;
	ptr32 s2_220;
	ptr32 s3_221;
	Eq_2 ra_233 = bl_sha_mutex_give(ra_85, a4_200, mstatus, s4, s2, dwArg20, dwArg24, dwArg48, s3, dwArg6C, dwArgC8, dwArg0108, dwArg0148, out s1_219, out s2_220, out s3_221);
	0x00 = (uint16) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_219;
	s2Out = s2_220;
	s3Out = s3_221;
	s4Out = dwArgF4;
	return ra_233;
}

// 2304BE02: void utils_wifi_psk_cal_fast_bin(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0138)
// Called from:
//      pmkCacheGeneratePSK
void utils_wifi_psk_cal_fast_bin(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0138)
{
	word32 a1_184;
	word32 a2_185;
	word32 a3_186;
	word32 a4_187;
	word32 a5_188;
	if (strlen(a0, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188) <= 63 && a2 <= 32)
	{
		Eq_2 s0_50;
		Eq_2 s1_51;
		Eq_2 s2_54;
		Eq_2 s3_55;
		Eq_2 s4_56;
		Eq_2 ra_49 = Bl_F_fast.constprop.0(ra, fp + -0x0044, a0, a2, a0, a1, s4, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, s3, dwArg68, dwArgA8, dwArgE8, dwArg0138, out s0_50, out s1_51, out s2_54, out s3_55, out s4_56);
		word32 a1_189;
		word32 a2_190;
		word32 a3_191;
		word32 a4_192;
		word32 a5_193;
		word32 a6_194;
		word32 a7_195;
		memcpy((word32) s0_50 + 20, s0_50, 0x0C, out a1_189, out a2_190, out a3_191, out a4_192, out a5_193, out a6_194, out a7_195);
		word32 s0_196;
		word32 s1_197;
		word32 s2_198;
		word32 s3_199;
		word32 s4_200;
		Bl_F_fast.constprop.0(ra_49, fp + -0x0044, s2_54, s1_51, s2_54, s3_55, s4_56, mstatus, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, s3, dwArg68, dwArgA8, dwArgE8, dwArg0138, out s0_196, out s1_197, out s2_198, out s3_199, out s4_200);
	}
}

// 2304BE70: Register word32 utils_memp_init(Register Eq_2 ra, Register word32 a1, Register word32 a2, Register word32 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack (ptr32 Eq_243659) dwArg34, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out (ptr32 Eq_243772) a3Out, Register out (ptr32 Eq_243659) a4Out)
// Called from:
//      ping_api_init
word32 utils_memp_init(Eq_2 ra, word32 a1, word32 a2, word32 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, struct Eq_243659 * dwArg34, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a0Out, struct Eq_243772 & a3Out, struct Eq_243659 & a4Out)
{
	ptr32 a0_118;
	ui32 s2_8 = a3 + 0x03 & 252;
	ui32 a5_12 = (word32) (word16) s2_8;
	Eq_2 s1_19 = (word32) (word16) (a1 + 3 + a5_12 & 0x00 - a5_12);
	struct Eq_250973 * a0_38;
	struct Eq_250973 ** a1_39;
	struct Eq_250975 * s1_46;
	word32 s2_47;
	struct Eq_250973 ** s3_48;
	word32 s8_141;
	word32 a6_139;
	word32 s4_140;
	word32 a5_138;
	word32 a2_137;
	struct Eq_243659 * a4_122;
	struct Eq_243772 * a3_121;
	pvPortMalloc(ra, s1_19, (word32) s1_19 + a2 + (0x00 - s2_8 & s2_8 + 31), a3 + 0x03, a4, s2_8 + 31, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_46, out a0_38, out a1_39, out a2_137, out a3_121, out a4_122, out a5_138, out a6_139, out s2_47, out s3_48, out s4_140, out s8_141);
	if (a0_38 != null)
	{
		struct Eq_243772 * a5_56 = a0_38 + a1 / 32;
		a5_56->ptr0014 = a0_38;
		*a1_39 = (struct Eq_250973 **) a0_38;
		dwArg34->ptr0004 = a0_38;
		a0_38->dw0008 = 0x00;
		a0_38->b000C = (byte) s2_47;
		s1_46->ptr0010 = a0_38;
		a0_38->dw001C = 0x00;
		a4_122 = null;
		a3_121 = null;
		while (a4_122 != dwArg34)
		{
			a3_121->ptr0000 = a5_56;
			a4_122 = (word32) (word16) ((char *) a4_122 + 1);
			a3_121 = a5_56;
			a5_56 += s1_46;
		}
		a3_121->ptr001C = a0_38;
		a3_121->ptr0018 = a0_38;
		*s3_48 = (struct Eq_250973 **) a0_38;
		a0_118 = 0x00;
	}
	else
		a0_118 = ~0x00;
	0x00 = (uint16) dwArg0128;
	a0Out = a0_118;
	a3Out = a3_121;
	a4Out = a4_122;
	return dwArgE4;
}

// 2304BF02: Register word32 utils_memp_deinit(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out Eq_2 a5Out)
// Called from:
//      ping_free
word32 utils_memp_deinit(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a5Out = a5;
		return s0;
	}
	else
	{
		Eq_2 a5_14;
		word32 s0_20;
		word32 s1_53;
		word32 a0_54;
		word32 a1_55;
		word32 a2_56;
		word32 a3_57;
		word32 a4_58;
		word32 a6_59;
		word32 s4_60;
		word32 t3_61;
		vPortFree(a0, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_20, out s1_53, out a0_54, out a1_55, out a2_56, out a3_57, out a4_58, out a5_14, out a6_59, out s4_60, out t3_61);
		a5Out = a5_14;
		return s0_20;
	}
}

// 2304BF18: Register Eq_243206 utils_memp_malloc(Register Eq_243206 a0, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a4Out)
// Called from:
//      ping_timeout
Eq_243206 utils_memp_malloc(Eq_243206 a0, Eq_2 a3, Eq_2 a4, union Eq_2 & a4Out)
{
	Eq_243206 a5_10 = 0x00;
	if (a0 != 0x00)
	{
		a5_10.u0 = 0x00;
		if (a4 != a3)
		{
			Eq_2 a0_11 = *(union Eq_2 *) 0x1C;
			if (false)
			{
				word32 a5_12 = *a3;
				*((word32) a4 + 9) = a0_11;
				*((word32) a3 + 28) = a0_11;
				*(word32 *) 0x00A5 = a5_12;
				a4.u0 = 0x00A5;
				a5_10 = a5_12 + 0x04;
			}
		}
	}
	a4Out = a4;
	return a5_10;
}

// 2304BF3E: Register Eq_2 utils_memp_free(Register Eq_2 a0, Register Eq_2 a1, Register Eq_242805 a2, Register Eq_2 a4, Register out Eq_242805 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      ping_free
//      ping_timeout
//      ping_recv
Eq_2 utils_memp_free(Eq_2 a0, Eq_2 a1, Eq_242805 a2, Eq_2 a4, union Eq_242805 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	if (a0 != 0x00 && (a1 != ~0x03 && (a4 != 0x00 && ((word32) a1 - 4 >= a4 && a2 >= (word32) a1 - 4))))
	{
		a4 = (word32) a1 - 4 - a4 & a2;
		if (a4 == 0x00)
		{
			a2 = *((word32) a1 - 4);
			a4.u0 = 0x00A5;
			if (a2 == 0x00A5)
			{
				*((word32) a1 + 0x0FFC) = 0x00A5;
				word32 a5_22 = *(word32 *) 0x00AD;
				*((word32) a1 + 24) = a5_22;
				*(word32 *) 0xAC = a5_22;
				a2Out = a2;
				a3Out.u0 = <invalid>;
				a4Out.u0 = 0xA4;
				return 0x00;
			}
		}
	}
	a2Out = a2;
	a3Out.u0 = <invalid>;
	a4Out = a4;
	return ~0x00;
}

// 2304BF86: Register ptr32 utils_tlv_bl_pack_auto(Register ptr32 a0, Register int32 a1, Register word32 a2, Register (ptr32 byte) a3, Register (ptr32 Eq_105733) a4)
// Called from:
//      bl_main_cfg_task_req
ptr32 utils_tlv_bl_pack_auto(ptr32 a0, int32 a1, word32 a2, byte * a3, struct Eq_105733 * a4)
{
	ptr32 a5_12;
	if (a2 != 0x01)
	{
		if (a2 != 0x07)
		{
			a5_12 = ~0x01;
			return a5_12;
		}
	}
	else
		a4 = (word32) *a3;
	a5_12 = ~0x00;
	if (a1 > 0x03)
	{
		a4->ptr0000 = a0;
		a5_12 = 0x04;
	}
	return a5_12;
}

// 2304BFAE: void utils_tlv_bl_unpack_auto(Register int32 a1, Register word32 a2, Register (ptr32 byte) a3)
// Called from:
//      cfg_start_req_handler
void utils_tlv_bl_unpack_auto(int32 a1, word32 a2, byte * a3)
{
	if (a2 == 0x01)
	{
		word32 a5_12;
		if (a1 > 0x03)
			a5_12 = (word32) true;
		else
			a5_12 = 0x01;
		*a3 = (byte) a5_12;
	}
	else
	{
		if (a2 != 0x07)
			return;
		byte ** a5_18 = (byte **) 0x03;
		if (a1 <= 0x03)
			a5_18 = null;
		*a5_18 = (byte **) a3;
	}
}

// 2304BFEC: void utils_hmac_sha1_fast(Register Eq_2 ra, Register int32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      Bl_F_fast.constprop.0
void utils_hmac_sha1_fast(Eq_2 ra, int32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5)
{
	Eq_2 s5_165 = a5;
	Eq_2 s2_113 = a3;
	Eq_2 s1_111 = a4;
	if (a4 > 64)
	{
		bl_sha_init(ra, fp + -0x00C4, 0x02, (word32 *) 64, dwLoc8C);
		ui32 * a4_62;
		Eq_2 s2_68;
		Eq_2 s5_71;
		word32 a1_473;
		word32 a2_474;
		word32 s3_475;
		word32 s4_476;
		bl_sha_update(fp + -0x00C4, a3, a4, a5, dwLoc88, out a1_473, out a2_474, out a4_62, out s2_68, out s3_475, out s4_476, out s5_71);
		word32 s0_477;
		word32 s1_478;
		word32 s4_479;
		word32 s6_480;
		ra = bl_sha_finish(s2_68, a4_62, s5_71, dwLocA8, out s0_477, out s1_478, out s2_113, out s4_479, out s5_165, out s6_480);
		s1_111.u0 = 0x14;
	}
	word32 t1_460;
	word32 a4_465;
	word32 a5_466;
	word32 a0_461;
	word32 a1_462;
	word32 a2_463;
	word32 a3_464;
	Eq_2 ra_108 = memset(ra, fp + -288, 0x00, 64, out t1_460, out a0_461, out a1_462, out a2_463, out a3_464, out a4_465, out a5_466);
	word32 a4_469;
	word32 a5_470;
	word32 a6_471;
	word32 a7_472;
	word32 a1_467;
	word32 a2_468;
	struct Eq_251275 ** a3_121;
	memcpy(fp + -288, s2_113, s1_111, out a1_467, out a2_468, out a3_121, out a4_469, out a5_470, out a6_471, out a7_472);
	do
	{
		struct Eq_251275 * a5_136 = *a3_121;
		a5_136->dw1000 = a3_121 ^ 0x36363636;
		int32 a3_141 = a5_136->dw0004;
		a5_136->dw1004 = a3_141 ^ 0x36363636;
		a3_121 = a3_141 ^ 0x36363636;
	} while (&a5_136->dw0004 + 1 != fp + -224);
	bl_sha_init(ra_108, fp + -0x00C4, 0x02, &a5_136->dw0004 + 1, dwLoc8C);
	word32 s2_481;
	word32 s3_482;
	Eq_2 a2_168;
	Eq_2 a1_167;
	Eq_2 s5_179;
	Eq_2 s4_178;
	ui32 * a4_170;
	bl_sha_update(fp + -0x00C4, fp + -288, 64, s5_165, dwLoc88, out a1_167, out a2_168, out a4_170, out s2_481, out s3_482, out s4_178, out s5_179);
	int32 s3_184 = 0x00;
	while (s3_184 < a2)
	{
		word32 s2_483;
		bl_sha_update(fp + -0x00C4, a1_167, a2_168, s5_179, dwLoc88, out a1_167, out a2_168, out a4_170, out s2_483, out s3_184, out s4_178, out s5_179);
	}
	Eq_2 s1_228;
	Eq_2 s2_229;
	ptr32 s4_231;
	Eq_2 s5_232;
	word32 a2_489;
	word32 a3_490;
	word32 a4_491;
	word32 a5_492;
	word32 s6_485;
	word32 t1_486;
	word32 a0_487;
	word32 a1_488;
	word32 s0_484;
	Eq_2 ra_246 = memset(bl_sha_finish(s4_178, a4_170, s5_179, dwLocA8, out s0_484, out s1_228, out s2_229, out s4_231, out s5_232, out s6_485), fp + -288, 0x00, 64, out t1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_492);
	word32 a6_497;
	word32 a7_498;
	word32 a1_493;
	word32 a2_494;
	word32 a3_495;
	word32 a5_496;
	struct Eq_251390 ** a4_252;
	memcpy(fp + -288, s2_229, s1_228, out a1_493, out a2_494, out a3_495, out a4_252, out a5_496, out a6_497, out a7_498);
	do
	{
		struct Eq_251390 * s0_269 = *a4_252;
		s0_269->dw1000 = a4_252 ^ 0x5C5C5C5C;
		int32 a4_274 = s0_269->dw0004;
		s0_269->dw1004 = a4_274 ^ 0x5C5C5C5C;
		a4_252 = a4_274 ^ 0x5C5C5C5C;
	} while (&s0_269->dw0004 + 1 != s4_231);
	bl_sha_init(ra_246, fp + -0x00C4, 0x02, (word32 *) 0x5C5C5C5C, dwLoc8C);
	word32 s3_508;
	word32 s2_511;
	word32 s1_510;
	Eq_2 s5_311;
	ui32 * a4_323;
	Eq_2 s5_332;
	Eq_2 s0_347;
	Eq_2 s5_352;
	Eq_2 s6_353;
	word32 s4_509;
	word32 a1_505;
	word32 a2_506;
	word32 s2_507;
	word32 s3_503;
	word32 s4_504;
	word32 s2_502;
	word32 a4_501;
	word32 a1_499;
	word32 a2_500;
	word32 s4_512;
	bl_sha_finish(bl_sha_update(fp + -0x00C4, bl_sha_update(fp + -0x00C4, fp + -288, 64, s5_232, dwLoc88, out a1_499, out a2_500, out a4_501, out s2_502, out s3_503, out s4_504, out s5_311), 0x14, s5_311, dwLoc88, out a1_505, out a2_506, out a4_323, out s2_507, out s3_508, out s4_509, out s5_332), a4_323, s5_332, dwLocA8, out s0_347, out s1_510, out s2_511, out s4_512, out s5_352, out s6_353);
	word32 a1_513;
	word32 a2_514;
	word32 a3_515;
	word32 a4_516;
	word32 a5_517;
	word32 a6_518;
	word32 a7_519;
	memcpy(s5_352, s0_347, s6_353, out a1_513, out a2_514, out a3_515, out a4_516, out a5_517, out a6_518, out a7_519);
}

// 2304C14E: Register Eq_2 vfs_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      aos_loop_proc
Eq_2 vfs_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_22 = (word32) g_b4200DFE4;
	ptr32 a5_14 = 0x00;
	if (a4_22 != 0x01)
	{
		word32 a0_31;
		word32 a2_115;
		word32 s1_24 = xQueueCreateMutexStatic(0x01, &g_t42015490, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0108, dwArg0138, dwArg0178, out a0_31, out a2_115, out a3, out a4_22);
		*(word32 *) 0x42020ED8 = a0_31;
		a5_14 = ~0x00;
		if (a0_31 != 0x00)
		{
			ra = inode_init(ra, out a3, out a4_22);
			g_b4200DFE4 = (byte) s1_24;
			a5_14 = 0x00;
		}
	}
	a3Out = a3;
	a4Out = a4_22;
	a5Out = a5_14;
	return ra;
}

