pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304C198: Register Eq_2 aos_open(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out (ptr32 ptr32) a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
//      aws_main_entry
//      cat_cmd
//      hexdump_cmd
//      aos_event_service_init
//      mbedtls_pk_load_file
Eq_2 aos_open(Eq_2 ra, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	ptr32 * s0_107;
	if (a0 == 0x00)
	{
		s0_107 = (ptr32 *) ~0x15;
		goto l2304C1E4;
	}
	s2 = a0;
	s3 = a1;
	a5.u0 = 0x0400;
	Eq_2 a2_26;
	word32 a5_368;
	word32 a1_367;
	if (strlen(a0, out a1_367, out a2_26, out a3, out a4, out a5_368) > 0x0400)
	{
		s0_107 = (ptr32 *) -91;
		goto l2304C1E4;
	}
	word32 a0_33;
	word32 a5_372;
	word32 s4_373;
	word32 a1_370;
	word32 a2_371;
	word32 s1_369;
	xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2_26, a3, a4, 0x0400, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_369, out a0_33, out a1_370, out a2_371, out a3, out a4, out a5_372, out s2, out s3, out s4_373);
	a5.u0 = 0x01;
	if (a0_33 != 0x01)
	{
		s0_107 = (ptr32 *) ~0x00;
		goto l2304C1E4;
	}
	struct Eq_251574 * a0_51;
	word32 * a2_53;
	Eq_2 a4_55;
	Eq_2 a5_56;
	word32 s3_62;
	struct Eq_251579 * s4_63;
	inode_open(s2, dwArg88, out a0_51, out a2_53, out a4_55, out a5_56, out s3_62, out s4_63);
	if (a0_51 == null)
	{
		word32 s0_381;
		word32 s1_382;
		word32 a0_383;
		word32 a1_384;
		word32 a2_385;
		word32 a7_386;
		word32 s4_387;
		word32 s5_388;
		word32 s8_389;
		xQueueGenericSend(s4_63->tFFFFFED8, 0x00, 0x00, a4_55, a5_56, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_381, out s1_382, out a0_383, out a1_384, out a2_385, out a3, out a4, out a5, out a7_386, out s2, out s3, out s4_387, out s5_388, out s6, out s8_389);
		s0_107 = (ptr32 *) ~0x01;
		goto l2304C1E4;
	}
	a0_51->dw000C = s3_62;
	Eq_2 a5_78;
	word32 s4_96;
	word32 s0_374;
	word32 a0_375;
	word32 a1_376;
	word32 a2_377;
	word32 a7_378;
	word32 s5_379;
	word32 s8_380;
	struct Eq_252748 ** s1_117;
	xQueueGenericSend(s4_63->tFFFFFED8, 0x00, 0x00, new_file(a0_51, a2_53, out a5_78), a5_78, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_374, out s1_117, out a0_375, out a1_376, out a2_377, out a3, out a4, out a5, out a7_378, out s2, out s3, out s4_96, out s5_379, out s6, out s8_380);
	if (s1_117 == null)
	{
		s0_107 = (ptr32 *) ~0x16;
		goto l2304C1E4;
	}
	ptr32 * a0_121;
	struct Eq_251678 * s0_108 = *a5.u0;
	a3 = (word32) s0_108->b0010;
	a4.u0 = 0x03;
	struct Eq_251678 * a5_111 = *a5.u0;
	if (a3 == 0x03)
	{
		if (a5_111 == null)
			goto l2304C23A;
		word32 a5_153;
		word32 tp_161;
		word32 a7_162;
		word32 s5_163;
		word32 t1_165;
		word32 t0_166;
		word32 t2_167;
		word32 t4_168;
		word32 t5_169;
		word32 t6_170;
		a5_111();
	}
	else
	{
		if (a5_111 == null)
			goto l2304C23A;
		word32 a5_123;
		word32 tp_131;
		word32 a7_132;
		word32 s5_133;
		word32 t1_135;
		word32 t0_136;
		word32 t2_137;
		word32 t4_138;
		word32 t5_139;
		word32 t6_140;
		a5_111();
	}
	s0_107 = a0_121;
	if (a0_121 != null)
	{
		a5 = del_file(s1_117);
l2304C1E4:
		s0Out.u0 = <invalid>;
		a0Out = s0_107;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
l2304C23A:
	Eq_2 a5_188;
	ptr32 * a0_187 = get_fd(s1_117, out a5_188);
	s0Out.u0 = <invalid>;
	a0Out = a0_187;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_188;
	s2Out = s2;
	s3Out = s3;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2304C25E: Register (ptr32 (ptr32 Eq_252748)) aos_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_7032) s2, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_7090) a5Out, Register out (ptr32 Eq_7032) s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aws_main_entry
//      cat_cmd
//      hexdump_cmd
//      mbedtls_pk_load_file
struct Eq_252748 ** aos_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, struct Eq_7032 * s2, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_7090 & a5Out, struct Eq_7032 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	struct Eq_251732 * sp_22 = fp + ~0x0F;
	struct Eq_7090 * a5_126;
	if (get_file(a0, out a5_126) != 0x00)
	{
		word32 a0_17 = *a4;
		Eq_2 a4_20 = a5_126->t0000;
		Eq_2 a5_21 = a5_126->t0004;
		if (a5_21 != 0x00)
		{
			word32 a1_32;
			word32 a6_109;
			word32 s3_110;
			word32 s4_111;
			word32 s8_112;
			word32 t3_113;
			word32 a7_114;
			word32 t0_117;
			word32 t1_118;
			word32 t4_119;
			word32 t5_120;
			word32 t6_121;
			a5_21();
		}
		word32 a0_48;
		word32 a1_185;
		word32 a2_186;
		word32 a5_187;
		word32 s4_188;
		xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2, a3, a4_20, a5_21, mstatus, sp_22->t0008, sp_22->t0024, sp_22->t00A4, sp_22->t0118, sp_22->t0158, out s1, out a0_48, out a1_185, out a2_186, out a3, out a4, out a5_187, out s2, out s3, out s4_188);
		a5_126 = (struct Eq_7090 *) 0x01;
		if (a0_48 == 0x01)
		{
			word32 s0_189;
			word32 a0_190;
			word32 a1_191;
			word32 a2_192;
			word32 a7_193;
			word32 s4_194;
			word32 s8_195;
			xQueueGenericSend(s2->tFFFFFED8, 0x00, 0x00, a4, del_file(s1), mstatus, sp_22->t0008, sp_22->t0024, sp_22->t00A4, sp_22->t0118, sp_22->t0158, sp_22->t0198, out s0_189, out s1, out a0_190, out a1_191, out a2_192, out a3, out a4, out a5_126, out a7_193, out s2, out s3, out s4_194, out s5, out s6, out s8_195);
		}
	}
	0x00 = (uint16) dwArg38;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_126;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	s6Out = s6;
	return s1;
}

// 2304C2B6: Register Eq_2 aos_read(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a4, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      cat_cmd
//      console_cb_read
//      event_read_cb
//      mbedtls_pk_load_file
Eq_2 aos_read(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a4, Eq_2 dwArg00, Eq_2 dwArg44, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, word32 & a5Out)
{
	ptr32 a0_13;
	word32 * a5_12;
	if (get_file(a0, out a5_12) != 0x00)
	{
		word32 a0_14 = *a5_12;
		s0 = a1;
		a2 = dwArg44;
		a5_12 = (word32 *) *a4;
		<anonymous> * t1_19 = *((word32) a4 + 8);
		if (t1_19 != null)
		{
			Eq_2 ra_28;
			ptr32 a1_29;
			Eq_2 a2_30;
			ptr32 a0_31;
			word32 * a5_32;
			ptr32 s0_33;
			Eq_2 a4_34;
			word32 t1_35;
			t1_19();
			s0Out = s0_33;
			a0Out = a0_31;
			a1Out = a1_29;
			a2Out = a2_30;
			a4Out = a4_34;
			a5Out = a5_32;
			return ra_28;
		}
		a0_13 = ~0x00;
	}
	else
		a0_13 = ~0x01;
	s0Out = s0;
	a0Out = a0_13;
	a1Out = a1;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5_12;
	return ra;
}

