pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304C2E4: Register Eq_2 aos_write(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register (ptr32 Eq_137031) a4, Stack word32 dwArg00, Stack word32 dwArg44, Register out (ptr32 code) t1Out, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out (ptr32 Eq_137031) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      cli_putstr
Eq_2 aos_write(Eq_2 ra, Eq_2 a0, ptr32 a1, struct Eq_137031 * a4, word32 dwArg00, word32 dwArg44, <anonymous> & t1Out, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out, struct Eq_137031 & a4Out, word32 & a5Out)
{
	ptr32 a0_13;
	word32 * a5_12;
	if (get_file(a0, out a5_12) != 0x00)
	{
		word32 a0_14 = *a5_12;
		s0 = a1;
		a5_12 = a4->ptr0000;
		t1 = a4->ptr000C;
		if (t1 != null)
		{
			Eq_2 ra_28;
			ptr32 a1_29;
			ptr32 a0_31;
			word32 * a5_32;
			ptr32 s0_33;
			struct Eq_137031 * a4_34;
			<anonymous> * t1_35;
			t1();
			t1Out = t1_35;
			s0Out = s0_33;
			a0Out = a0_31;
			a1Out = a1_29;
			a4Out = a4_34;
			a5Out = a5_32;
			return ra_28;
		}
		a0_13 = ~0x00;
	}
	else
		a0_13 = ~0x01;
	t1Out = t1;
	s0Out = s0;
	a0Out = a0_13;
	a1Out = a1;
	a4Out = a4;
	a5Out = a5_12;
	return ra;
}

// 2304C312: Register Eq_2 aos_ioctl(Register Eq_2 ra, Register Eq_2 a0, Register Eq_5785 a1, Register ptr32 a2, Register (ptr32 Eq_604) a4, Stack word32 dwArg00, Stack Eq_2 dwArg44, Register out Eq_2 s0Out, Register out Eq_5791 a0Out, Register out Eq_5785 a1Out, Register out ptr32 a3Out)
// Called from:
//      aws_main_entry
//      hexdump_cmd
//      aos_post_event
Eq_2 aos_ioctl(Eq_2 ra, Eq_2 a0, Eq_5785 a1, ptr32 a2, struct Eq_604 * a4, word32 dwArg00, Eq_2 dwArg44, union Eq_2 & s0Out, union Eq_5791 & a0Out, union Eq_5785 & a1Out, ptr32 & a3Out)
{
	if (a0 < 0x00)
	{
		s0Out = s0;
		a0Out.u0 = ~0x15;
		a1Out = a1;
		a3Out = a3;
		return ra;
	}
	else
	{
		Eq_5791 a0_14;
		struct Eq_251931 * a5_13;
		if (get_file(a0, out a5_13) != 0x00)
		{
			<anonymous> * t1_22;
			word32 a0_16 = a4->dw0000;
			s0 = dwArg44;
			a3 = (word32) a4->b0010;
			if (a3 == 0x03)
				t1_22 = a5_13->ptr0044;
			else
				t1_22 = a5_13->ptr0010;
			if (t1_22 != null)
			{
				Eq_5791 a0_40;
				Eq_2 ra_41;
				Eq_5785 a1_43;
				Eq_2 s0_45;
				ptr32 a3_46;
				word32 a5_47;
				word32 t1_48;
				t1_22();
				s0Out = s0_45;
				a0Out = a0_40;
				a1Out = a1_43;
				a3Out = a3_46;
				return ra_41;
			}
			a0_14.u0 = -88;
		}
		else
			a0_14.u0 = ~0x01;
		s0Out = s0;
		a0Out = a0_14;
		a1Out = a1;
		a3Out = a3;
		return ra;
	}
}

// 2304C35A: Register Eq_2 aos_lseek(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Stack Eq_2 dwArg00, Stack Eq_2 dwArg44, Register out ptr32 s0Out, Register out Eq_251971 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mbedtls_pk_load_file
Eq_2 aos_lseek(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 dwArg00, Eq_2 dwArg44, ptr32 & s0Out, union Eq_251971 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_251971 a0_13;
	struct Eq_251976 * a5_12;
	if (get_file(a0, out a5_12) != 0x00)
	{
		struct Eq_251983 * a0_14 = a5_12->ptr0000;
		a4 = 0x03;
		a3 = (word32) a5_12->b0010;
		if (a3 == 0x03)
		{
			<anonymous> * t1_18 = a5_12->ptr0000->ptr0010;
			if (t1_18 != null)
			{
				Eq_2 ra_31;
				ptr32 a2_33;
				Eq_251971 a0_34;
				ptr32 a4_36;
				ptr32 a3_37;
				word32 t1_38;
				ptr32 s0_39;
				t1_18();
				s0Out = s0_39;
				a0Out = a0_34;
				a2Out = a2_33;
				a3Out = a3_37;
				a4Out = a4_36;
				return ra_31;
			}
		}
		a0_13.u0 = -88;
	}
	else
		a0_13.u0 = ~0x01;
	s0Out = s0;
	a0Out = a0_13;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	return ra;
}

// 2304C394: Register Eq_2 aos_stat(Register Eq_2 ra, Register ptr32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 (ptr32 Eq_252748)) s3Out, Register out Eq_2 s4Out, Register out (ptr32 Eq_138126) s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      ls_cmd
Eq_2 aos_stat(Eq_2 ra, ptr32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_252748 & s3Out, union Eq_2 & s4Out, struct Eq_138126 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_252015 * sp_113 = fp + ~0x1F;
	ptr32 s0_104 = ~0x15;
	if (a0 != 0x00)
	{
		word32 a0_31;
		Eq_2 s1_39;
		word32 a5_344;
		word32 s2_345;
		word32 s4_346;
		word32 a1_341;
		word32 a2_342;
		word32 a4_343;
		s2 = xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_39, out a0_31, out a1_341, out a2_342, out a3, out a4_343, out a5_344, out s2_345, out s3, out s4_346);
		if (a0_31 != 0x01)
		{
l2304C3C2:
			a5.u0 = 0x01;
			s0_104 = ~0x00;
			goto l2304C3C4;
		}
		struct Eq_251574 * a0_49;
		word32 * a2_51;
		Eq_2 a4_53;
		Eq_2 a5_54;
		word32 s3_347;
		word32 s4_348;
		struct Eq_251596 * s0_57 = inode_open(s1_39, dwArg88, out a0_49, out a2_51, out a4_53, out a5_54, out s3_347, out s4_348);
		if (a0_49 == null)
		{
			word32 s0_355;
			word32 s1_356;
			word32 a0_357;
			word32 a1_358;
			word32 a2_359;
			word32 a4_360;
			word32 a7_361;
			word32 s4_362;
			word32 s8_363;
			xQueueGenericSend(s0_57->tFFFFFED8, 0x00, 0x00, a4_53, a5_54, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_355, out s1_356, out a0_357, out a1_358, out a2_359, out a3, out a4_360, out a5, out a7_361, out s2, out s3, out s4_362, out s5, out s6, out s8_363);
			s0_104 = ~0x12;
		}
		else
		{
			Eq_2 a5_75;
			word32 s1_90;
			word32 s4_93;
			word32 a0_350;
			word32 a1_351;
			word32 a4_352;
			word32 s0_349;
			word32 a7_353;
			word32 s8_354;
			Eq_2 a2_127;
			xQueueGenericSend(s0_57->tFFFFFED8, 0x00, 0x00, new_file(a0_49, a2_51, out a5_75), a5_75, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_349, out s1_90, out a0_350, out a1_351, out a2_127, out a3, out a4_352, out a5, out a7_353, out s2, out s3, out s4_93, out s5, out s6, out s8_354);
			s0_104 = ~0x01;
			if (s3 != null)
			{
				Eq_2 a4_105 = (word32) s5->b0010;
				Eq_2 a5_106 = 0x03;
				if (a4_105 == 0x03)
				{
					a5_106 = s5->ptr0000->t0018;
					if (a5_106 != 0x00)
					{
						word32 a7_132;
						word32 t1_134;
						word32 t0_135;
						word32 t2_136;
						word32 t4_137;
						word32 t5_138;
						word32 t6_139;
						a5_106();
					}
				}
				word32 a0_151;
				Eq_2 a4_155;
				word32 s1_364;
				word32 a1_365;
				word32 a2_366;
				word32 a5_367;
				word32 s4_368;
				xQueueSemaphoreTake(*((word32) s2 - 296), ~0x00, a2_127, a3, a4_105, a5_106, mstatus, sp_113->t0008, sp_113->t0024, sp_113->t00A4, sp_113->t0118, sp_113->t0158, out s1_364, out a0_151, out a1_365, out a2_366, out a3, out a4_155, out a5_367, out s2, out s3, out s4_368);
				if (a0_151 != 0x01)
					goto l2304C3C2;
				word32 s1_369;
				word32 a0_370;
				word32 a1_371;
				word32 a2_372;
				word32 a4_373;
				word32 a7_374;
				word32 s4_375;
				word32 s8_376;
				xQueueGenericSend(*((word32) s2 - 296), 0x00, 0x00, a4_155, del_file(s3), mstatus, sp_113->t0008, sp_113->t0024, sp_113->t00A4, sp_113->t0118, sp_113->t0158, sp_113->t0198, out s0_104, out s1_369, out a0_370, out a1_371, out a2_372, out a3, out a4_373, out a5, out a7_374, out s2, out s3, out s4_375, out s5, out s6, out s8_376);
			}
		}
	}
l2304C3C4:
	a0Out = s0_104;
	a3Out = a3;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2304C44E: Register Eq_2 aos_opendir(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      ls_cmd
Eq_2 aos_opendir(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	ptr32 s0_132;
	struct Eq_252255 * sp_105 = fp + ~0x1F;
	if (a0 == 0x00)
	{
l2304C45E:
		s0_132 = 0x00;
		goto l2304C490;
	}
	word32 a0_27;
	Eq_2 s1_35;
	word32 s3_336;
	word32 s4_337;
	word32 a4_333;
	word32 a5_334;
	word32 s2_335;
	word32 a1_331;
	word32 a2_332;
	xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_35, out a0_27, out a1_331, out a2_332, out a3, out a4_333, out a5_334, out s2_335, out s3_336, out s4_337);
	if (a0_27 != 0x01)
		goto l2304C45E;
	struct Eq_251574 * a0_44;
	word32 * a2_46;
	Eq_2 a4_48;
	Eq_2 a5_49;
	struct Eq_252293 * s3_55;
	word32 s4_338;
	inode_open(s1_35, dwArg88, out a0_44, out a2_46, out a4_48, out a5_49, out s3_55, out s4_338);
	if (a0_44 != null)
	{
		Eq_2 a5_70;
		struct Eq_252306 * s0_84;
		word32 s1_85;
		word32 s2_86;
		word32 s3_87;
		word32 a5_342;
		word32 a7_343;
		word32 s5_344;
		word32 a0_339;
		word32 a1_340;
		word32 a4_341;
		word32 s6_345;
		word32 s8_346;
		struct Eq_252318 * s4_111;
		Eq_2 a2_116;
		xQueueGenericSend(s3_55->tFFFFFED8, 0x00, 0x00, new_file(a0_44, a2_46, out a5_70), a5_70, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_84, out s1_85, out a0_339, out a1_340, out a2_116, out a3, out a4_341, out a5_342, out a7_343, out s2_86, out s3_87, out s4_111, out s5_344, out s6_345, out s8_346);
		if (s2_86 == 0x00)
			goto l2304C45E;
		Eq_2 a4_120 = (word32) s0_84->b0010;
		Eq_2 a5_100 = 0x03;
		if (a4_120 == 0x03)
		{
			Eq_2 s0_101 = *(union Eq_2 *) 0x03;
			a5_100 = *(union Eq_2 *) 0x27;
			if (a5_100 != 0x00)
			{
				struct Eq_252748 ** s2_109;
				ptr32 a0_112;
				word32 tp_122;
				word32 a7_123;
				word32 s5_124;
				word32 s6_125;
				word32 t1_126;
				word32 t0_127;
				word32 t2_128;
				word32 t4_129;
				word32 t5_130;
				word32 t6_131;
				a5_100();
				s0_132 = a0_112;
				if (a0_112 != 0x00)
				{
					word32 a5_379;
					*get_fd(s2_109, out a5_379) = a0_112;
l2304C490:
					s0Out = s1;
					a0Out = s0_132;
					a3Out = a3;
					mstatusOut = mstatus;
					return ra;
				}
			}
		}
		word32 a0_147;
		Eq_2 a4_151;
		struct Eq_252748 ** s2_156;
		struct Eq_252401 * s4_158;
		word32 s1_360;
		word32 a1_361;
		word32 a2_362;
		word32 a5_363;
		word32 s3_364;
		xQueueSemaphoreTake(s4_111->tFFFFFED8, ~0x00, a2_116, a3, a4_120, a5_100, mstatus, sp_105->t0008, sp_105->t0024, sp_105->t00A4, sp_105->t0118, sp_105->t0158, out s1_360, out a0_147, out a1_361, out a2_362, out a3, out a4_151, out a5_363, out s2_156, out s3_364, out s4_158);
		if (a0_147 == 0x01)
		{
			word32 s0_365;
			word32 s1_366;
			word32 a0_367;
			word32 a1_368;
			word32 a2_369;
			word32 a4_370;
			word32 a5_371;
			word32 a7_372;
			word32 s2_373;
			word32 s3_374;
			word32 s4_375;
			word32 s5_376;
			word32 s6_377;
			word32 s8_378;
			xQueueGenericSend(s4_158->tFFFFFED8, 0x00, 0x00, a4_151, del_file(s2_156), mstatus, sp_105->t0008, sp_105->t0024, sp_105->t00A4, sp_105->t0118, sp_105->t0158, sp_105->t0198, out s0_365, out s1_366, out a0_367, out a1_368, out a2_369, out a3, out a4_370, out a5_371, out a7_372, out s2_373, out s3_374, out s4_375, out s5_376, out s6_377, out s8_378);
		}
		goto l2304C45E;
	}
	else
	{
		word32 s1_347;
		word32 a0_348;
		word32 a1_349;
		word32 a2_350;
		word32 a4_351;
		word32 a5_352;
		word32 a7_353;
		word32 s2_354;
		word32 s3_355;
		word32 s4_356;
		word32 s5_357;
		word32 s6_358;
		word32 s8_359;
		xQueueGenericSend(s3_55->tFFFFFED8, 0x00, 0x00, a4_48, a5_49, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_132, out s1_347, out a0_348, out a1_349, out a2_350, out a3, out a4_351, out a5_352, out a7_353, out s2_354, out s3_355, out s4_356, out s5_357, out s6_358, out s8_359);
		goto l2304C490;
	}
}

// 2304C4FE: Register word32 aos_closedir(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register (ptr32 Eq_2) s2, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ls_cmd
word32 aos_closedir(Eq_2 ra, union Eq_2 * a0, union Eq_2 * s2, ptr32 mstatus, Eq_2 dwArg44, ptr32 & a2Out, union Eq_2 & a5Out)
{
	struct Eq_252518 * sp_28 = fp + ~0x1F;
	word32 s0_103 = ~0x15;
	if (a0 != null)
	{
		s0_103 = ~0x01;
		Eq_2 a0_18 = get_file(*a0, out a5);
		if (a0_18 != 0x00)
		{
			struct Eq_252538 * a0_21 = *a5;
			Eq_2 a4_22 = 0x03;
			Eq_2 a3_24 = (word32) *((word32) a5 + 16);
			Eq_2 a2_25 = dwArg44;
			if (a3_24 == 0x03)
			{
				a5 = *((word32) *a5.u0 + 44);
				if (a5 != 0x00)
				{
					word32 a1_34;
					word32 s3_119;
					word32 tp_120;
					word32 a7_121;
					word32 s5_122;
					word32 s6_123;
					word32 t0_124;
					word32 t1_125;
					word32 t4_126;
					word32 t5_127;
					word32 t6_128;
					a5();
				}
			}
			word32 a0_55;
			Eq_2 a4_59;
			struct Eq_252748 ** s1_63;
			struct Eq_252555 * s2_64;
			word32 s4_190;
			word32 a5_188;
			word32 s3_189;
			word32 a1_186;
			word32 a3_187;
			xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2_25, a3_24, a4_22, a5, mstatus, sp_28->t0008, sp_28->t0024, sp_28->t00A4, sp_28->t0118, sp_28->t0158, out s1_63, out a0_55, out a1_186, out a2, out a3_187, out a4_59, out a5_188, out s2_64, out s3_189, out s4_190);
			a5.u0 = 0x01;
			if (a0_55 == 0x01)
			{
				word32 s1_191;
				word32 a0_192;
				word32 a1_193;
				word32 a3_194;
				word32 a4_195;
				word32 a7_196;
				word32 s2_197;
				word32 s3_198;
				word32 s4_199;
				word32 s5_200;
				word32 s6_201;
				word32 s8_202;
				xQueueGenericSend(s2_64->tFFFFFED8, 0x00, 0x00, a4_59, del_file(s1_63), mstatus, sp_28->t0008, sp_28->t0024, sp_28->t00A4, sp_28->t0118, sp_28->t0158, sp_28->t0198, out s0_103, out s1_191, out a0_192, out a1_193, out a2, out a3_194, out a4_195, out a5, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s8_202);
			}
			else
				s0_103 = ~0x00;
		}
	}
	a2Out = a2;
	a5Out = a5;
	return s0_103;
}

// 2304C56E: Register Eq_2 aos_readdir(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Stack word32 dwArg00, Stack Eq_2 dwArg44, Register out ptr32 a0Out)
// Called from:
//      ls_cmd
Eq_2 aos_readdir(Eq_2 ra, union Eq_2 * a0, word32 dwArg00, Eq_2 dwArg44, ptr32 & a0Out)
{
	if (a0 == null)
	{
		a0Out = 0x00;
		return ra;
	}
	else
	{
		struct Eq_252671 * a5_12;
		if (get_file(*a0, out a5_12) != 0x00)
		{
			struct Eq_252681 * a0_13 = a5_12->ptr0000;
			if ((word32) a5_12->b0010 == 0x03)
			{
				<anonymous> * t1_17 = a5_12->ptr0000->ptr0028;
				if (t1_17 != null)
				{
					ptr32 a0_27;
					Eq_2 ra_28;
					word32 a1_29;
					word32 a5_30;
					word32 a4_31;
					word32 a3_32;
					word32 t1_33;
					t1_17();
					a0Out = a0_27;
					return ra_28;
				}
			}
		}
		a0Out = 0x00;
		return ra;
	}
}

// 2304C5A8: Register word32 new_file(Register (ptr32 Eq_251574) a0, Register (ptr32 word32) a2, Register out ptr32 a5Out)
// Called from:
//      aos_open
//      aos_stat
//      aos_opendir
word32 new_file(struct Eq_251574 * a0, word32 * a2, ptr32 & a5Out)
{
	ptr32 a5_10;
	for (a5_10 = 0x0C; a5_10 != 0x30; ++a5_10)
	{
		word32 a4_18;
		word32 a4_15 = *a2;
		if (a2 == null)
		{
			struct Eq_252718 * a5_22 = a5_10 + 0x00;
			a0->dw0000 = (char *) a5_22 + 0x420154E0;
			a5_22->dw420154E4 = 0x00;
			a5_22->dw420154E8 = 0x00;
			a4_18 = 0x0C;
			a5_10 = inode_ref(a0);
			break;
		}
		a4_18 = a4_15 + 0x0C;
	}
	a5Out = a5_10;
	return a4_18;
}

// 2304C5EE: Register word32 del_file(Register (ptr32 (ptr32 Eq_252748)) a0)
// Called from:
//      aos_open
//      aos_close
//      aos_stat
//      aos_opendir
//      aos_closedir
word32 del_file(struct Eq_252748 ** a0)
{
	word32 a5_11 = inode_unref(*a0);
	*a0 = (struct Eq_252748 **) null;
	return a5_11;
}

// 2304C606: Register (ptr32 (ptr32 Eq_252748)) get_fd(Register (ptr32 (ptr32 Eq_252748)) a0, Register out ptr32 a5Out)
// Called from:
//      aos_open
//      aos_opendir
struct Eq_252748 ** get_fd(struct Eq_252748 ** a0, ptr32 & a5Out)
{
	a5Out = ~0x55555554;
	return (a0 - 0x420154E0 >> 2) + ~0x55555552;
}

// 2304C622: Register Eq_2 get_file(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      aos_close
//      aos_read
//      aos_write
//      aos_ioctl
//      aos_lseek
//      aos_closedir
//      aos_readdir
//      aos_poll
Eq_2 get_file(Eq_2 a0, union Eq_2 & a5Out)
{
	Eq_2 a0_15;
	Eq_2 a5_12 = 59;
	if (a0 <= ~0x3C)
	{
		a0_15 = (word32) a0 + 0x0A;
		a5_12 = *((word32) a0 + 0x0A);
		if (a0 != 0x0A)
		{
			a5Out = a5_12;
			return a5_12;
		}
	}
	else
		a0_15.u0 = 0x00;
	a5Out = a5_12;
	return a0_15;
}

// 2304C648: Register Eq_2 inode_init(Register Eq_2 ra, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      vfs_init
Eq_2 inode_init(Eq_2 ra, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_13;
	ptr32 a4_14;
	word32 t1_26;
	word32 a0_27;
	word32 a1_28;
	word32 a2_29;
	word32 a5_30;
	Eq_2 ra_16 = memset(ra, 0x420157B0, 0x00, 600, out t1_26, out a0_27, out a1_28, out a2_29, out a3_13, out a4_14, out a5_30);
	a3Out = a3_13;
	a4Out = a4_14;
	return ra_16;
}

// 2304C666: Register word32 inode_alloc(Register out ptr32 a4Out)
// Called from:
//      inode_reserve
word32 inode_alloc(ptr32 & a4Out)
{
	struct Eq_252798 * a5_12 = g_a420157C0;
	word32 a0_10;
	for (a0_10 = 0x00; a0_10 != 0x1E; ++a0_10)
	{
		if ((word32) a5_12->b0000 == 0x00)
			goto l2304C682;
		++a5_12;
	}
	a0_10 = ~0x0B;
l2304C682:
	a4Out = 0x1E;
	return a0_10;
}

