pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304C684: Register word32 inode_open(Register Eq_2 a0, Stack Eq_2 dwArgA8, Register out (ptr32 Eq_251584) a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out Eq_251587 a5Out, Register out (ptr32 Eq_251584) s3Out, Register out ptr32 s4Out)
// Called from:
//      aos_open
//      aos_stat
//      aos_opendir
word32 inode_open(Eq_2 a0, Eq_2 dwArgA8, struct Eq_251584 & a0Out, ptr32 & a2Out, ptr32 & a4Out, union Eq_251587 & a5Out, struct Eq_251584 & s3Out, ptr32 & s4Out)
{
	struct Eq_251584 * s0_27 = &g_t420157B0;
	a0_107 = a0;
	do
	{
		Eq_2 a0_107;
		Eq_2 s2_29 = s0_27->dw0008;
		struct Eq_251584 * s3_30 = s0_27;
		if (s2_29 != 0x00)
		{
			if ((word32) s0_27->b0010 == 0x03)
			{
				word32 a1_199;
				word32 a2_200;
				word32 a3_201;
				word32 a4_202;
				word32 a5_203;
				word32 a1_204;
				word32 a2_205;
				word32 a3_206;
				word32 a4_207;
				word32 a5_208;
				a0_107 = strncmp(s2_29, a0, strlen(s2_29, out a1_199, out a2_200, out a3_201, out a4_202, out a5_203), out a1_204, out a2_205, out a3_206, out a4_207, out a5_208);
				if (a0_107 == 0x00)
				{
					word32 a1_212;
					word32 a2_213;
					word32 a3_214;
					word32 a5_215;
					a0_107 = strlen(a0_107, out a1_212, out a2_213, out a3_214, out a4, out a5_215) + a0;
					a5 = (word32) *a0_107;
					if (a5 == 47)
						goto l2304C6BC;
				}
			}
			s0_27 = (struct Eq_251584 *) *((word32) a0_107 + 8);
			word32 a1_209;
			word32 a2_210;
			word32 a3_211;
			a0_107 = strcmp(a0_107, a0, out a1_209, out a2_210, out a3_211, out a4, out a5);
			if (a0_107 == 0x00)
				goto l2304C6BC;
		}
		++s0_27;
	} while (s0_27 != &g_t42015A08);
	s3_30 = null;
l2304C6BC:
	0x00 = (uint16) dwArgA8;
	a0Out = s3_30;
	a2Out = dwArg48;
	a4Out = a4;
	a5Out = a5;
	s3Out = s3_30;
	s4Out = dwArg04;
	return s1;
}

// 2304C70A: Register word32 inode_forearch_name(Register Eq_2 ra, Register (ptr32 code) a0, Register ptr32 a1, Register (ptr32 Eq_137817) a5, Register out ptr32 a2Out, Register out (ptr32 Eq_137817) a5Out)
// Called from:
//      ls_cmd
word32 inode_forearch_name(Eq_2 ra, <anonymous> * a0, ptr32 a1, struct Eq_137817 * a5, ptr32 & a2Out, struct Eq_137817 & a5Out)
{
	<anonymous> * s3_19 = a0;
	ptr32 s4_21 = a1;
	word32 s2_22 = 0x42015A08;
	word32 s1_23 = 0x00;
	do
	{
		word32 s0_26 = a5->dw0008;
		if (a5 != null)
		{
			word32 a0_43;
			s3_19();
			if (a0_43 != 0x00)
				break;
		}
	} while (s0_26 + 0x14 != s2_22);
	a2Out = dwArg48;
	a5Out = a5;
	return s1;
}

// 2304C750: Register word32 inode_ref(Register (ptr32 Eq_251574) a0)
// Called from:
//      new_file
word32 inode_ref(struct Eq_251574 * a0)
{
	word32 a5_5 = (word32) a0->b0011;
	a0->b0011 = (byte) (a5_5 + 0x01);
	return a5_5 + 0x01;
}

// 2304C75C: Register word32 inode_unref(Register (ptr32 Eq_252748) a0)
// Called from:
//      del_file
word32 inode_unref(struct Eq_252748 * a0)
{
	word32 a5_5 = (word32) a0->b0011;
	if (a5_5 != 0x00)
	{
		a0->b0011 = (byte) (a5_5 + ~0x00);
		a5_5 += ~0x00;
	}
	return a5_5;
}

// 2304C76A: Register Eq_2 inode_reserve(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 word32) a1, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_252961 a0Out, Register out Eq_252962 a4Out, Register out Eq_252961 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      aos_register_driver
//      aos_register_fs
Eq_2 inode_reserve(Eq_2 ra, Eq_2 a0, word32 * a1, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_252961 & a0Out, union Eq_252962 & a4Out, union Eq_252961 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	if (a0 != 0x00 && a1 != null)
	{
		*a1 = 0x00;
		a4 = (word32) *a0;
		if (a4 == 47)
		{
			Eq_252962 a4_145;
			Eq_252961 a0_23 = inode_alloc(out a4_145);
			Eq_2 s1_159 = a0;
			Eq_252961 a5_27 = a0_23;
			if (a0_23 >= 0x00)
			{
				Eq_2 a3_38;
				Eq_2 a4_39;
				Eq_2 a5_40;
				Eq_2 a0_50;
				union Eq_2 * s4_61;
				word32 s8_219;
				word32 s2_218;
				word32 a6_217;
				word32 a5_216;
				word32 a3_215;
				word32 a2_214;
				word32 a1_213;
				word32 a2_212;
				word32 a1_211;
				Eq_2 s0_57 = pvPortMalloc(ra, a0, (word32) strlen(a0, out a1_211, out a2_212, out a3_38, out a4_39, out a5_40) + 1, a3_38, a4_39, a5_40, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_159, out a0_50, out a1_213, out a2_214, out a3_215, out a4_145, out a5_216, out a6_217, out s2_218, out s3, out s4_61, out s8_219);
				s2 = a0_50;
				a5_27.u0 = ~0x0B;
				if (a0_50 != 0x00)
				{
					word32 a7_225;
					word32 a6_224;
					word32 a5_223;
					word32 a3_222;
					word32 a2_221;
					word32 a1_220;
					memcpy(a0_50, s1_159, s3, out a1_220, out a2_221, out a3_222, out a4_145, out a5_223, out a6_224, out a7_225);
					*((word32) s0_57 + 8) = a0_50;
					s2 = a0_50 + s3;
					s2->u1 = 0x00;
					*s4_61 = (union Eq_2 *) s0_57;
					a5_27.u0 = 0x00;
				}
			}
			a0Out = a5_27;
			a4Out = a4_145;
			a5Out = a5_27;
			s2Out = s2;
			s3Out = s3;
			s4Out = dwArg04;
			return s1_159;
		}
	}
	a0Out.u0 = ~0x15;
	a4Out = a4;
	a5Out.u0 = ~0x15;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return s1;
}

// 2304C7F6: Register Eq_2 aos_register_driver(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      dev_uart_init
//      vfs_device_init
Eq_2 aos_register_driver(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgB4, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 s0_143;
	word32 a0_32;
	word32 a1_273;
	word32 a2_274;
	word32 a3_275;
	word32 a4_276;
	word32 a5_277;
	word32 s3_278;
	word32 s4_279;
	ptr32 s2_235;
	ptr32 s1_118;
	xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2, a3, a4, a5, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_118, out a0_32, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277, out s2_235, out s3_278, out s4_279);
	ptr32 a5_111 = 0x01;
	if (a0_32 == 0x01)
	{
		Eq_2 a4_53;
		Eq_2 a5_54;
		word32 s4_58;
		word32 a0_61;
		word32 s2_63;
		word32 s3_64;
		struct Eq_253107 * s1_57 = inode_reserve(ra, a0, fp + -36, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_61, out a4_53, out a5_54, out s2_63, out s3_64, out s4_58);
		if (a0_61 == 0x00)
		{
			*a5_54 = s4_58;
			((word32) a5_54 + 16)->u1 = (byte) s2_63;
			*((word32) a5_54 + 4) = s3_64;
		}
		word32 a1_280;
		word32 a2_281;
		word32 a3_282;
		word32 a4_283;
		word32 a5_284;
		word32 a7_285;
		word32 s3_286;
		word32 s4_287;
		word32 s5_288;
		word32 s8_289;
		Eq_2 a0_120;
		xQueueGenericSend(s1_57->tFFFFFED8, 0x00, 0x00, a4_53, a5_54, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s0_143, out s1_118, out a0_120, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a7_285, out s2_235, out s3_286, out s4_287, out s5_288, out s6, out s8_289);
		a5_111 = 0x01;
		if (a0_120 == 0x01)
		{
l2304C86A:
			0x00 = (uint16) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_118;
			a0Out = s0_143;
			a5Out = a5_111;
			s2Out = s2_235;
			s4Out = dwArg78;
			s6Out = s6;
			return ra;
		}
		Eq_2 a5_113 = *((word32) a0_120 + 8);
		if (a0_120 != 0x00)
		{
			word32 s0_296;
			word32 a1_297;
			word32 a2_298;
			word32 a3_299;
			word32 a4_300;
			word32 a5_301;
			word32 a6_302;
			word32 s4_303;
			word32 t3_304;
			vPortFree(a0_120, dwArgB4, a5_113, mstatus, dwArg0128, dwArg0168, out s0_296, out s1_118, out a0_120, out a1_297, out a2_298, out a3_299, out a4_300, out a5_301, out a6_302, out s4_303, out t3_304);
		}
		word32 t1_290;
		word32 a0_291;
		word32 a1_292;
		word32 a2_293;
		word32 a3_294;
		word32 a4_295;
		ra = memset(ra, a0_120, 0x00, 0x14, out t1_290, out a0_291, out a1_292, out a2_293, out a3_294, out a4_295, out a5_111);
	}
	s0_143 = ~0x00;
	goto l2304C86A;
}

// 2304C87E: Register Eq_2 aos_register_fs(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s2Out)
// Called from:
//      romfs_register
Eq_2 aos_register_fs(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgB4, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s2Out)
{
	word32 a0_30;
	Eq_2 s4_41;
	word32 a4_267;
	word32 a5_268;
	word32 s3_269;
	word32 a3_266;
	word32 a2_265;
	word32 a1_264;
	word32 s1_263;
	ptr32 s2_227;
	xQueueSemaphoreTake(g_t4201FED8, ~0x00, a2, a3, a4, a5, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_263, out a0_30, out a1_264, out a2_265, out a3_266, out a4_267, out a5_268, out s2_227, out s3_269, out s4_41);
	if (a0_30 == 0x01)
	{
		Eq_2 a5_51;
		word32 a0_58;
		word32 s2_60;
		word32 s3_61;
		word32 s4_270;
		Eq_2 a4_50;
		struct Eq_253107 * s1_54 = inode_reserve(ra, s4_41, fp + -36, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_58, out a4_50, out a5_51, out s2_60, out s3_61, out s4_270);
		if (a0_58 == 0x00)
		{
			*a5_51 = s3_61;
			((word32) a5_51 + 16)->u1 = 0x03;
			*((word32) a5_51 + 4) = s2_60;
			a4_50.u0 = 0x03;
		}
		word32 s0_271;
		word32 s1_272;
		word32 a1_273;
		word32 a2_274;
		word32 a3_275;
		word32 a4_276;
		word32 a5_277;
		word32 a7_278;
		word32 s3_279;
		word32 s4_280;
		word32 s5_281;
		word32 s6_282;
		word32 s8_283;
		Eq_2 a0_118;
		xQueueGenericSend(s1_54->tFFFFFED8, 0x00, 0x00, a4_50, a5_51, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s0_271, out s1_272, out a0_118, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277, out a7_278, out s2_227, out s3_279, out s4_280, out s5_281, out s6_282, out s8_283);
		if (a0_118 == 0x01)
		{
l2304C8F0:
			0x00 = (uint16) dwArg0128;
			s2Out = s2_227;
			return ra;
		}
		Eq_2 a5_111 = *((word32) a0_118 + 8);
		if (a0_118 != 0x00)
		{
			word32 s0_291;
			word32 s1_292;
			word32 a1_293;
			word32 a2_294;
			word32 a3_295;
			word32 a4_296;
			word32 a5_297;
			word32 a6_298;
			word32 s4_299;
			word32 t3_300;
			vPortFree(a0_118, dwArgB4, a5_111, mstatus, dwArg0128, dwArg0168, out s0_291, out s1_292, out a0_118, out a1_293, out a2_294, out a3_295, out a4_296, out a5_297, out a6_298, out s4_299, out t3_300);
		}
		word32 t1_284;
		word32 a0_285;
		word32 a1_286;
		word32 a2_287;
		word32 a3_288;
		word32 a4_289;
		word32 a5_290;
		ra = memset(ra, a0_118, 0x00, 0x14, out t1_284, out a0_285, out a1_286, out a2_287, out a3_288, out a4_289, out a5_290);
	}
	goto l2304C8F0;
}

// 2304C902: void vfs_uart_open(Register Eq_2 ra, Register Eq_2 s0, Register word32 a1, Register (ptr32 Eq_253368) a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void vfs_uart_open(Eq_2 ra, Eq_2 s0, word32 a1, struct Eq_253368 * a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a1 == 0x00 || a5 == null)
		return;
	Eq_2 a3_7 = (word32) a5->b0011;
	if (a3_7 != 0x01)
		return;
	Eq_2 a0_18;
	Eq_2 a3_21;
	Eq_2 a4_22;
	aos_mutex_new(ra, (word32) s0 + 32, a3_7, 0x01, *((word32) s0 + 4), mstatus, dwLoc10, s0, ra, dwArgE8, dwArg0128, dwArg0168, out a0_18, out a3_21, out a4_22);
	Eq_2 a3_45;
	Eq_2 a4_46;
	word32 s0_49;
	Eq_2 a0_57;
	word32 a5_294;
	word32 s2_295;
	word32 s1_293;
	Eq_2 ra_58 = xStreamBufferGenericCreate(ra, a0_18, 0x01, 0x00, a3_21, a4_22, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_49, out s1_293, out a0_57, out a3_45, out a4_46, out a5_294, out s2_295);
	*((word32) a0_57 + 16) = s0_49;
	struct Eq_253433 * a5_69;
	Eq_2 s1_72;
	Eq_2 s2_73;
	struct Eq_253436 * a0_79;
	word32 a3_297;
	word32 a4_298;
	word32 s0_296;
	Eq_2 ra_80 = xStreamBufferGenericCreate(ra_58, a0_57, 0x01, 0x00, a3_45, a4_46, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s0_296, out s1_72, out a0_79, out a3_297, out a4_298, out a5_69, out s2_73);
	Eq_2 s0_83 = a5_69->t0010;
	a0_79->t0014 = s0_83;
	if (a5_69 == null || a0_79 == null)
		return;
	hal_uart_notify_register(s0_83, 0x00, &g_t2304C9CE);
	Eq_2 a4_109 = hal_uart_notify_register(s0_83, 0x01, &g_t2304C97C);
	hal_uart_init(ra_80, s0, s1_72, s0_83, a4_109, s2_73, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, dwArg8C);
}

// 2304C97C: void __uart_rx_irq(Register Eq_2 ra, Register (ptr32 byte) a0, Register ptr32 mstatus, Stack Eq_2 dwArg1C, Stack word32 dwArg84, Stack Eq_2 dwArg98, Stack word32 dwArgC8)
void __uart_rx_irq(Eq_2 ra, byte * a0, ptr32 mstatus, Eq_2 dwArg1C, word32 dwArg84, Eq_2 dwArg98, word32 dwArgC8)
{
	Eq_2 a2_22;
	word32 s4_183;
	word32 s8_184;
	word32 a5_24;
	Eq_2 a4_23;
	Eq_2 a0_16;
	hal_uart_recv_II(a0, fp + -80, (struct Eq_140435 *) 64, fp + -88, null, out a0_16, out a2_22, out a4_23, out a5_24, out s4_183, out s8_184);
	if (a2_22 != 0x00)
	{
		Eq_2 a3_33;
		Eq_2 s2_40;
		ra = xStreamBufferSendFromISR(ra, a0_16, fp + -80, a2_22, fp + -84, a4_23, mstatus, dwLoc4C, dwArg98, dwArgC8, out a0_16, out a3_33, out a4_23, out a5_24, out s2_40, out mstatus);
		if (a5_24 != 0x00)
			vTaskSwitchContext(ra, a3_33, s2_40, mstatus, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out a0_16, out a4_23, out a5_24);
	}
	if (a5_24 != 0x00)
	{
		ui32 a5_72 = (word32) *((word32) a4_23 + 6);
		*((word32) a4_23 + 6) = (word16) (a5_72 | 1);
		word32 a6_100;
		word32 a7_101;
		word32 s2_102;
		word32 s3_103;
		word32 t0_104;
		word32 t1_105;
		word32 t5_106;
		word32 t6_107;
		(a5_72 | 1)();
	}
}

