pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304C9CE: void __uart_tx_irq(Register Eq_2 ra, Register word32 s0, Register (ptr32 Eq_154569) a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack word32 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack word32 dwArgF8)
void __uart_tx_irq(Eq_2 ra, word32 s0, struct Eq_154569 * a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, word32 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg4C, word32 dwArgF8)
{
	Eq_2 a3_20;
	word32 a5_22;
	Eq_2 s2_27;
	ptr32 mstatus_41;
	word32 a0_40;
	byte * s0_25;
	Eq_2 a4_21;
	Eq_2 ra_42 = xStreamBufferReceiveFromISR(ra, a0, a0->dw0014, fp + -21, 0x01, a4, a5, mstatus, s0, dwArg24, dwArgF8, out s0_25, out a0_40, out a3_20, out a4_21, out a5_22, out s2_27, out mstatus_41);
	if (a5_22 != 0x00)
	{
		word32 a5_152;
		s0_25 = vTaskSwitchContext(ra_42, a3_20, s2_27, mstatus_41, dwArg00, dwArg04, dwArg28, dwArg4C, out a0_40, out a4_21, out a5_152);
	}
	if (a0_40 == 0x01)
		hal_uart_send(s0_25, fp + -21, 0x01, dwArg08);
	else
		hal_uart_send_trigger_off(a4_21);
}

// 2304CA16: void vfs_uart_close(Register Eq_2 ra, Register (ptr32 Eq_170399) s0, Register word32 a0, Register (ptr32 Eq_253614) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void vfs_uart_close(Eq_2 ra, struct Eq_170399 * s0, word32 a0, struct Eq_253614 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a0 == 0x00 || a5 == null)
		return;
	Eq_2 a3_8 = (word32) a5->b0011;
	if (a3_8 != 0x01)
		return;
	if (s0 == null)
		return;
	Eq_2 a0_23;
	Eq_2 a2_25;
	Eq_2 a4_27;
	word32 a5_182;
	aos_mutex_free((char *) s0 + 32, a3_8, 0x01, mstatus, dwArg0148, dwArg0188, out a0_23, out a2_25, out a4_27, out a5_182);
	Eq_2 a0_36;
	Eq_2 a2_38;
	Eq_2 a4_40;
	Eq_2 a4_56;
	Eq_2 s1_64;
	word32 a2_185;
	word32 a0_184;
	word32 s1_183;
	Eq_2 ra_58 = vStreamBufferDelete(vStreamBufferDelete(ra, a0_23, a2_25, a4_27, mstatus, dwArg14, dwArg0148, dwArg0188, out s1_183, out a0_36, out a2_38, out a4_40), a0_36, a2_38, a4_40, mstatus, dwArg14, dwArg0148, dwArg0188, out s1_64, out a0_184, out a2_185, out a4_56);
	hal_uart_finalize(ra_58, s0, s1_64, a4_56, s2, dwArg20, dwArg24, dwArg30, dwArg34, dwArg58, dwArg6C, dwArg7C);
}

// 2304CA62: void vfs_uart_read(Register Eq_2 ra, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg74, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void vfs_uart_read(Eq_2 ra, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg74, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (a0 != 0x00 && a5 != 0x00)
	{
		int32 s3_23 = *((word32) a5 + 4);
		if (a2 != 0x00 && s3_23 != 0x00)
		{
			word32 a3_226;
			word32 a0_225;
			word32 s1_224;
			struct Eq_253712 * s3_44;
			Eq_2 s2_43;
			word32 s4_45;
			Eq_2 a4_38;
			Eq_2 a5_39;
			aos_mutex_lock(s3_23 + 32, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_224, out a0_225, out a3_226, out a4_38, out a5_39, out s2_43, out s3_44, out s4_45);
			Eq_2 s0_50 = 0x00;
			Eq_2 s1_53 = 0x00 - (word32) ((word32) s3_44->t0034 < ~0x01);
			do
			{
				word32 a0_69;
				word32 s0_77;
				Eq_2 s5_82;
				word32 s8_229;
				word32 a1_227;
				word32 a2_228;
				ra = xStreamBufferReceive(ra, s0_50, s3_44->ptr0010, (word32) s0_50 + s4_45, s2_43 - s0_50, s1_53, a4_38, a5_39, mstatus, s2, dwArg08, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArg0108, dwArg0148, out s0_77, out s1_53, out a0_69, out a1_227, out a2_228, out a4_38, out a5_39, out s2_43, out s3_44, out s4_45, out s5_82, out s8_229, out mstatus);
				s0_50 = s0_77 + a0_69;
			} while (s0_50 != s2_43 && s1_53 != 0x00);
			aos_mutex_unlock(s5_82, a4_38, a5_39, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
		}
	}
}

// 2304CADA: void vfs_uart_write(Register Eq_2 ra, Register word32 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register (ptr32 Eq_2) a5, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void vfs_uart_write(Eq_2 ra, word32 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, union Eq_2 * a5, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg94, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	if (a0 != 0x00)
	{
		Eq_2 a0_13 = *a5;
		if (a5 != null && s1 != 0x00)
		{
			Eq_2 a4_27;
			int32 a0_44;
			word32 s1_111;
			word32 a1_112;
			word32 a3_113;
			word32 s3_114;
			word32 mstatus_115;
			xStreamBufferSend(ra, a0_13, a1, a2, 0x00, a4, s2, s4, mstatus, dwArg08, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArg0108, dwArg0148, out s1_111, out a0_44, out a1_112, out a3_113, out a4_27, out s3_114, out mstatus_115);
			if (a0_44 > 0x00)
				hal_uart_send_trigger(a4_27);
		}
	}
}

// 2304CB10: void vfs_uart_poll(Register (ptr32 Eq_253854) s0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void vfs_uart_poll(struct Eq_253854 * s0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a5_61;
	Eq_2 a4_55;
	word32 a0_33;
	Eq_2 a3_36;
	Eq_2 a4_37;
	<anonymous> * s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 a5_158;
	Eq_2 s1_41;
	struct Eq_172018 * s0_40 = aos_mutex_lock((char *) &s0->t0004 + 28, ~0x00, a2, a3, a4, s0->t0004, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_41, out a0_33, out a3_36, out a4_37, out a5_158, out s2_42, out s3_43, out s4_44);
	if (a1 == 0x00)
	{
		word32 a5_160;
		vTaskEnterCritical(a4_37, mstatus, out a5_160);
		s0_40->ptr0024 = null;
		s0_40->dw002C = 0x00;
		vTaskExitCritical(a3_36, mstatus, out a4_55, out a5_61);
	}
	else
	{
		word32 a5_159;
		vTaskEnterCritical(a4_37, mstatus, out a5_159);
		s0_40->ptr0024 = s2_42;
		s0_40->dw0028 = s3_43;
		s0_40->dw002C = s4_44;
		struct Eq_154728 ** a5_53;
		Eq_2 a3_54 = vTaskExitCritical(a3_36, mstatus, out a4_55, out a5_53);
		a5_61.u0 = 0x01;
		word32 a2_58;
		if (xStreamBufferIsEmpty(a0_33, a4_55, a5_53, mstatus, out a2_58) != 0x01)
		{
			ui32 a5_65 = (word32) *((word32) a4_55 + 6);
			*((word32) a4_55 + 6) = (word16) (a5_65 | 1);
			s2_42();
		}
	}
	aos_mutex_unlock(s1_41, a4_55, a5_61, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
}

