pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304CB9C: void vfs_uart_sync(Register (ptr32 Eq_253950) s0, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void vfs_uart_sync(struct Eq_253950 * s0, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if (a0 == 0x00)
		return;
	if (a5 == 0x00)
		return;
	Eq_2 a5_16 = s0->t0004;
	if (s0 != null)
	{
		Eq_2 a4_28;
		Eq_2 a5_43;
		word32 s1_150;
		word32 a0_151;
		word32 a3_152;
		word32 a5_153;
		word32 s2_154;
		word32 s3_155;
		word32 s4_156;
		aos_mutex_unlock(hal_uart_send_flush(aos_mutex_lock((char *) &s0->t0004 + 28, ~0x00, a2, a3, a4, a5_16, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_150, out a0_151, out a3_152, out a4_28, out a5_153, out s2_154, out s3_155, out s4_156), out a5_43), a4_28, a5_43, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178);
	}
}

// 2304CBDC: void uart_ioctl_cmd_waimode(Register Eq_2 ra, Register (ptr32 Eq_254001) a0, Register word32 a1, Register (ptr32 Eq_254003) a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
void uart_ioctl_cmd_waimode(Eq_2 ra, struct Eq_254001 * a0, word32 a1, struct Eq_254003 * a2, Eq_2 a4, Eq_2 a5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg84, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, Eq_2 dwArg0138)
{
	if (a2 != null)
	{
		Eq_2 s6_28 = a2->t0004;
		struct Eq_254001 * s4_34 = a0;
		Eq_2 s0_35 = 0x00;
		Eq_2 s3_38 = (word32) a2->t0008 + 1000 >> 1000;
		do
		{
			word32 a0_55;
			word32 s0_63;
			Eq_254033 s2_65;
			word32 s5_68;
			word32 s8_69;
			word32 a2_177;
			word32 s1_176;
			ra = xStreamBufferReceive(ra, s0_35, s4_34->ptr0010, (word32) s0_35 + a1, s6_28 - s0_35, s3_38, a4, a5, mstatus, s6, dwLoc08, dwArg84, dwArgA0, dwArgA4, dwArgC8, dwArgF8, dwArg0138, out s0_63, out s1_176, out a0_55, out a1, out a2_177, out a4, out a5, out s2_65, out s3_38, out s4_34, out s5_68, out s8_69, out mstatus);
			s0_35 = s0_63 + a0_55;
		} while (s6_28 != s0_35 && (s2_65 > 999 && (s5_68 != s8_69 || s0_35 <= 0x00)));
	}
	0x00 = dwArg0128;
}

// 2304CC56: void uart_ioctl_cmd_setconfig(Register (ptr32 byte) a0, Register (ptr32 Eq_254069) a1)
void uart_ioctl_cmd_setconfig(byte * a0, struct Eq_254069 * a1)
{
	if (a1 == null)
		return;
	word32 a2_8 = (word32) a1->b0004;
	hal_uart_setconfig(a0);
}

// 2304CC80: void vfs_uart_ioctl(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_254086) s1, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0158)
void vfs_uart_ioctl(Eq_2 ra, Eq_2 s0, struct Eq_254086 * s1, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, word32 a5, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0158)
{
	if (a0 != 0x00 && a5 != 0x00)
	{
		Eq_2 a5_19 = s1->t0004;
		if (s1 != null)
		{
			up32 s2_39;
			Eq_2 s3_40;
			word32 s1_134;
			word32 a0_135;
			word32 a3_136;
			word32 a4_137;
			word32 a5_138;
			word32 s4_139;
			aos_mutex_lock((char *) &s1->t0004 + 28, ~0x00, a2, a3, a4, a5_19, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_134, out a0_135, out a3_136, out a4_137, out a5_138, out s2_39, out s3_40, out s4_139);
			if (s2_39 <= ~0x07)
				;
			aos_mutex_unlock(s3_40, 0x06, s2_39 + -2, mstatus, s0, ra, dwArgD8, dwArg0118, dwArg0158);
		}
	}
	0x00 = dwArg0128;
}

// 2304CD0E: Register word32 get_context(Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 word32) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      aos_loop_set_eventfd
//      aos_poll_read_fd
//      aos_post_delayed_action
//      aos_loop_run
word32 get_context(Eq_2 a0, Eq_2 a1, word32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 s1_21 = *a0;
	ptr32 a4_15;
	ptr32 a3_17;
	ptr32 a5_16;
	word32 * a0_13 = aos_task_getspecific(a0, out a3_17, out a4_15, out a5_16);
	if (a0_13 == null)
	{
		s1_21 = *a0_13;
		aos_task_setspecific(a0_13, a1, out a0_13, out a3_17, out a4_15, out a5_16);
	}
	a0Out = a0_13;
	a3Out = a3_17;
	a4Out = a4_15;
	a5Out = a5_16;
	return s1_21;
}

// 2304CD3E: void aos_loop_set_eventfd(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      aos_event_service_init
void aos_loop_set_eventfd(Eq_2 a0, Eq_2 a1)
{
	word32 a0_11;
	word32 a3_27;
	word32 a4_28;
	word32 a5_29;
	get_context(a0, a1, out a0_11, out a3_27, out a4_28, out a5_29);
	*((word32) a0 + 16) = a0_11;
}

// 2304CD54: Register Eq_2 aos_loop_init(Register Eq_2 ra, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
Eq_2 aos_loop_init(Eq_2 ra, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 ra_132;
	ptr32 s2_136;
	word32 a5_286;
	Eq_2 a4_19;
	Eq_2 a3_21;
	word32 * a0_17 = aos_task_getspecific(g_t4200DFE8, out a3_21, out a4_19, out a5_286);
	Eq_2 a5_22 = g_t4200DFEC;
	if (a5_22 == 0x00)
		a3_21 = aos_task_key_create(0x4200DFE8, out a4_19, out a5_22);
	else if (a0_17 != null)
	{
		word32 s9_315;
		word32 s10_316;
		word32 s11_317;
		word32 t4_318;
		word32 s8_314;
		word32 s5_311;
		word32 s6_312;
		word32 s7_313;
		word32 a7_308;
		word32 s3_309;
		word32 s4_310;
		word32 a3_305;
		word32 a4_306;
		word32 a5_307;
		word32 a0_302;
		word32 a1_303;
		word32 a2_304;
		word32 s1_301;
		ra_132 = printf(ra, &g_t23087958, a3_21, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_136, out s3_309, out s4_310, out s5_311, out s6_312, out s7_313, out s8_314, out s9_315, out s10_316, out s11_317, out t4_318);
		goto l2304CDC0;
	}
	Eq_2 a0_66;
	Eq_2 s2_75;
	word32 ** s3_76;
	word32 s4_299;
	word32 s8_300;
	word32 a4_297;
	word32 a6_298;
	word32 a1_294;
	word32 a2_295;
	word32 a3_296;
	word32 s1_293;
	union Eq_2 * a5_71;
	pvPortMalloc(ra, 0x4200DFEC, 0x1C, a3_21, a4_19, a5_22, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_293, out a0_66, out a1_294, out a2_295, out a3_296, out a4_297, out a5_71, out a6_298, out s2_75, out s3_76, out s4_299, out s8_300);
	if (a0_66 != 0x00)
	{
		word32 a3_291;
		word32 a4_292;
		word32 a0_288;
		word32 a1_289;
		word32 a2_290;
		word32 t1_287;
		ra = memset(ra, a0_66, 0x00, 0x1C, out t1_287, out a0_288, out a1_289, out a2_290, out a3_291, out a4_292, out a5_71);
	}
	Eq_2 s1_95 = *a5_71;
	if (a5_71 == null)
		*a0_66 = s1_95;
	*a0_66 = a0_66;
	word32 * a0_102 = *s3_76;
	*(union Eq_2 *) 0x0F = a0_66;
	*((word32) a0_66 + 4) = a0_66;
	word32 a0_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	ra_132 = aos_event_service_init(ra, aos_task_setspecific(a0_102, a0_66, out a0_319, out a3_320, out a4_321, out a5_322), s2_75, mstatus, dwLoc20, dwLoc1C, dwArg10, dwArg14, dwArg38, dwArg58, dwArg5C, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0148, out s2_136, out mstatus);
l2304CDC0:
	s2Out = s2_136;
	mstatusOut = mstatus;
	return ra_132;
}

// 2304CDD0: Register Eq_2 aos_poll_read_fd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      aos_loop_proc
//      aos_event_service_init
Eq_2 aos_poll_read_fd(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s2_182 = a0;
	struct Eq_254370 * a0_30;
	Eq_2 a5_161;
	Eq_2 a3_146;
	Eq_2 a4_147;
	Eq_2 s1_35 = get_context(a0, a1, out a0_30, out a3_146, out a4_147, out a5_161);
	if (a0 >= 0x00)
	{
		ui32 s5_40 = (word32) a0_30->b0016;
		Eq_2 a0_47;
		Eq_2 a3_50;
		Eq_2 a4_51;
		Eq_2 a5_52;
		ui32 s4_58;
		word32 s1_326;
		word32 a1_327;
		word32 a2_328;
		word32 a6_329;
		word32 s2_330;
		word32 s3_331;
		word32 s8_332;
		pvPortMalloc(ra, s1_35, s5_40 + 0x0D, a3_146, a4_147, a5_161, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_326, out a0_47, out a1_327, out a2_328, out a3_50, out a4_51, out a5_52, out a6_329, out s2_330, out s3_331, out s4_58, out s8_332);
		word32 a0_64;
		Eq_2 a3_67;
		Eq_2 s1_72;
		word32 s8_76;
		word32 a1_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 a6_337;
		word32 s3_338;
		word32 s4_339;
		Eq_2 s0_71 = pvPortMalloc(ra, a0_47, s4_58 << 0x03, a3_50, a4_51, a5_52, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_72, out a0_64, out a1_333, out a2_334, out a3_67, out a4_335, out a5_336, out a6_337, out s2_182, out s3_338, out s4_339, out s8_76);
		if (s1_72 != 0x00 && a0_64 != 0x00)
		{
			aos_fcntl(s2_182);
			aos_fcntl(s2_182);
			*((word32) *(union Eq_2 *) 0x10 + 22) = (byte) ((word32) *((word32) s0_71 + 22) + 0x01);
			Eq_2 a5_101;
			Eq_2 a2_104;
			word32 a1_370;
			word32 a3_371;
			word32 a4_372;
			word32 a6_373;
			word32 a7_374;
			memcpy(s1_72, 0x04, s5_40 + s8_76, out a1_370, out a2_104, out a3_371, out a4_372, out a5_101, out a6_373, out a7_374);
			struct Eq_254569 * s1_118;
			Eq_2 a1_121;
			Eq_2 s4_124;
			word32 s0_375;
			word32 a0_376;
			word32 a2_377;
			word32 a3_378;
			word32 a4_379;
			word32 a5_380;
			word32 a6_381;
			word32 t3_382;
			vPortFree(s1_72, a2_104, a5_101, mstatus, dwArg0128, dwArg0168, out s0_375, out s1_118, out a0_376, out a1_121, out a2_377, out a3_378, out a4_379, out a5_380, out a6_381, out s4_124, out t3_382);
			s1_118->dw000C = (word32) *((word32) a1_121 + 8);
			Eq_2 a5_131;
			Eq_2 a2_134;
			word32 a1_383;
			word32 a3_384;
			word32 a4_385;
			word32 a6_386;
			word32 a7_387;
			memcpy(s4_124, a1_121, s5_40 << 0x03, out a1_383, out a2_134, out a3_384, out a4_385, out a5_131, out a6_386, out a7_387);
			struct Eq_254617 * s1_149;
			struct Eq_254618 * s0_154;
			word32 s4_155;
			word32 a0_388;
			word32 a2_389;
			word32 a5_390;
			word32 a6_391;
			word32 t3_392;
			vPortFree(s4_124, a2_134, a5_131, mstatus, dwArg0128, dwArg0168, out s0_154, out s1_149, out a0_388, out a1, out a2_389, out a3_146, out a4_147, out a5_390, out a6_391, out s4_155, out t3_392);
			s0_154->dw0008 = s4_155;
			s1_149->t0000 = s2_182;
			s1_149->dw0004 = a2;
			s1_149->t0008 = a1;
			a5_161 = (word32) s0_154->w0014;
			if (a5_161 < s2_182)
				s0_154->w0014 = (word16) s2_182;
		}
		else
		{
			Eq_2 a5_171;
			Eq_2 a2_174;
			Eq_2 s1_179;
			word32 a0_340;
			word32 a1_341;
			word32 a3_342;
			word32 a4_343;
			word32 a7_344;
			word32 s3_345;
			word32 s4_346;
			word32 s5_347;
			word32 s6_348;
			word32 s7_349;
			word32 s8_350;
			word32 s9_351;
			word32 s10_352;
			word32 s11_353;
			word32 t4_354;
			ra = printf(ra, &g_t23087984, a3_67, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_179, out a0_340, out a1_341, out a2_174, out a3_342, out a4_343, out a5_171, out a7_344, out s2_182, out s3_345, out s4_346, out s5_347, out s6_348, out s7_349, out s8_350, out s9_351, out s10_352, out s11_353, out t4_354);
			Eq_2 a2_194;
			Eq_2 a5_197;
			Eq_2 s4_204;
			word32 s0_355;
			word32 s1_356;
			word32 a0_357;
			word32 a1_358;
			word32 a3_359;
			word32 a4_360;
			word32 a6_361;
			word32 t3_362;
			vPortFree(s1_179, a2_174, a5_171, mstatus, dwArg0128, dwArg0168, out s0_355, out s1_356, out a0_357, out a1_358, out a2_194, out a3_359, out a4_360, out a5_197, out a6_361, out s4_204, out t3_362);
			word32 s0_363;
			word32 s1_364;
			word32 a0_365;
			word32 a2_366;
			word32 a6_367;
			word32 s4_368;
			word32 t3_369;
			vPortFree(s4_204, a2_194, a5_197, mstatus, dwArg0128, dwArg0168, out s0_363, out s1_364, out a0_365, out a1, out a2_366, out a3_146, out a4_147, out a5_161, out a6_367, out s4_368, out t3_369);
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = s4;
	a1Out = a1;
	a3Out = a3_146;
	a4Out = a4_147;
	a5Out = a5_161;
	s2Out = s2_182;
	return ra;
}

// 2304CEB6: void aos_post_delayed_action(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      event_cb_wifi_event_mgmr
//      trigger_auto_denoise
void aos_post_delayed_action(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a1 == 0x00)
		return;
	Eq_2 a3_25;
	Eq_2 a4_26;
	Eq_2 a5_27;
	word32 a0_35;
	Eq_2 a3_38;
	Eq_2 s1_43;
	word32 s2_44;
	word32 s3_45;
	struct Eq_254671 * s4_46;
	word32 a5_198;
	word32 a6_199;
	word32 s8_200;
	word32 a0_194;
	word32 a1_195;
	word32 a2_196;
	word32 a4_197;
	pvPortMalloc(ra, get_context(a0, a1, out a0_194, out a3_25, out a4_26, out a5_27), 32, a3_25, a4_26, a5_27, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_43, out a0_35, out a1_195, out a2_196, out a3_38, out a4_197, out a5_198, out a6_199, out s2_44, out s3_45, out s4_46, out s8_200);
	if (a0_35 != 0x00)
	{
		Eq_2 a0_60 = (word32) s1_43 + a0_52;
		word32 a0_52;
		word32 a1_53;
		word32 a4_202;
		word32 a5_203;
		word32 a2_201;
		Eq_2 s0_57 = aos_now_ms(a3_38, out a0_52, out a1_53, out a2_201, out a4_202, out a5_203);
		*((word32) a0_60 + 8) = s0_57;
		Eq_2 a4_63 = (word32) (a0_60 < s1_43) + (a1_53 + (s1_43 >> 0x1F));
		*((word32) a4_63 + 0x0C) = s0_57;
		*((word32) s0_57 + 16) = s3_45;
		*((word32) s0_57 + 20) = s2_44;
		*((word32) s1_43 + 24) = s0_57;
		struct Eq_254671 * a5_69 = s4_46->ptr0004;
		while (a5_69 != s4_46)
		{
			struct Eq_254759 * a5_74 = *((word32) a3_38 + 0x0C);
			if (a4_63 < a3_38)
				break;
			if (a3_38 == a4_63)
			{
				a5_74 = (struct Eq_254759 *) *((word32) a3_38 + 8);
				if (a0_60 < a3_38)
					break;
			}
			a5_69 = a5_74->ptr0004;
		}
		Eq_2 a5_83 = *a4_63;
		*((word32) a5_83 + 4) = s0_57;
		*a4_63 = s0_57;
		*((word32) s0_57 + 4) = a4_63;
		*s0_57 = a5_83;
	}
}

// 2304CF3A: Register Eq_2 aos_loop_run(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_proc
Eq_2 aos_loop_run(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & mstatusOut)
{
	word32 a5_693;
	Eq_2 a3_107;
	Eq_2 a4_108;
	Eq_2 a0_127;
	Eq_2 s1_176 = get_context(a0, a1, out a0_127, out a3_107, out a4_108, out a5_693);
	Eq_2 s0_130 = a0_127;
	word32 s3_116 = 0x0C;
	word32 s4_117 = 0x01;
	while ((word32) *((word32) s0_130 + 24) == 0x00)
	{
		s0_130 = *((word32) s1_176 + 4);
		Eq_2 s2_40 = (word32) *((word32) s0_130 + 22);
		if (s0_130 == s1_176 && s2_40 == 0x00)
			break;
		if (s0_130 != s1_176)
		{
			int32 a1_47;
			Eq_2 a2_48;
			int32 a5_50;
			aos_now_ms(a3_107, out a0_127, out a1_47, out a2_48, out a4_108, out a5_50);
			if (a1_47 >= a5_50 && (a5_50 != a1_47 || a0_127 >= a2_48))
				;
		}
		Eq_2 a5_60 = 0x00;
		while (a5_60 < s2_40)
		{
			Eq_254822 a1_70 = a5_60 << 0x03;
			union Eq_2 * a4_67 = (word32) a5_60 + s3_116;
			a0_127 += a1_70;
			a3_107 = *a4_67;
			*a4_67 = (union Eq_2 *) a0_127;
			a4_108 = a4_67 + a1_70;
			*((word32) a4_108 + 4) = (word16) s4_117;
			a5_60 = (word32) a5_60 + 1;
		}
		Eq_2 a0_104;
		Eq_2 s1_114;
		Eq_2 s2_115;
		Eq_2 a5_109;
		Eq_2 a1_105;
		Eq_2 s5_118;
		ra = aos_poll(ra, a0_127, a3_107, a4_108, a5_60, mstatus, dwArg88, dwArgC8, dwArgF8, dwArg0138, dwArg0178, out s1_114, out a0_104, out a1_105, out a3_107, out a4_108, out a5_109, out s2_115, out s3_116, out s4_117, out s5_118, out mstatus);
		Eq_2 s6_124 = a0_104;
		a0_127 = a0_104;
		if (a0_104 < 0x00)
		{
			__errno(out a5_109);
			a0_127 = *a5_109;
			if (a5_109 != s5_118)
			{
				0x00 = (uint16) dwArgA8;
				Eq_2 a3_240;
				word32 a1_696;
				word32 s7_706;
				word32 a7_700;
				word32 s10_709;
				word32 t4_711;
				word32 s11_710;
				word32 s8_707;
				word32 s9_708;
				word32 s4_703;
				word32 s6_705;
				word32 s5_704;
				word32 s2_701;
				word32 s3_702;
				word32 a5_699;
				word32 a2_697;
				word32 a4_698;
				word32 a0_695;
				word32 s1_694;
				printf(ra, &g_t23087974, a3_107, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_694, out a0_695, out a1_696, out a2_697, out a3_240, out a4_698, out a5_699, out a7_700, out s2_701, out s3_702, out s4_703, out s5_704, out s6_705, out s7_706, out s8_707, out s9_708, out s10_709, out s11_710, out t4_711);
				mstatusOut = mstatus;
				return a3_240;
			}
		}
		s0_130 = *((word32) s1_114 + 4);
		if (s0_130 != s1_114)
		{
			word32 a2_712;
			s0_130 = aos_now_ms(a3_107, out a0_127, out a1_105, out a2_712, out a4_108, out a5_109);
			if (a1_105 >= a5_109 && (a5_109 != a1_105 || a0_127 >= a5_109))
			{
				*((word32) a5_109 + 4) = a4_108;
				*a4_108 = a5_109;
				Eq_2 a2_154;
				Eq_2 a5_156;
				a5_109();
				word32 a6_715;
				word32 t3_716;
				word32 s1_713;
				word32 a2_714;
				vPortFree(*((word32) a5_109 + 20), a2_154, a5_156, mstatus, dwArg0138, dwArg0178, out s0_130, out s1_713, out a0_127, out a1_105, out a2_714, out a3_107, out a4_108, out a5_109, out a6_715, out s4_117, out t3_716);
			}
		}
		s1_176.u0 = 0x00;
		if (a0_104 > 0x00)
		{
			while (s1_176 != s2_115)
			{
				ptr32 mstatus_221;
				a4_108 = s1_176 << 0x03;
				word32 a5_187 = CONVERT(Mem271[a5_109 + a4_108 + 6:uint16], uint16, word32);
				s0_130 = *((word32) a5_109 + 8);
				a5_109 = a5_187 & 0x01;
				if ((a5_187 & 0x01) != 0x00)
				{
					word32 s7_222;
					word32 t0_351;
					word32 t4_352;
					word32 s9_350;
					word32 s11_349;
					word32 s10_348;
					word32 a7_347;
					a4_108();
					mstatus = mstatus_221;
				}
				s1_176 = (word16) s1_176.u0 + 1;
			}
		}
	}
	((word32) s0_130 + 24)->u1 = 0x00;
	0x00 = (uint16) dwArgA8;
	mstatusOut = mstatus;
	return a3_107;
}

// 2304D054: void vfs_poll_notify(Register Eq_2 ra, Register (ptr32 Eq_2) a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void vfs_poll_notify(Eq_2 ra, union Eq_2 * a1, Eq_2 a2, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	aos_sem_signal(ra, a1, a2, a4, s2, mstatus, dwArg04, dwArg10, dwArg14, dwArg38, dwArg5C, dwArg84, dwArgF8, dwArg0138, dwArg0178);
}

