pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304D058: Register Eq_2 aos_poll(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_254864) a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_run
Eq_2 aos_poll(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, struct Eq_254864 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_255050 * sp_282 = fp + -64;
	Eq_2 s0_284 = a0;
	Eq_2 s3_100;
	Eq_2 s2_159;
	Eq_2 a2_107 = aos_sem_new(ra, a0, 0x00, a3, a4, a5, mstatus, dwArgA8, dwArgE8, out s2_159, out s3_100);
	int32 a5_48;
	for (a5_48 = 0x00; a5_48 != 0x08; ++a5_48)
	{
		Eq_2 a3_110 = fp + -56 + a5_48;
		a3_110->u1 = 0x00;
	}
	word32 s1_102 = (word32) a0 + 6;
	Eq_2 a4_109 = (word32) a0 + 6;
	Eq_2 a5_108 = 0x00;
	while (a5_108 < s2_159)
	{
		*a4_109 = 0x00;
		a5_108 = (word32) a5_108 + 1;
		a4_109 = (word32) a4_109 + 8;
	}
	Eq_2 s6_105 = a0;
	Eq_2 s7_106 = 0x00;
	Eq_2 s4_103 = 0x01;
	word32 s5_104 = 0x2304D000;
	while (true)
	{
		word32 s4_188;
		Eq_2 a0_150;
		if (s7_106 >= s2_159)
			break;
		Eq_2 a0_76 = *s6_105;
		if (s4_103 >= a0_76)
		{
			a5_108 = (char *) sp_282 + 16 + ((a0_76 >> 0x05) << 2);
			a4_109 = *((word32) a5_108 - 8);
			*((word32) a5_108 + 0x0FF8) = s4_103 << a0_76 | a4_109;
		}
		else
		{
			struct Eq_255285 ** a5_79;
			a0_150 = get_file(a0_76, out a5_79);
			if (a0_150 == 0x00)
			{
				s4_188 = ~0x00;
				goto l2304D130;
			}
			<anonymous> * a5_89 = *((char *) *a5_79 + 20);
			a5_89();
		}
		s7_106 = (word32) s7_106 + 1;
		s6_105 = (word32) s6_105 + 8;
	}
	Eq_2 a1_128 = s3_100;
	if (s3_100 < 0x00)
		a1_128.u0 = ~0x00;
	struct Eq_255119 * s1_158 = aos_sem_wait((char *) sp_282 + 4, a1_128, a2_107, a3_110, a4_109, a5_108, mstatus, sp_282->t0014, sp_282->t0094, sp_282->t0108, sp_282->t0148, out a0_150, out a4_109, out s2_159);
	a3_110.u0 = 0x00;
	while (a3_110 < s2_159)
	{
		Eq_255181 a5_171 = s1_158->dwFFFFFFFA;
		a4_109 = ((char *) sp_282 + 16 + ((a5_171 >> 0x05) << 2))[-8];
		if ((0x01 << a5_171 & a4_109) != 0x00)
			s1_158->w0000 = (word16) ((word32) s1_158->w0000 | 1);
		a3_110 = (word16) a3_110.u0 + 1;
		++s1_158;
	}
	s4_188 = 0x00;
l2304D130:
	word32 s1_189 = 0x00;
	Eq_2 s3_190 = 0x00;
	Eq_2 s5_191 = 0x01;
	while (s3_190 < s2_159)
	{
		word32 s0_196 = *a0_150;
		if (s5_191 < a0_150)
		{
			struct Eq_255252 ** a5_199;
			a0_150 = get_file(a0_150, out a5_199);
			if (a0_150 != 0x00)
			{
				<anonymous> * a5_206 = *((char *) *a5_199 + 20);
				struct Eq_255256 * s0_215;
				a5_206();
				if ((int32) s0_215->w0006 != 0x00)
					++s1_189;
			}
		}
		s3_190 = (word32) s3_190 + 1;
	}
	ptr32 a1_251;
	ptr32 a3_253;
	struct Eq_254864 * a4_254;
	ptr32 a5_255;
	word32 s4_259;
	ptr32 s1_258 = aos_sem_free(fp - 60, a3_110, a4_109, mstatus, dwArg0118, dwArg0158, out a1_251, out a3_253, out a4_254, out a5_255, out s4_259);
	if (s4_259 != 0x00)
		s1_258 = 0x00;
	0x00 = (uint16) dwArg0198;
	s1Out = s1_258;
	a0Out = s1_258;
	a1Out = a1_251;
	a3Out = a3_253;
	a4Out = a4_254;
	a5Out = a5_255;
	s2Out = s2_159;
	s3Out = s3_190;
	s4Out = dwArgF4;
	s5Out = s5_191;
	mstatusOut = mstatus;
	return ra;
}

// 2304D18A: void aos_fcntl(Register Eq_2 a0)
// Called from:
//      aos_poll_read_fd
void aos_fcntl(Eq_2 a0)
{
}

// 2304D19E: void dfl_entry(Register (ptr32 Eq_255300) s0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void dfl_entry(struct Eq_255300 * s0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	word32 a2_15;
	word32 a5_18;
	word32 s1_19;
	<anonymous> * s0_24;
	word32 a0_66;
	word32 a1_67;
	word32 a3_68;
	word32 a4_69;
	word32 a6_70;
	word32 s4_71;
	word32 t3_72;
	vPortFree(s0->t0004, a2, a5, mstatus, dwArg0148, dwArg0188, out s0_24, out s1_19, out a0_66, out a1_67, out a2_15, out a3_68, out a4_69, out a5_18, out a6_70, out s4_71, out t3_72);
	Eq_2 a3_29;
	Eq_2 a4_30;
	Eq_2 a5_31;
	s0_24();
	vTaskDelete(0x00, dwArg10, a3_29, a4_30, a5_31, mstatus);
}

// 2304D1C0: void aos_task_new(Register Eq_2 ra, Register Eq_2 s1, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
// Called from:
//      ota_cmd
//      tcpclient_cmd
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
void aos_task_new(Eq_2 ra, Eq_2 s1, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	Eq_2 a3_35;
	Eq_2 a4_36;
	Eq_2 a5_37;
	Eq_2 s1_40;
	word32 s8_259;
	word32 s4_258;
	word32 s3_257;
	word32 s2_256;
	word32 a6_255;
	word32 a2_254;
	word32 a1_253;
	word32 a0_252;
	pvPortMalloc(ra, s1, 0x009C, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_40, out a0_252, out a1_253, out a2_254, out a3_35, out a4_36, out a5_37, out a6_255, out s2_256, out s3_257, out s4_258, out s8_259);
	Eq_2 a0_49;
	Eq_2 a3_52;
	Eq_2 a4_53;
	Eq_2 a5_54;
	Eq_2 s3_59;
	word32 s1_260;
	word32 a1_261;
	word32 a2_262;
	word32 a6_263;
	word32 s2_264;
	word32 s4_265;
	word32 s8_266;
	pvPortMalloc(ra, s1_40, 0x0C, a3_35, a4_36, a5_37, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_260, out a0_49, out a1_261, out a2_262, out a3_52, out a4_53, out a5_54, out a6_263, out s2_264, out s3_59, out s4_265, out s8_266);
	Eq_2 a0_66;
	Eq_2 s1_74;
	Eq_2 s3_76;
	Eq_2 s4_77;
	word32 a1_267;
	word32 a2_268;
	word32 a3_269;
	word32 a4_270;
	word32 a5_271;
	word32 a6_272;
	word32 s2_273;
	word32 s8_274;
	Eq_2 s0_73 = pvPortMalloc(ra, a0_49, s3_59, a3_52, a4_53, a5_54, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_74, out a0_66, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271, out a6_272, out s2_273, out s3_76, out s4_77, out s8_274);
	word32 t1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a3_279;
	word32 a4_280;
	word32 a5_281;
	word32 t1_282;
	word32 a0_283;
	word32 a1_284;
	word32 a2_285;
	word32 a3_286;
	word32 a4_287;
	word32 a5_288;
	Eq_2 ra_102 = memset(memset(ra, a0_66, 0x00, s3_76, out t1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281), s0_73, 0x00, 0x009C, out t1_282, out a0_283, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288);
	*(union Eq_2 *) 0x50 = s0_73;
	*((word32) s0_73 + 116) = a0_66;
	word32 a3_289;
	word32 a4_290;
	word32 a5_291;
	strncpy((word32) s0_73 + 0x0078, s4_77, 0x1F, out a3_289, out a4_290, out a5_291);
	*((word32) s0_73 + 0x0098) = 0x20171020;
	*s0_73 = s1_74;
	*((word32) s1_74 + 4) = a1;
	*((word32) s1_74 + 8) = a2;
	word32 a0_134;
	Eq_2 a2_135;
	Eq_2 a5_136;
	Eq_2 s0_138;
	Eq_2 s2_148;
	word32 tp_292;
	word32 t0_293;
	word32 a3_294;
	word32 a4_295;
	xTaskCreateStatic(ra_102, &g_ptr2304D19E, s4_77, s3_76 >> 0x02, s1_74, 0x0A, a0_66, s0_73, mstatus, s4, dwArg04, dwArgC8, dwArg0194, out tp_292, out t0_293, out s0_138, out a0_134, out a2_135, out a3_294, out a4_295, out a5_136, out s2_148);
	if (a0_134 == 0x00)
	{
		Eq_2 a2_158;
		Eq_2 a5_161;
		word32 s0_296;
		word32 s1_297;
		word32 a0_298;
		word32 a1_299;
		word32 a3_300;
		word32 a4_301;
		word32 a6_302;
		word32 s4_303;
		word32 t3_304;
		vPortFree(s0_138, a2_135, a5_136, mstatus, dwArg0138, dwArg0178, out s0_296, out s1_297, out a0_298, out a1_299, out a2_158, out a3_300, out a4_301, out a5_161, out a6_302, out s4_303, out t3_304);
		Eq_2 a2_171;
		Eq_2 a5_174;
		Eq_2 s1_175;
		word32 s0_305;
		word32 a0_306;
		word32 a1_307;
		word32 a3_308;
		word32 a4_309;
		word32 a6_310;
		word32 s4_311;
		word32 t3_312;
		vPortFree(s2_148, a2_158, a5_161, mstatus, dwArg0138, dwArg0178, out s0_305, out s1_175, out a0_306, out a1_307, out a2_171, out a3_308, out a4_309, out a5_174, out a6_310, out s4_311, out t3_312);
		word32 s0_313;
		word32 s1_314;
		word32 a0_315;
		word32 a1_316;
		word32 a2_317;
		word32 a3_318;
		word32 a4_319;
		word32 a5_320;
		word32 a6_321;
		word32 s4_322;
		word32 t3_323;
		vPortFree(s1_175, a2_171, a5_174, mstatus, dwArg0138, dwArg0178, out s0_313, out s1_314, out a0_315, out a1_316, out a2_317, out a3_318, out a4_319, out a5_320, out a6_321, out s4_322, out t3_323);
	}
	0x00 = (uint16) dwArgA8;
}

// 2304D27A: void aos_task_exit(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      tftp_ota_thread
void aos_task_exit(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	vTaskDelete(0x00, a2, a3, a4, a5, mstatus);
}

// 2304D280: Register ui32 aos_task_key_create(Register word32 a0, Register out ptr32 a4Out, Register out (ptr32 Eq_254219) a5Out)
// Called from:
//      aos_loop_init
ui32 aos_task_key_create(word32 a0, ptr32 & a4Out, struct Eq_254219 & a5Out)
{
	ptr32 a4_15;
	struct Eq_254219 * a5_14 = (struct Eq_254219 *) 0x20171020;
	word32 a5_59;
	if (*((word32) xTaskGetCurrentTaskHandle(out a5_59) + 0x0098) != 0x20171020)
	{
		a4_15 = ~0x00;
		goto l2304D2C4;
	}
	word32 * a4_18;
	word32 a0_16 = *(word32 *) 0x20171080;
	if (false)
	{
		if (false)
		{
			if (false)
			{
				a3 = 0x00;
				a4_15 = ~0x00;
				if (false)
					goto l2304D2C4;
				a4_18 = (word32 *) 0x03;
				a3 = 0x08;
			}
			else
			{
				a4_18 = (word32 *) 0x02;
				a3 = 0x04;
			}
		}
		else
		{
			a4_18 = (word32 *) 0x01;
			a3 = 0x02;
		}
	}
	else
	{
		a4_18 = null;
		a3 = 0x01;
	}
	a5_14 = a3 | 0x20171020;
	a5_14->dw0060 = a0_16;
	*a4_18 = a0;
	a4_15 = 0x00;
l2304D2C4:
	a4Out = a4_15;
	a5Out = a5_14;
	return a3;
}

// 2304D2E4: Register (ptr32 word32) aos_task_setspecific(Register (ptr32 word32) a0, Register Eq_2 a1, Register out (ptr32 word32) a0Out, Register out Eq_254171 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      get_context
//      aos_loop_init
word32 * aos_task_setspecific(word32 * a0, Eq_2 a1, word32 & a0Out, union Eq_254171 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	word32 * a0_15;
	word32 * s0_24 = a0;
	Eq_2 a5_13;
	Eq_2 a0_12 = xTaskGetCurrentTaskHandle(out a5_13);
	ptr32 a4_14 = 0x03;
	if (a0 <= (word32 *) 0x03)
	{
		a3 = *((word32) a0_12 + 0x0098);
		a4_14 = 0x20171020;
		a5_13 = a0_12;
		a0_15 = (word32 *) ~0x00;
		if (a3 == 0x20171020)
		{
			s0_24 = (word32) a0_12 + (a0 + 6 << 2);
			*((word32) a1 + 4) = s0_24;
			a0_15 = null;
		}
	}
	else
		a0_15 = (word32 *) ~0x00;
	a0Out = a0_15;
	a3Out = a3;
	a4Out = a4_14;
	a5Out = a5_13;
	return s0_24;
}

