pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304D324: Register Eq_2 aos_task_getspecific(Register Eq_2 a0, Register out Eq_254154 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      get_context
//      aos_loop_init
Eq_2 aos_task_getspecific(Eq_2 a0, union Eq_254154 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_11;
	Eq_2 a0_10 = xTaskGetCurrentTaskHandle(out a5_11);
	ptr32 a4_12 = 0x03;
	if (a0 <= 0x03)
	{
		a3 = *((word32) a0_10 + 0x0098);
		a4_12 = 0x20171020;
		a5_11 = a0_10;
	}
	a3Out = a3;
	a4Out = a4_12;
	a5Out = a5_11;
	return 0x00;
}

// 2304D35E: Register word32 aos_mutex_new(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      vfs_uart_open
//      event_open
word32 aos_mutex_new(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_17;
	ptr32 a4_18;
	union Eq_2 * a0_28;
	word32 a1_55;
	word32 a5_56;
	word32 s2_57;
	word32 s3_58;
	word32 s4_59;
	word32 s5_60;
	word32 s6_61;
	word32 s1_21 = xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_28, out a1_55, out a3_17, out a4_18, out a5_56, out s2_57, out s3_58, out s4_59, out s5_60, out s6_61);
	*a0_28 = (union Eq_2 *) a0;
	a0Out = 0x00 - (word32) (a0_28 < (union Eq_2 *) 1);
	a3Out = a3_17;
	a4Out = a4_18;
	return s1_21;
}

// 2304D37E: Register (ptr32 Eq_184845) aos_mutex_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      vfs_uart_close
//      event_close
struct Eq_184845 * aos_mutex_free(union Eq_2 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_5 = *a0;
	ptr32 a0_9;
	ptr32 a2_11;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 s1_27;
	word32 a1_28;
	word32 a3_29;
	word32 s4_30;
	struct Eq_184845 * s0_16 = vQueueDelete(a0_5, a3, a4, mstatus, dwArg0158, dwArg0198, out s1_27, out a0_9, out a1_28, out a2_11, out a3_29, out a4_13, out a5_14, out s4_30);
	a0Out = a0_9;
	a2Out = a2_11;
	a4Out = a4_13;
	a5Out = a5_14;
	return s0_16;
}

// 2304D384: Register Eq_2 aos_mutex_lock(Register (ptr32 Eq_253719) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      vfs_uart_read
//      vfs_uart_poll
//      vfs_uart_sync
//      vfs_uart_ioctl
//      event_poll
//      event_write
//      event_read
Eq_2 aos_mutex_lock(struct Eq_253719 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == null)
	{
		s1Out = s1;
		a0Out.u0 = <invalid>;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s0;
	}
	else
	{
		Eq_2 a3_18;
		Eq_2 a4_19;
		Eq_2 a5_20;
		ptr32 s1_23;
		ptr32 s2_24;
		ptr32 s3_25;
		ptr32 s4_26;
		word32 a0_73;
		word32 a1_74;
		word32 a2_75;
		Eq_2 s0_22 = xQueueSemaphoreTake(a0->t0000, a1, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_23, out a0_73, out a1_74, out a2_75, out a3_18, out a4_19, out a5_20, out s2_24, out s3_25, out s4_26);
		s1Out = s1_23;
		a0Out.u0 = <invalid>;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_20;
		s2Out = s2_24;
		s3Out = s3_25;
		s4Out = s4_26;
		return s0_22;
	}
}

// 2304D39C: void aos_mutex_unlock(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      vfs_uart_read
//      vfs_uart_poll
//      vfs_uart_sync
//      vfs_uart_ioctl
//      event_poll
//      event_write
//      event_read
void aos_mutex_unlock(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	word32 s0_93;
	word32 s1_94;
	word32 a0_95;
	word32 a1_96;
	word32 a2_97;
	word32 a3_98;
	word32 a4_99;
	word32 a5_100;
	word32 a7_101;
	word32 s2_102;
	word32 s3_103;
	word32 s4_104;
	word32 s5_105;
	word32 s6_106;
	word32 s8_107;
	xQueueGenericSend(*a0, 0x00, 0x00, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_93, out s1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_100, out a7_101, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out s8_107);
}

// 2304D3BA: Register word32 aos_sem_new(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_poll
word32 aos_sem_new(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 * a0_16;
	ptr32 s2_25;
	ptr32 s3_26;
	*a0_16 = xQueueCreateCountingSemaphore(ra, 0x0080, a1, a3, a4, a5, mstatus, dwLoc10, s0, dwArgE8, dwArg0128, out a0_16, out s2_25, out s3_26);
	s2Out = s2_25;
	s3Out = s3_26;
	return dwArg10;
}

// 2304D3D6: Register word32 aos_sem_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      aos_poll
word32 aos_sem_free(union Eq_2 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	if (a0 == null)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a0_5 = *a0;
		ptr32 a1_10;
		Eq_2 a3_12;
		Eq_2 a4_13;
		ptr32 a5_14;
		word32 s1_17;
		ptr32 s4_18;
		word32 a0_50;
		word32 a2_51;
		vQueueDelete(a0_5, a3, a4, mstatus, dwArg0158, dwArg0198, out s1_17, out a0_50, out a1_10, out a2_51, out a3_12, out a4_13, out a5_14, out s4_18);
		a1Out = a1_10;
		a3Out = a3_12;
		a4Out = a4_13;
		a5Out = a5_14;
		s4Out = s4_18;
		return s1_17;
	}
}

// 2304D3E0: Register word32 aos_sem_wait(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out ptr32 s2Out)
// Called from:
//      aos_poll
word32 aos_sem_wait(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a0Out, union Eq_2 & a4Out, ptr32 & s2Out)
{
	if (a0 == null)
	{
		a0Out = ~0x00;
		a4Out = a4;
		s2Out = s2;
		return s1;
	}
	else
	{
		word32 a0_15;
		Eq_2 a4_19;
		word32 s1_23;
		ptr32 s2_24;
		word32 a1_70;
		word32 a2_71;
		word32 a3_72;
		word32 a5_73;
		word32 s3_74;
		word32 s4_75;
		xQueueSemaphoreTake(*a0, a1, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_23, out a0_15, out a1_70, out a2_71, out a3_72, out a4_19, out a5_73, out s2_24, out s3_74, out s4_75);
		a0Out = 0x00 - (word32) (a0_15 != ~0x00);
		a4Out = a4_19;
		s2Out = s2_24;
		return s1_23;
	}
}

// 2304D400: void aos_sem_signal(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      vfs_poll_notify
void aos_sem_signal(Eq_2 ra, union Eq_2 * a0, Eq_2 a2, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	if (a0 != null)
	{
		Eq_2 a5_9 = g_t4200DE84;
		Eq_2 a0_10 = *a0;
		if (a5_9 != 0x00)
		{
			word32 a5_43;
			Eq_2 a3_46 = xQueueGiveFromISR(a0_10, fp + ~0x13, a2, a4, a5_9, mstatus, out a5_43);
			if (a5_43 != 0x00)
			{
				word32 a0_137;
				word32 a4_138;
				word32 a5_139;
				vTaskSwitchContext(ra, a3_46, s2, mstatus, dwArg10, dwArg14, dwArg38, dwArg5C, out a0_137, out a4_138, out a5_139);
			}
		}
		else
		{
			word32 s0_122;
			word32 s1_123;
			word32 a0_124;
			word32 a1_125;
			word32 a2_126;
			word32 a3_127;
			word32 a4_128;
			word32 a5_129;
			word32 a7_130;
			word32 s2_131;
			word32 s3_132;
			word32 s4_133;
			word32 s5_134;
			word32 s6_135;
			word32 s8_136;
			xQueueGenericSend(a0_10, 0x00, 0x00, a4, a5_9, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_122, out s1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a7_130, out s2_131, out s3_132, out s4_133, out s5_134, out s6_135, out s8_136);
		}
	}
}

// 2304D434: Register Eq_2 aos_malloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_136972) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aos_cli_init
//      proc_onecmd
//      romfs_opendir
//      event_open
//      event_write
//      aos_register_event_filter
Eq_2 aos_malloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_136972 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_11;
	ptr32 a3_14;
	ptr32 a4_15;
	struct Eq_136972 * a5_16;
	ptr32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	ptr32 s4_22;
	word32 a1_39;
	word32 a2_40;
	word32 a6_41;
	word32 s8_42;
	Eq_2 s0_18 = pvPortMalloc(ra, s1, a0, a3, a4, a5, mstatus, dwArg40, dwArg44, dwArg8C, dwArg0138, dwArg0178, out s1_19, out a0_11, out a1_39, out a2_40, out a3_14, out a4_15, out a5_16, out a6_41, out s2_20, out s3_21, out s4_22, out s8_42);
	s1Out = s1_19;
	a0Out = a0_11;
	a3Out = a3_14;
	a4Out = a4_15;
	a5Out = a5_16;
	s2Out = s2_20;
	s3Out = s3_21;
	s4Out = s4_22;
	return s0_18;
}

// 2304D438: Register word32 aos_free(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_2) a4Out, Register out (ptr32 Eq_137738) a5Out, Register out ptr32 a6Out, Register out ptr32 t3Out)
// Called from:
//      proc_onecmd
//      romfs_closedir
//      romfs_opendir
//      event_close
//      event_read
word32 aos_free(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, struct Eq_137738 & a5Out, ptr32 & a6Out, ptr32 & t3Out)
{
	ptr32 a2_8;
	ptr32 a3_9;
	union Eq_2 * a4_10;
	struct Eq_137738 * a5_11;
	ptr32 s1_12;
	ptr32 a0_14;
	ptr32 a6_16;
	ptr32 t3_19;
	word32 s0_30;
	word32 a1_31;
	word32 s4_32;
	word32 tp_13 = vPortFree(a0, a2, a5, mstatus, dwArg0158, dwArg0198, out s0_30, out s1_12, out a0_14, out a1_31, out a2_8, out a3_9, out a4_10, out a5_11, out a6_16, out s4_32, out t3_19);
	s1Out = s1_12;
	a0Out = a0_14;
	a2Out = a2_8;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	a6Out = a6_16;
	t3Out = t3_19;
	return tp_13;
}

// 2304D43C: Register word32 aos_now_ms(Register Eq_2 a3, Register out ptr32 a0Out, Register out Eq_3102 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_3104) a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      event_cb_wifi_event
//      uptime_cmd
//      sec_trng_IRQHandler
//      aos_post_delayed_action
//      aos_loop_run
word32 aos_now_ms(Eq_2 a3, ptr32 & a0Out, union Eq_3102 & a1Out, ptr32 & a2Out, struct Eq_3104 & a4Out, union Eq_2 & a5Out)
{
	word32 a0_10 = xTaskGetTickCount2(fp + ~0x17, fp + ~0x13);
	if (a0_10 == 0x01)
	{
		ptr32 a5_19 = 0x00 - a3;
		ptr32 a0_21 = a0_10 + a5_19;
		a0Out = a0_21;
		struct Eq_3104 * a4_18 = (word32) (a3 > ~0x00);
		union Eq_2 * a5_23 = (word32) (a0_21 < a5_19);
		a1Out = (a3 >>u 0x1F) + a4_18 + a5_23;
		a2Out = dwArg84;
		a4Out = a4_18;
		a5Out = a5_23;
		return dwArg24;
	}
	else
	{
		while (true)
			;
	}
}

// 2304D476: void event_poll(Register word32 ra, Register (ptr32 Eq_253719) s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArg84, Stack word32 dwArgA4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void event_poll(word32 ra, struct Eq_253719 * s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArg84, word32 dwArgA4, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_256048 * a3_26;
	word32 s1_31;
	word32 s4_140;
	word32 s3_139;
	word32 s2_138;
	word32 a0_137;
	Eq_2 a4_27;
	Eq_2 a5_28;
	aos_mutex_lock(s0, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_31, out a0_137, out a3_26, out a4_27, out a5_28, out s2_138, out s3_139, out s4_140);
	Eq_2 s0_39 = dwArg84;
	if (s1_31 == 0x00)
	{
		*((word32) dwArg84 + 4) = 0x00;
		*((word32) dwArg84 + 0x0C) = 0x00;
	}
	else
	{
		s0_39 = *((word32) a5_28 + 16);
		*((word32) a2 + 4) = s0_39;
		a3_26->t0008 = s0_39;
		*((word32) a4_27 + 0x0C) = s0_39;
		if (a5_28 != 0x00)
		{
			ui32 a5_45 = (word32) a3_26->w0006;
			a3_26->w0006 = (word16) (a5_45 | 1);
			a2();
		}
	}
	aos_mutex_unlock(s0_39, a4_27, a5_28, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
}

// 2304D4D0: void event_open(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void event_open(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 a0_17;
	word32 s1_91;
	word32 a3_92;
	word32 a4_93;
	word32 a5_94;
	word32 s2_95;
	word32 s3_96;
	word32 s4_97;
	aos_malloc(ra, a1, 40, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_91, out a0_17, out a3_92, out a4_93, out a5_94, out s2_95, out s3_96, out s4_97);
	Eq_2 a3_38;
	Eq_2 a4_39;
	Eq_2 a5_40;
	word32 t1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a0_102;
	word32 a3_103;
	word32 a4_104;
	word32 s1_53 = aos_mutex_new(memset(ra, a0_17, 0x00, 40, out t1_98, out a0_99, out a1_100, out a2_101, out a3_38, out a4_39, out a5_40), a0_17, a3_38, a4_39, a5_40, mstatus, dwLoc10, s0, ra, dwArgE8, dwArg0128, dwArg0168, out a0_102, out a3_103, out a4_104);
	*((word32) a0_17 + 40) = a0_17;
	*((word32) a0_17 + 44) = a0_17;
	*((word32) a0_17 + 64) = a0_17;
	*((word32) a0_17 + 0x0044) = a0_17;
	*((word32) a0_17 + 4) = s1_53;
}

