pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304D512: void _event_write.isra.0(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_253719) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
// Called from:
//      event_ioctl
//      event_write
void _event_write.isra.0(Eq_2 ra, Eq_2 s0, struct Eq_253719 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a5_156;
	Eq_2 a4_107;
	Eq_2 s0_121;
	Eq_2 s1_73;
	Eq_2 a3_31;
	Eq_2 a4_32;
	Eq_2 a5_33;
	word32 a0_287;
	word32 s2_288;
	Eq_2 s1_36;
	Eq_2 s4_39;
	word32 s3_108;
	aos_mutex_lock(a0, ~0x00, a2, a3, a4, a5, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_36, out a0_287, out a3_31, out a4_32, out a5_33, out s2_288, out s3_108, out s4_39);
	Eq_2 s2_134 = a2;
	if (a5_33 > 0x00)
	{
		s1_36 = *((word32) a5_33 + 8);
		if (a2 == a5_33)
		{
			s1_73 = *a4_32;
			*((word32) a5_33 + 4) = a4_32;
			*a4_32 = a5_33;
			*((word32) a5_33 + 27) = *((word32) a5_33 + 28);
			a5_156 = (word32) a5_33 - 1;
			goto l2304D54E;
		}
	}
	Eq_2 a0_58;
	word32 s1_292;
	word32 a3_293;
	s0_121 = aos_malloc(ra, s1_36, (word32) a2 + 0x0C, a3_31, a4_32, a5_33, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_292, out a0_58, out a3_293, out a4_107, out a5_156, out s2_134, out s3_108, out s4_39);
	s1_73 = a0_58;
	if (a0_58 == 0x00)
		goto l2304D58C;
l2304D54E:
	Eq_12668 s0_85 = *((word32) a5_156 + 16);
	*((word32) a5_156 + 0x0011) = s0_85;
	*((word32) a2 + 8) = s1_73;
	Eq_2 a0_89 = (word32) s1_73 + 0x0C;
	word32 a1_97;
	word32 a2_98;
	word32 a3_99;
	word32 a7_291;
	word32 a4_289;
	word32 a6_290;
	memcpy(a0_89, s4_39, a2, out a1_97, out a2_98, out a3_99, out a4_289, out a5_156, out a6_290, out a7_291);
	a4_107 = (word32) s0_85 + 20;
	if (s3_108 != 0x00)
	{
		word32 s0_114 = *((word32) a5_156 + 24);
		*((word32) s0_85 + 20) = s1_73;
		*((word32) a5_156 + 4) = s1_73;
		*((word32) s1_73 + 24) = s0_114;
		*s1_73 = a5_156;
	}
	else
	{
		word32 s0_109 = *((word32) a5_156 + 20);
		*((word32) s0_85 + 24) = s1_73;
		*a5_156 = s1_73;
		*((word32) s1_73 + 4) = a5_156;
		*((word32) s1_73 + 20) = s0_109;
	}
	s0_121 = *((word32) a5_156 + 4);
	if (a5_156 != 0x00)
	{
		ui32 a5_124 = (word32) *((word32) s0_85 + 26);
		*((word32) s0_85 + 26) = (word16) (a5_124 | 1);
		(a5_124 | 1)();
	}
l2304D58C:
	aos_mutex_unlock(s0_121, a4_107, a5_156, mstatus, s0, ra, dwArgD8, dwArg0118, dwArg0158);
	0x00 = dwArg0128;
}

// 2304D5C4: void event_ioctl(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_256347) a0, Register int32 a1, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void event_ioctl(Eq_2 ra, Eq_2 s0, struct Eq_256347 * a0, int32 a1, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a3_10;
	Eq_2 a4_11 = 0x01;
	if ((a1 & 0x0F) != 0x01)
	{
		a4_11.u0 = 0x02;
		if ((a1 & 0x0F) != 0x02)
			return;
		a3_10.u0 = 0x01;
	}
	else
		a3_10.u0 = 0x00;
	struct Eq_253719 * a0_17 = a0->ptr0004;
	_event_write.isra.0(ra, s0, a0_17, a1 >> 0x04, a3_10, a4_11, a1 & 0x0F, s3, mstatus, dwArg10, dwArg14, dwArgD8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158);
}

// 2304D5EA: void event_write(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_256384) a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void event_write(Eq_2 ra, Eq_2 s0, struct Eq_256384 * a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	struct Eq_253719 * a0_5 = a0->ptr0004;
	_event_write.isra.0(ra, s0, a0_5, a2, 0x00, a4, a5, s3, mstatus, dwArg10, dwArg14, dwArgD8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0158);
}

// 2304D5F2: void event_close(Register (ptr32 Eq_2) s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void event_close(union Eq_2 * s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	struct Eq_256411 * a0_15;
	Eq_2 a4_19;
	Eq_2 a5_20;
	Eq_2 a2_17;
	struct Eq_256411 * s1_27 = aos_mutex_free(s0, a3, a4, mstatus, dwArg0148, dwArg0188, out a0_15, out a2_17, out a4_19, out a5_20) + 20;
	while (true)
	{
		word32 s0_30 = a0_15->dw0018;
		if (a0_15 == s1_27)
			break;
		Eq_2 a0_35 = *((word32) a5_20 + 4);
		*((word32) a5_20 + 4) = a4_19;
		*a4_19 = a5_20;
		word32 t3_116;
		word32 a6_115;
		word32 a3_114;
		aos_free(a0_35, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_27, out a0_15, out a2_17, out a3_114, out a4_19, out a5_20, out a6_115, out t3_116);
	}
	struct Eq_256411 * s1_53 = s0_30 + 32;
	while (true)
	{
		Eq_2 s0_56 = a0_15->t0024;
		if (a0_15 == s1_53)
			break;
		Eq_2 a0_61 = *((word32) a5_20 + 4);
		*((word32) a5_20 + 4) = a4_19;
		*a4_19 = a5_20;
		word32 a3_117;
		word32 a6_118;
		word32 t3_119;
		aos_free(a0_61, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_53, out a0_15, out a2_17, out a3_117, out a4_19, out a5_20, out a6_118, out t3_119);
	}
	word32 a2_122;
	word32 a3_123;
	word32 s1_120;
	word32 a0_121;
	word32 a4_124;
	word32 a5_125;
	word32 a6_126;
	word32 t3_127;
	aos_free(s0_56, a2_17, a5_20, mstatus, dwArg0148, dwArg0188, out s1_120, out a0_121, out a2_122, out a3_123, out a4_124, out a5_125, out a6_126, out t3_127);
}

