pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304D644: void event_read(Register (ptr32 Eq_253719) s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void event_read(struct Eq_253719 * s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	if (s0->dw0010 != 0x00)
	{
		Eq_2 a4_32;
		struct Eq_256519 * a5_33;
		Eq_2 s3_38;
		Eq_2 s4_39;
		word32 a3_212;
		word32 s2_213;
		word32 s1_210;
		word32 a0_211;
		aos_mutex_lock(s0, ~0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_210, out a0_211, out a3_212, out a4_32, out a5_33, out s2_213, out s3_38, out s4_39);
		Eq_2 s1_45 = a5_33->t0004;
		a5_33->t0004 = a4_32;
		*a4_32 = a5_33;
		Eq_2 s2_48 = *((word32) s1_45 + 8);
		if (s3_38 < s2_48)
			s2_48 = s3_38;
		Eq_2 a4_103;
		struct Eq_256554 * a5_80;
		int32 a4_56;
		Eq_2 a2_60;
		word32 a3_215;
		word32 a1_214;
		word32 a5_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(s4_39, (word32) s1_45 + 0x0C, s2_48, out a1_214, out a2_60, out a3_215, out a4_56, out a5_216, out a6_217, out a7_218);
		if (a4_56 <= 0x03)
		{
			Eq_2 s0_87 = *(union Eq_2 *) 0x27;
			*((word32) s0_87 + 32) = s1_45;
			*(union Eq_2 *) 0x07 = s1_45;
			*((word32) s1_45 + 36) = s0_87;
			*s1_45 = 0x03;
			*(union Eq_2 *) 0x20 = *(union Eq_2 *) 0x1F;
			a4_103 = (word32) s0_87 + 32;
			a5_80 = (struct Eq_256554 *) 0x04;
		}
		else
		{
			word32 s1_219;
			word32 a0_220;
			word32 a2_221;
			word32 a3_222;
			word32 a6_223;
			word32 t3_224;
			aos_free(s1_45, a2_60, 0x03, mstatus, dwArg0138, dwArg0178, out s1_219, out a0_220, out a2_221, out a3_222, out a4_103, out a5_80, out a6_223, out t3_224);
		}
		Eq_2 s0_98 = a5_80->t0010;
		Eq_2 a5_100 = (char *) a5_80 - 1;
		*((word32) a5_100 + 16) = s0_98;
		aos_mutex_unlock(s0_98, a4_103, a5_100, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168);
	}
}

// 2304D6CA: Register Eq_2 vfs_device_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out ptr32 s6Out)
// Called from:
//      aos_loop_proc
Eq_2 vfs_device_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, ptr32 & s6Out)
{
	if (a5 != 0x01)
	{
		word32 a0_23;
		word32 s0_30;
		word32 * s1_31;
		word32 a5_104;
		word32 s2_105;
		word32 s4_106;
		ra = aos_register_driver(ra, 587758004, 0x00, a3, a4, a5, mstatus, dwArg64, dwArgA4, dwArgD8, dwArg0118, dwArg0158, out s0_30, out s1_31, out a0_23, out a5_104, out s2_105, out s4_106, out s6);
		if (a0_23 == 0x00)
			*s1_31 = s0_30;
	}
	s6Out = s6;
	return ra;
}

// 2304D708: void event_read_cb(Register Eq_2 ra, Register word32 s1, Register Eq_2 a0, Register Eq_2 a4, Stack Eq_2 dwArg24, Stack word32 dwArgC4)
void event_read_cb(Eq_2 ra, word32 s1, Eq_2 a0, Eq_2 a4, Eq_2 dwArg24, word32 dwArgC4)
{
	uint16 wLoc1C = (uint16) dwLoc1C;
	struct Eq_256659 * sp_3 = fp + ~0x1F;
	word32 a0_14;
	word32 a4_141;
	word32 a5_142;
	word32 a2_140;
	struct Eq_256667 * s0_18;
	word32 a1_20;
	Eq_2 ra_22 = aos_read(ra, a0, fp + ~0x1F, a4, dwLoc20, dwArg24, out s0_18, out a0_14, out a1_20, out a2_140, out a4_141, out a5_142);
	if (a0_14 == 0x10)
	{
		int32 a4_24 = (word32) wLoc1C;
		if (a4_24 == 0x0100)
			(*(<anonymous> *) 0x0100)();
		else
		{
			struct Eq_256667 * a4_27 = s0_18->ptr0004;
			struct Eq_256667 * s1_28 = &g_t4200D954;
			for (; s0_18 != s1_28; s0_18 = s0_18->ptr0004)
			{
				struct Eq_256667 * a5_32 = (word32) s0_18->w0010;
				if (a5_32 != null)
				{
					a4_27 = (word32) sp_3->w0004;
					if (a4_27 == a5_32)
						goto l2304D75A;
				}
				else
				{
l2304D75A:
					a5_32();
				}
			}
		}
	}
}

// 2304D766: Register Eq_2 aos_event_service_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_loop_init
Eq_2 aos_event_service_init(Eq_2 ra, Eq_2 s0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 a0_13;
	struct Eq_256710 * a4_22;
	Eq_2 s3_25;
	Eq_2 s6_30;
	ptr32 mstatus_37;
	word32 s2_131;
	word32 a5_130;
	word32 a3_129;
	word32 s0_128;
	Eq_2 ra_38 = aos_open(ra, 587758004, s2, mstatus, s0, ra, dwArg78, dwArgE8, dwArg0128, dwArg0168, out s0_128, out a0_13, out a3_129, out a4_22, out a5_130, out s2_131, out s3_25, out s6_30, out mstatus_37);
	word32 a5_40 = a4_22->dw0004;
	if (a4_22 < null)
		*((word32) a0_13 + 4) = a5_40;
	Eq_2 s0_60;
	ptr32 s2_62;
	Eq_2 a1_69;
	word32 a5_134;
	word32 a4_133;
	word32 a3_132;
	Eq_2 ra_71 = aos_poll_read_fd(ra_38, a0_13, 587519752, 0x00, s3_25, s6_30, mstatus_37, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_60, out a1_69, out a3_132, out a4_133, out a5_134, out s2_62);
	aos_loop_set_eventfd(s0_60, a1_69);
	s2Out = s2_62;
	mstatusOut = mstatus_37;
	return ra_71;
}

// 2304D7AC: Register Eq_2 aos_post_event(Register Eq_2 ra, Register uint32 a0, Register (ptr32 Eq_604) a4, Stack Eq_2 dwArg24, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out)
// Called from:
//      cmd_stack_wifi
//      bl_rx_apm_sta_del_ind
//      bl_rx_apm_sta_add_ind
//      stateConnectingEnter
//      stateDisconnect_action_reconnect
//      stateConnectedIPNoEnter
//      stateGlobalGuard_AP
//      stateGlobalGuard_denoise
//      stateGlobalGuard_stop
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateConnectedIPYes_enter
//      wifi_mgmr_start
//      cb_event_ind
Eq_2 aos_post_event(Eq_2 ra, uint32 a0, struct Eq_604 * a4, Eq_2 dwArg24, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out)
{
	ptr32 a0_22;
	ptr32 a3_25;
	ptr32 s0_27;
	ptr32 a1_29;
	Eq_2 ra_31 = aos_ioctl(ra, g_t4200D960, (a0 >> 0x0F) + 0x0101, fp + ~0x1F, a4, 0x00, dwArg24, out s0_27, out a0_22, out a1_29, out a3_25);
	s0Out = s0_27;
	a0Out = a0_22;
	a1Out = a1_29;
	a3Out = a3_25;
	return ra_31;
}

// 2304D7E0: Register Eq_2 aos_register_event_filter(Register Eq_2 ra, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
//      wifi_mgmr_start
Eq_2 aos_register_event_filter(Eq_2 ra, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a1 == 0x00)
	{
		s2Out = s2;
		s3Out = s3;
		return a4;
	}
	else
	{
		Eq_2 a0_24;
		struct Eq_256786 * a3_27;
		struct Eq_256787 * s1_32;
		ptr32 s2_33;
		ptr32 s3_34;
		word32 s4_110;
		word32 a5_109;
		Eq_2 a4_28;
		Eq_2 s0_31 = aos_malloc(ra, a2, 0x14, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_32, out a0_24, out a3_27, out a4_28, out a5_109, out s2_33, out s3_34, out s4_110);
		if (a0_24 != 0x00)
		{
			a4_28 = a3_27->t0000;
			*((word32) s0_31 + 8) = a0_24;
			*((word32) a0_24 + 16) = (word16) s2_33;
			a3_27->t0000 = a0_24;
			s1_32->t000C = a0_24;
			*((word32) a4_28 + 4) = a0_24;
			*((word32) a0_24 + 4) = a3_27;
			*a0_24 = a4_28;
		}
		0x00 = (uint16) dwArg38;
		s2Out = s2_33;
		s3Out = s3_34;
		return a4_28;
	}
}

// 2304D82A: Register Eq_2 aws_iot_shadow_init(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_7192) a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Register out (ptr32 Eq_7192) s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_init(Eq_2 ra, Eq_2 a0, struct Eq_7192 * a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, struct Eq_7192 & s0Out, ptr32 & a0Out, ptr32 & a3Out)
{
	word32 a1_160;
	word32 a2_161;
	word32 a4_162;
	word32 a5_163;
	word32 a6_164;
	word32 a7_165;
	ptr32 a3_127;
	memcpy(fp + -0x0044, 587758016, 52, out a1_160, out a2_161, out a3_127, out a4_162, out a5_163, out a6_164, out a7_165);
	struct Eq_7192 * s0_133 = a1;
	ptr32 a0_124 = ~0x01;
	if (a0 != 0x00 && a1 != null)
	{
		ra = aws_iot_mqtt_init(ra, a0, fp + -0x0044, s2, mstatus, SEQ(wLoc3A, (word16) (word32) null[(word32) a1->b0014 / 4]->w0004), dwLoc28, dwLoc04, 0x01000388, dwArg78, dwArg88, dwArgB8, dwArgC8, out s0_133, out a0_124, out a3_127);
		if (a0_124 == 0x00)
		{
			resetClientTokenSequenceNum();
			g_dw4200EFFC = 0x00;
			a3_127 = initDeltaTokens();
		}
	}
	s0Out = s0_133;
	a0Out = a0_124;
	a3Out = a3_127;
	return ra;
}

// 2304D8A6: Register Eq_2 aws_iot_shadow_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_connect(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	struct Eq_256913 * a5_24;
	word32 a1_302;
	word32 a2_303;
	word32 a3_304;
	word32 a4_305;
	word32 a6_306;
	word32 a7_307;
	memcpy(fp + -88, 587758636, 56, out a1_302, out a2_303, out a3_304, out a4_305, out a5_24, out a6_306, out a7_307);
	ptr32 s0_112 = a1;
	Eq_2 s2_126 = a0;
	ptr32 s1_138 = ~0x01;
	if (a0 != 0x00 && a1 != 0x00)
	{
		s0_112 = a5_24->ptr0004;
		if (a5_24 != null)
		{
			word32 s1_52;
			Eq_2 a3_74;
			Eq_2 a4_75;
			Eq_2 s1_80;
			Eq_2 s2_83;
			Eq_2 s3_84;
			Eq_2 s4_85;
			word32 s0_308;
			word32 a0_309;
			word32 a1_310;
			word32 a2_311;
			word32 a3_312;
			word32 a4_313;
			word32 a5_314;
			word32 a7_315;
			word32 s2_316;
			word32 s3_317;
			word32 s4_318;
			word32 s5_319;
			word32 s6_320;
			word32 s7_321;
			word32 s8_322;
			word32 s9_323;
			word32 s10_324;
			word32 s11_325;
			word32 s0_326;
			word32 a0_327;
			word32 a1_328;
			word32 a2_329;
			word32 a5_330;
			word32 a7_331;
			word32 s5_332;
			word32 s6_333;
			word32 s7_334;
			word32 s8_335;
			word32 s9_336;
			word32 s10_337;
			word32 s11_338;
			Eq_2 ra_78 = snprintf(snprintf(ra, 0x42020800, 0x14, &g_t23085CD8, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_308, out s1_52, out a0_309, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314, out a7_315, out s2_316, out s3_317, out s4_318, out s5_319, out s6_320, out s7_321, out s8_322, out s9_323, out s10_324, out s11_325), 0x420200E0, 80, s1_52 + -808, dwLoc48, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_326, out s1_80, out a0_327, out a1_328, out a2_329, out a3_74, out a4_75, out a5_330, out a7_331, out s2_83, out s3_84, out s4_85, out s5_332, out s6_333, out s7_334, out s8_335, out s9_336, out s10_337, out s11_338);
			Eq_2 dwLoc4C_247 = SEQ(600, (word16) (word32) *((word32) *(union Eq_2 *) 0x05 + 8));
			ptr32 a0_109;
			word32 s1_339;
			word32 a3_340;
			word32 a4_341;
			word32 s4_342;
			word32 s6_343;
			ra = aws_iot_mqtt_connect(ra_78, s1_80, s2_83, a3_74, a4_75, s3_84, s4_85, mstatus, dwLoc4C_247, dwArg1C, dwArg38, dwArg78, dwArgB8, out s0_112, out s1_339, out a0_109, out a3_340, out a4_341, out s2_126, out s3, out s4_342, out s6_343, out s10, out mstatus);
			s1_138 = a0_109;
			if (a0_109 == 0x00)
			{
				struct Eq_257095 * a5_142 = initializeRecords(s2_126);
				s0_112 = a5_142->ptr000C;
				if (a5_142 != null)
				{
					word32 s1_159;
					Eq_2 s10_160;
					Eq_2 s2_162;
					Eq_2 s6_166;
					word32 s0_344;
					word32 a0_345;
					word32 a1_346;
					word32 a2_347;
					word32 a3_348;
					word32 a4_349;
					word32 a5_350;
					word32 a7_351;
					word32 s3_352;
					word32 s4_353;
					word32 s5_354;
					word32 s7_355;
					word32 s8_356;
					word32 s9_357;
					word32 s11_358;
					snprintf(ra, 0x42015A08, 80, &g_t23087A20, 0x00, dwLoc28, dwArg04, dwArg20, dwArg24, s1, dwArg6C, out s0_344, out s1_159, out a0_345, out a1_346, out a2_347, out a3_348, out a4_349, out a5_350, out a7_351, out s2_162, out s3_352, out s4_353, out s5_354, out s6_166, out s7_355, out s8_356, out s9_357, out s10_160, out s11_358);
					Eq_2 a4_176;
					word32 a1_359;
					word32 a2_360;
					word32 a3_361;
					word32 a5_362;
					strlen(s1_159 + -0x05F8, out a1_359, out a2_360, out a3_361, out a4_176, out a5_362);
					ptr32 a0_187;
					word32 s1_363;
					word32 a2_364;
					word32 a3_365;
					word32 a4_366;
					word32 s4_367;
					word32 s5_368;
					word32 s6_369;
					word32 s7_370;
					ra = aws_iot_mqtt_subscribe(s2_162, s1_159 + -0x05F8, 0x01, a4_176, s6_166, s10_160, mstatus, dwLoc5C, dwLoc4C_247, s2, dwArg08, dwArg18, dwArg28, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, out s0_112, out s1_363, out a0_187, out a2_364, out a3_365, out a4_366, out s2_126, out s3, out s4_367, out s5_368, out s6_369, out s7_370, out s10, out mstatus);
					s1_138 = a0_187;
				}
			}
		}
	}
	s0Out = s0_112;
	s1Out = s1_138;
	a0Out = s1_138;
	a3Out = dwArg08;
	s2Out = s2_126;
	s3Out = s3;
	s10Out = s10;
	mstatusOut = mstatus;
	return ra;
}

