pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304D98A: Register Eq_2 aws_iot_shadow_register_delta(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_7368) a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_5763) dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out ptr32 a3Out)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_register_delta(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, struct Eq_7368 * a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, struct Eq_5763 * dwArg10, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, ptr32 & a3Out)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		a3Out = a3;
		return ~0x01;
	}
	else if (aws_iot_mqtt_is_client_connected(a0) == 0x00)
	{
		a3Out = a3;
		return ~0x19;
	}
	else
	{
		ptr32 a3_27;
		Eq_2 a0_25 = registerJsonTokenOnDelta(ra, s1, dwArg10, a4, s3, mstatus, dwArg08, dwArg18, dwArg44, dwArg48, dwArg58, dwArg60, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgD8, dwArgE8, out a3_27);
		a3Out = a3_27;
		return a0_25;
	}
}

// 2304D9B6: Register Eq_2 aws_iot_shadow_yield(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_yield(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, word32 dwArg0198, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x01;
		a2Out = a2;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s4_23 = HandleExpiredResponseCallbacks(ra, a2, a3, a4, s2, mstatus, dwLoc18, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg38, dwArgE8, dwArg0128);
		ptr32 a0_31;
		Eq_2 a2_32;
		ptr32 s0_34;
		Eq_2 s2_41;
		ptr32 s3_42;
		Eq_2 a3_44;
		ptr32 mstatus_54;
		Eq_2 s10_56;
		Eq_2 ra_55 = aws_iot_mqtt_yield(ra, a0, a1, a3, a4, s4_23, s10, mstatus, dwArg98, dwArgD8, dwArg0118, dwArg0198, out s0_34, out a0_31, out a2_32, out a3_44, out s2_41, out s3_42, out s10_56, out mstatus_54);
		s0Out = s0_34;
		a0Out = a0_31;
		a2Out = a2_32;
		a3Out = a3_44;
		s2Out = s2_41;
		s3Out = s3_42;
		s10Out = s10_56;
		mstatusOut = mstatus_54;
		return ra_55;
	}
}

// 2304D9D4: Register Eq_2 aws_iot_shadow_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_11;
	ptr32 a5_12;
	ptr32 a2_13;
	ptr32 a3_17;
	ptr32 a4_18;
	ptr32 mstatus_33;
	word32 s1_49;
	word32 s2_50;
	word32 s3_51;
	word32 s4_52;
	word32 s5_53;
	word32 s6_54;
	Eq_2 ra_34 = aws_iot_mqtt_disconnect(ra, a0, a3, a4, s3, s4, mstatus, dwArg24, dwArg34, dwArg98, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0148, out s1_49, out a0_11, out a2_13, out a3_17, out a4_18, out a5_12, out s2_50, out s3_51, out s4_52, out s5_53, out s6_54, out mstatus_33);
	a0Out = a0_11;
	a2Out = a2_13;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_12;
	mstatusOut = mstatus_33;
	return ra_34;
}

// 2304D9D8: Register Eq_2 aws_iot_shadow_update(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a6, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack ptr32 dwArg84, Stack word32 dwArg88, Stack Eq_2 dwArg98, Register out ptr32 a3Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_update(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 a6, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, ptr32 dwArg84, word32 dwArg88, Eq_2 dwArg98, ptr32 & a3Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		a3Out = a3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else if (aws_iot_mqtt_is_client_connected(a0) == 0x00)
	{
		a3Out = a3;
		s4Out = dwArg04;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		word32 a1_162;
		word32 a2_163;
		word32 a3_164;
		word32 a4_165;
		word32 a5_166;
		Eq_2 a0_43 = strlen(a2, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166);
		ptr32 a3_66;
		ptr32 mstatus_79;
		Eq_2 s4_86;
		Eq_2 ra_80 = aws_iot_shadow_internal_action(ra, a1, dwArg48, a0_43, a6, s6, s4, mstatus, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg38, dwArg78, dwArg84, dwArg88, dwArg98, out a3_66, out s4_86, out mstatus_79);
		a3Out = a3_66;
		s4Out = s4_86;
		mstatusOut = mstatus_79;
		return ra_80;
	}
}

// 2304DA3C: Register Eq_2 aws_iot_shadow_set_autoreconnect_status(Register Eq_2 a0, Register word32 a1)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_set_autoreconnect_status(Eq_2 a0, word32 a1)
{
	return aws_iot_mqtt_autoreconnect_set_status(a0, a1);
}

// 2304DA40: Register Eq_2 aws_iot_shadow_internal_action(Register Eq_2 ra, Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack ptr32 dwArg84, Stack word32 dwArg88, Stack Eq_2 dwArg98, Register out ptr32 a3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_update
Eq_2 aws_iot_shadow_internal_action(Eq_2 ra, word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg78, ptr32 dwArg84, word32 dwArg88, Eq_2 dwArg98, ptr32 & a3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	byte bLoc8D_321 = SLICE(dwLoc90, byte, 24);
	if (a0 != 0x00 && a2 != 0x00)
	{
		word32 a0_47;
		word32 s3_60;
		word32 s1_375;
		word32 s4_376;
		word32 s5_131;
		Eq_2 s2_128;
		Eq_2 s0_124 = extractClientToken(a2, a3, dwLoc84, dwLoc7C, dwArg88, dwArg98, out s1_375, out a0_47, out s2_128, out s3_60, out s4_376, out s5_131);
		if (a0_47 != 0x00 && s3_60 != 0x00)
		{
			ptr32 a0_78 = getNextFreeIndexOfAckWaitList(fp + -141);
			s4 = a0_78;
			if (a0_78 == 0x00)
				goto l2304DAAA;
			Eq_2 a0_84;
			Eq_2 s0_93;
			Eq_2 s10_95;
			Eq_2 s2_97;
			Eq_2 s7_102;
			Eq_2 ra_92 = isSubscriptionPresent(ra, s2_128, dwLoc28, out s0_93, out a0_84, out s2_97, out s7_102, out s10_95);
			if (a0_84 == 0x00)
			{
				word32 a0_143;
				ra = subscribeToShadowActionAcks(ra_92, a0_84, s2_97, s2_97, s7_102, s10_95, mstatus, dwLoc90, dwLoc8C, dwLoc88, dwLoc78, dwLoc68, dwLoc38, dwLoc28, dwLoc18, dwArg08, dwArg18, dwArg1C, dwArg38, dwArg78, out s0_124, out a0_143, out s2_128, out s4, out s5_131, out mstatus);
				if (a0_143 != 0x00)
					goto l2304DAAA;
			}
			else
				ra = incrementSubscriptionCnt(ra_92, s0_93, s2_97, s2_97, dwLoc18, out s0_124, out s2_128, out s5_131);
		}
		word32 a0_191;
		Eq_2 s0_201;
		word32 s2_205;
		struct Eq_257581 * s3_206;
		word32 s9_212;
		ra = publishToShadowAction(ra, s0_124, s0_124, s2_128, s5_131, mstatus, dwLoc88, dwLoc68, dwLoc64, s6, dwLoc48, dwLoc28, dwLoc1C, dwLoc18, dwArg04, s5, dwArg84, out s0_201, out a0_191, out s2_205, out s3_206, out s4, out s9_212, out mstatus);
		if (s9_212 != 0x00 && (s3_206 != null && (a0_191 == 0x00 && s4 != 0x00)))
			s4 = addToAckWaitList(ra, (word32) bLoc8D_321, s0_201, s2_205, fp + -0x008C, s3_206, dwLoc60, s8, dwLoc38, dwLoc14, dwArg98);
	}
l2304DAAA:
	a3Out = (ptr32) *((word32) dwLoc48 + 504);
	s4Out = s4;
	mstatusOut = mstatus;
	return ra;
}

// 2304DB00: Register Eq_2 convertDataToString(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_7997 a1, Register word32 a2, Register (ptr32 Eq_257651) a3, Register Eq_5614 fa0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out Eq_2 s1Out, Register out Eq_257661 a0Out, Register out (ptr32 Eq_257651) a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      aws_iot_shadow_add_reported
Eq_2 convertDataToString(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_7997 a1, word32 a2, struct Eq_257651 * a3, Eq_5614 fa0, ptr32 fflags, ptr32 frm, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg98, Eq_2 dwArgBC, union Eq_2 & s1Out, union Eq_257661 & a0Out, struct Eq_257651 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	if (a1 == 0x00)
	{
		s1Out = s1;
		a0Out.u0 = -45;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		return ra;
	}
	Eq_2 s1_130;
	Eq_257661 a5_144;
	Eq_7997 a0_121;
	struct Eq_274 * a2_101;
	Eq_7997 s0_11 = a1;
	if (a2 == 0x00)
	{
		a2_101 = (struct Eq_274 *) &g_t23087A94;
		goto l2304DB20;
	}
	if (a2 == 0x01)
	{
		a2_101 = (struct Eq_274 *) &g_t23087A9C;
		goto l2304DB20;
	}
	if (a2 == 0x02)
	{
		a2_101 = (struct Eq_274 *) &g_t23087AA4;
		goto l2304DB20;
	}
	if (a2 == 0x03)
	{
		a2_101 = (struct Eq_274 *) &g_t23087AAC;
		goto l2304DB20;
	}
	if (a2 == 0x04)
	{
		a2_101 = (struct Eq_274 *) &g_t23087AB4;
		goto l2304DB20;
	}
	if (a2 == 0x05)
	{
		a2_101 = (struct Eq_274 *) &g_t23087ABC;
		goto l2304DB20;
	}
	if (a2 == 0x07)
	{
l2304DB9A:
		word32 a1_349;
		word32 a2_350;
		word32 a4_351;
		word32 a5_352;
		word32 a7_353;
		word32 s8_354;
		word32 s9_355;
		word32 s10_356;
		word32 s11_357;
		ra = snprintf(ra, a0, a1, &g_t23087AC4, dwArg08, dwArg28, dwArg54, s1, ra, dwArg98, dwArgBC, out s0_11, out s1_130, out a0_121, out a1_349, out a2_350, out a3, out a4_351, out a5_352, out a7_353, out s2, out s3, out s4, out s5, out s6, out s7, out s8_354, out s9_355, out s10_356, out s11_357);
l2304DB9E:
		a5_144.u0 = -45;
		if (a0_121 < 0x00)
			goto l2304DBA6;
		goto l2304DC16;
	}
	s1_130 = a0;
	if (a2 == 0x06)
	{
		word32 a1_348;
		__extendsfdf2(ra, fa0, fflags, frm, out a1_348);
		goto l2304DB9A;
	}
	if (a2 == 0x08)
		(word32) a3->b0000 != 0x00;
	else
	{
		if (a2 == 0x09)
		{
			a2_101 = (struct Eq_274 *) &g_t23087ACC;
l2304DB20:
			word32 a1_339;
			word32 a2_340;
			word32 a4_341;
			word32 a5_342;
			word32 a7_343;
			word32 s8_344;
			word32 s9_345;
			word32 s10_346;
			word32 s11_347;
			ra = snprintf(ra, a0, a1, a2_101, dwArg08, dwArg28, dwArg54, s1, ra, dwArg98, dwArgBC, out s0_11, out s1_130, out a0_121, out a1_339, out a2_340, out a3, out a4_341, out a5_342, out a7_343, out s2, out s3, out s4, out s5, out s6, out s7, out s8_344, out s9_345, out s10_346, out s11_347);
			goto l2304DB9E;
		}
		a0_121.u0 = 0x00;
		if (a2 != 0x0A)
		{
l2304DC16:
			a5_144.u0 = 0x00;
			if (a0_121 >= s0_11)
				a5_144.u0 = -44;
l2304DBA6:
			s1Out = s1_130;
			a0Out = a5_144;
			a3Out = a3;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			return ra;
		}
	}
	a2_101 = (struct Eq_274 *) &g_t23087AC8;
	goto l2304DC08;
}

// 2304DC22: void resetClientTokenSequenceNum()
// Called from:
//      aws_iot_shadow_init
void resetClientTokenSequenceNum()
{
	g_dw4200EFF4 = 0x00;
}

// 2304DC2C: Register Eq_2 aws_iot_shadow_init_json_document(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out Eq_8179 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_init_json_document(Eq_2 ra, Eq_2 a0, Eq_7997 a1, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & s1Out, union Eq_8179 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out.u0 = ~0x01;
		a3Out = a3;
		s2Out = s2;
		return ra;
	}
	else
	{
		Eq_257800 a0_15;
		ptr32 a3_18;
		Eq_257800 s0_23;
		ptr32 s1_24;
		ptr32 s2_27;
		word32 s11_137;
		word32 s10_136;
		word32 s9_135;
		word32 s8_134;
		word32 s7_133;
		word32 s6_132;
		word32 s5_131;
		word32 s4_130;
		word32 s3_129;
		word32 a7_128;
		word32 a5_127;
		word32 a4_126;
		word32 a2_125;
		word32 a1_124;
		Eq_2 ra_22 = snprintf(ra, a0, a1, &g_t23087A88, dwArg08, dwArg28, dwArg54, dwArg70, ra, dwArg98, dwArgBC, out s0_23, out s1_24, out a0_15, out a1_124, out a2_125, out a3_18, out a4_126, out a5_127, out a7_128, out s2_27, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137);
		Eq_8179 a5_38 = -45;
		if (a0_15 >= 0x00)
		{
			a5_38.u0 = 0x00;
			if (a0_15 >= s0_23)
				a5_38.u0 = -44;
		}
		s1Out = s1_24;
		a0Out = a5_38;
		a3Out = a3_18;
		s2Out = s2_27;
		return ra_22;
	}
}

