pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304DC64: Register Eq_2 aws_iot_shadow_add_reported(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register int32 a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_5614 fa0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg0178, Register out Eq_7994 a0Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out Eq_7997 s3Out)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_shadow_add_reported(Eq_2 ra, Eq_2 s1, Eq_2 a0, int32 a1, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_5614 fa0, ptr32 fflags, ptr32 frm, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArg0178, union Eq_7994 & a0Out, ptr32 & a3Out, union Eq_2 & s2Out, union Eq_7997 & s3Out)
{
	Eq_7994 a5_182;
	Eq_2 dwArg24_262 = fp + -20;
	if (a0 == 0x00)
	{
l2304DC88:
		a5_182.u0 = ~0x01;
		goto l2304DC8A;
	}
	word32 a1_424;
	word32 a2_425;
	word32 a4_426;
	word32 a5_427;
	s3 = a1 - strlen(a0, out a1_424, out a2_425, out a3, out a4_426, out a5_427);
	if (s3 <= 0x01)
	{
l2304DCB6:
		a5_182.u0 = -45;
		goto l2304DC8A;
	}
	Eq_7997 a0_59;
	word32 a1_428;
	word32 a2_429;
	word32 a3_430;
	word32 a4_431;
	word32 a5_432;
	word32 a1_433;
	word32 a2_434;
	word32 a4_435;
	word32 a5_436;
	word32 a7_437;
	word32 s6_438;
	word32 s7_439;
	word32 s8_440;
	word32 s9_441;
	word32 s10_442;
	word32 s11_443;
	Eq_2 s0_127;
	Eq_2 s5_172;
	word32 s4_171;
	word32 * s1_102;
	ra = snprintf(ra, strlen(a0, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432) + a0, s3, 587758200, s2, dwLoc28, dwArg04, dwArg20, fp + -20, a5, dwArg6C, out s0_127, out s1_102, out a0_59, out a1_433, out a2_434, out a3, out a4_435, out a5_436, out a7_437, out s2, out s3, out s4_171, out s5_172, out s6_438, out s7_439, out s8_440, out s9_441, out s10_442, out s11_443);
	a5_182.u0 = -45;
	if (a0_59 < 0x00)
		goto l2304DC8A;
	s2.u0 = 0x00;
	if (a0_59 >= s3)
	{
l2304DD10:
		a5_182.u0 = -44;
		goto l2304DC8A;
	}
	else
	{
		Eq_7997 s6_173 = 0x01;
		word32 s7_114 = 0x23088000;
		while (s2 < s5_172)
		{
			word32 a1_444;
			word32 a2_445;
			word32 a4_446;
			word32 a5_447;
			s3 = s4_171 - strlen(s0_127, out a1_444, out a2_445, out a3, out a4_446, out a5_447);
			if (s6_173 >= s3)
				goto l2304DCB6;
			word32 a5_103 = *s1_102;
			dwArg24_262 = a5_103 + 4;
			if (s1_102 == null)
				goto l2304DC88;
			Eq_7997 a0_119;
			word32 a5_124;
			word32 a1_468;
			word32 a2_469;
			word32 a3_470;
			word32 a4_471;
			word32 a5_472;
			word32 s1_473;
			word32 a1_474;
			word32 a2_475;
			word32 a4_476;
			word32 a7_477;
			word32 s4_478;
			word32 s5_479;
			word32 s6_480;
			word32 s7_481;
			word32 s8_482;
			word32 s9_483;
			word32 s10_484;
			word32 s11_485;
			ra = snprintf(ra, strlen(s0_127, out a1_468, out a2_469, out a3_470, out a4_471, out a5_472) + s0_127, s3, s7_114 + -0x0594, s2, dwLoc28, dwArg04, dwArg20, a5_103 + 4, a5, dwArg6C, out s0_127, out s1_473, out a0_119, out a1_474, out a2_475, out a3, out a4_476, out a5_124, out a7_477, out s2, out s3, out s4_478, out s5_479, out s6_480, out s7_481, out s8_482, out s9_483, out s10_484, out s11_485);
			if (a0_119 < 0x00)
				goto l2304DCB6;
			if (a0_119 >= s3)
				goto l2304DD10;
			if (a5_124 == 0x00 || a5_124 == 0x00)
				goto l2304DC88;
			struct Eq_257651 * a3_146;
			word32 a1_486;
			word32 a2_487;
			word32 a4_488;
			word32 a5_489;
			Eq_2 a0_145 = strlen(s0_127, out a1_486, out a2_487, out a3_146, out a4_488, out a5_489);
			Eq_2 s1_151 = a3_146->t0004;
			Eq_7994 a0_158;
			ra = convertDataToString(ra, s1_151, a0_145 + s0_127, s3, CONVERT(Mem105[s1_151 + 0x0C:byte], byte, word32), a3_146, fa0, fflags, frm, dwLoc58, a4, dwLoc0C, s1, dwArg5C, out s1_102, out a0_158, out a3, out s2, out s3, out s4_171, out s5_172, out s6_173, out s7_114);
			a5_182 = a0_158;
			if (a0_158 != 0x00)
				goto l2304DC8A;
			s2 = (int32) (byte) ((word16) s2.u0 + 1);
		}
		Eq_7997 a0_198;
		word32 a1_448;
		word32 a2_449;
		word32 a3_450;
		word32 a4_451;
		word32 a5_452;
		word32 s0_453;
		word32 s1_454;
		word32 a1_455;
		word32 a2_456;
		word32 a4_457;
		word32 a5_458;
		word32 a7_459;
		word32 s4_460;
		word32 s5_461;
		word32 s6_462;
		word32 s7_463;
		word32 s8_464;
		word32 s9_465;
		word32 s10_466;
		word32 s11_467;
		ra = snprintf(ra, (word32) s0_127 + ((word32) strlen(s0_127, out a1_448, out a2_449, out a3_450, out a4_451, out a5_452) - 1), s3, &g_t23087A74, s2, dwLoc28, dwArg04, dwArg20, dwArg24_262, a5, dwArg6C, out s0_453, out s1_454, out a0_198, out a1_455, out a2_456, out a3, out a4_457, out a5_458, out a7_459, out s2, out s3, out s4_460, out s5_461, out s6_462, out s7_463, out s8_464, out s9_465, out s10_466, out s11_467);
		a5_182.u0 = -45;
		if (a0_198 >= 0x00)
		{
			a5_182.u0 = 0x00;
			if (a0_198 >= s3)
				goto l2304DD10;
		}
l2304DC8A:
		0x00 = (uint16) dwArg0178;
		a0Out = a5_182;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		return ra;
	}
}

// 2304DD76: Register Eq_2 FillWithClientTokenSize(Register Eq_2 ra, Register Eq_2 a0, Register Eq_7997 a1, Register (ptr32 Eq_258123) a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg64, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aws_iot_finalize_json_document
Eq_2 FillWithClientTokenSize(Eq_2 ra, Eq_2 a0, Eq_7997 a1, struct Eq_258123 * a4, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg64, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgCC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	a4->dw0001 = a4->dw0000;
	ptr32 a0_16;
	ptr32 a3_19;
	ptr32 s0_24;
	ptr32 s1_25;
	ptr32 s2_28;
	ptr32 s3_29;
	word32 a1_52;
	word32 a2_53;
	word32 a4_54;
	word32 a5_55;
	word32 a7_56;
	word32 s4_57;
	word32 s5_58;
	word32 s6_59;
	word32 s7_60;
	word32 s8_61;
	word32 s9_62;
	word32 s10_63;
	word32 s11_64;
	Eq_2 ra_23 = snprintf(ra, a0, a1, &g_t23087AE8, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out s0_24, out s1_25, out a0_16, out a1_52, out a2_53, out a3_19, out a4_54, out a5_55, out a7_56, out s2_28, out s3_29, out s4_57, out s5_58, out s6_59, out s7_60, out s8_61, out s9_62, out s10_63, out s11_64);
	s0Out = s0_24;
	s1Out = s1_25;
	a0Out = a0_16;
	a3Out = a3_19;
	s2Out = s2_28;
	s3Out = s3_29;
	return ra_23;
}

// 2304DD9A: Register Eq_2 aws_iot_finalize_json_document(Register Eq_2 ra, Register Eq_2 a0, Register int32 a1, Register Eq_2 s3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_8028 a0Out, Register out ptr32 a3Out)
// Called from:
//      aws_main_entry
Eq_2 aws_iot_finalize_json_document(Eq_2 ra, Eq_2 a0, int32 a1, Eq_2 s3, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_8028 & a0Out, ptr32 & a3Out)
{
	if (a0 == 0x00)
	{
		a0Out.u0 = ~0x01;
		a3Out = a3;
		return ra;
	}
	Eq_8028 a5_147;
	word32 a1_289;
	word32 a2_290;
	word32 a4_291;
	word32 a5_292;
	ptr32 a3_107;
	Eq_7997 s3_26 = a1 - strlen(a0, out a1_289, out a2_290, out a3_107, out a4_291, out a5_292);
	if (s3_26 <= 0x01)
	{
l2304DDBA:
		a5_147.u0 = -45;
		goto l2304DDBE;
	}
	Eq_258206 a0_42;
	Eq_2 s0_50;
	word32 s1_51;
	Eq_7997 s2_54;
	Eq_258206 s3_55;
	word32 a1_293;
	word32 a2_294;
	word32 a3_295;
	word32 a4_296;
	word32 a5_297;
	word32 a1_298;
	word32 a2_299;
	word32 a4_300;
	word32 a5_301;
	word32 a7_302;
	word32 s4_303;
	word32 s5_304;
	word32 s6_305;
	word32 s7_306;
	word32 s8_307;
	word32 s9_308;
	word32 s10_309;
	word32 s11_310;
	ra = snprintf(ra, (word32) a0 + ((word32) strlen(a0, out a1_293, out a2_294, out a3_295, out a4_296, out a5_297) - 1), s3_26, &g_t23087A54, dwLoc08, dwArg18, dwArg44, dwArg60, s3, dwArg88, dwArgAC, out s0_50, out s1_51, out a0_42, out a1_298, out a2_299, out a3_107, out a4_300, out a5_301, out a7_302, out s2_54, out s3_55, out s4_303, out s5_304, out s6_305, out s7_306, out s8_307, out s9_308, out s10_309, out s11_310);
	if (a0_42 < 0x00)
		goto l2304DDBA;
	if (a0_42 < s3_55)
	{
		word32 a1_311;
		word32 a2_312;
		word32 a4_313;
		word32 a5_314;
		Eq_7997 s3_72 = s1_51 - strlen(s0_50, out a1_311, out a2_312, out a3_107, out a4_313, out a5_314);
		if (s2_54 >= s3_72)
			goto l2304DDBA;
		struct Eq_258123 * a4_76;
		Eq_258282 a0_82;
		Eq_2 s0_90;
		word32 s1_91;
		Eq_7997 s2_94;
		Eq_258282 s3_95;
		word32 a1_315;
		word32 a2_316;
		word32 a3_317;
		word32 a5_318;
		ra = FillWithClientTokenSize(ra, strlen(s0_50, out a1_315, out a2_316, out a3_317, out a4_76, out a5_318) + s0_50, s3_72, a4_76, dwLoc08, dwArg18, dwArg44, dwArg60, s3, dwArg88, dwArgAC, out s0_90, out s1_91, out a0_82, out a3_107, out s2_94, out s3_95);
		if (a0_82 < 0x00)
			goto l2304DDBA;
		if (a0_82 < s3_95)
		{
			word32 a1_319;
			word32 a2_320;
			word32 a4_321;
			word32 a5_322;
			Eq_7997 s1_112 = s1_91 - strlen(s0_90, out a1_319, out a2_320, out a3_107, out a4_321, out a5_322);
			if (s2_94 >= s1_112)
				goto l2304DDBA;
			Eq_258325 a0_124;
			Eq_258325 s1_133;
			word32 a1_323;
			word32 a2_324;
			word32 a3_325;
			word32 a4_326;
			word32 a5_327;
			word32 s0_328;
			word32 a1_329;
			word32 a2_330;
			word32 a4_331;
			word32 a5_332;
			word32 a7_333;
			word32 s2_334;
			word32 s3_335;
			word32 s4_336;
			word32 s5_337;
			word32 s6_338;
			word32 s7_339;
			word32 s8_340;
			word32 s9_341;
			word32 s10_342;
			word32 s11_343;
			ra = snprintf(ra, strlen(s0_90, out a1_323, out a2_324, out a3_325, out a4_326, out a5_327) + s0_90, s1_112, 587758320, dwLoc08, dwArg18, dwArg44, dwArg60, s3, dwArg88, dwArgAC, out s0_328, out s1_133, out a0_124, out a1_329, out a2_330, out a3_107, out a4_331, out a5_332, out a7_333, out s2_334, out s3_335, out s4_336, out s5_337, out s6_338, out s7_339, out s8_340, out s9_341, out s10_342, out s11_343);
			if (a0_124 < 0x00)
				goto l2304DDBA;
			a5_147.u0 = 0x00;
			if (a0_124 < s1_133)
			{
l2304DDBE:
				a0Out = a5_147;
				a3Out = a3_107;
				return ra;
			}
		}
	}
	a5_147.u0 = -44;
	goto l2304DDBE;
}

// 2304DE52: Register word32 isJsonValidAndParse(Register Eq_2 a0, Register Eq_2 a1, Stack word32 dwArg0C, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 s4Out)
// Called from:
//      shadow_delta_callback
//      AckStatusCallback
word32 isJsonValidAndParse(Eq_2 a0, Eq_2 a1, word32 dwArg0C, word32 dwArg0118, Eq_2 dwArg0128, ptr32 & a0Out, ptr32 & a2Out, ptr32 & s4Out)
{
	jsmn_init(0x420161D8);
	word32 * a0_30;
	ptr32 s4_37;
	word32 s1_48;
	byte * s2_49;
	word32 s5_116;
	word32 s3_115;
	jsmn_parse(&g_t420161D8, a0, a1, g_a42015A58, 0x0078, dwArg0C, dwArg0118, out s1_48, out a0_30, out s2_49, out s3_115, out s4_37, out s5_116);
	ptr32 a5_57 = 0x00;
	if (a0_30 > null)
	{
		a5_57 = 0x00;
		if ((word32) *s2_49 == 0x01)
		{
			*a0_30 = s1_48;
			a5_57 = 0x01;
		}
	}
	0x00 = (uint16) dwArg0128;
	a0Out = a5_57;
	a2Out = dwArg0100;
	s4Out = s4_37;
	return s1_48;
}

// 2304DEB2: Register Eq_2 isJsonKeyMatchingAndUpdateValue(Register Eq_2 ra, Register (ptr32 Eq_257468) a0, Register Eq_2 a2, Register (ptr32 Eq_2) a4, Register (ptr32 Eq_258456) a5, Register out (ptr32 Eq_258449) s0Out, Register out Eq_258450 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out (ptr32 Eq_2) a4Out, Register out (ptr32 Eq_258456) a5Out, Register out Eq_2 s2Out, Register out Eq_258456 s3Out, Register out ptr32 s4Out)
// Called from:
//      shadow_delta_callback
Eq_2 isJsonKeyMatchingAndUpdateValue(Eq_2 ra, struct Eq_257468 * a0, Eq_2 a2, union Eq_2 * a4, union Eq_258456 * a5, struct Eq_258449 & s0Out, union Eq_258450 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_258456 & a5Out, union Eq_2 & s2Out, union Eq_258456 & s3Out, ptr32 & s4Out)
{
	struct Eq_257468 * s1_26 = a0;
	union Eq_2 * s5_169 = a4;
	union Eq_258456 * s6_170 = a5;
	Eq_2 s2_107 = 0x01;
	Eq_258456 s3_103 = 0x42015A58;
	a2_41 = a2;
	while (true)
	{
		ptr32 a0_401;
		Eq_2 a2_41;
		if (s2_107 >= a2)
			break;
		word32 a0_50;
		struct Eq_257468 * s1_57;
		Eq_2 s4_58;
		word32 s8_59;
		word32 a2_563;
		word32 a5_566;
		word32 a4_565;
		word32 a3_564;
		word32 a1_562;
		struct Eq_258477 * s0_56 = jsoneq(s1_26, (s2_107 << 0x04) + 0x42015A58, a2_41, dwLoc0C, out s1_57, out a0_50, out a1_562, out a2_563, out a3_564, out a4_565, out a5_566, out s4_58, out s8_59);
		if (a0_50 == 0x00)
		{
			Eq_2 s2_85 = ((word32) s2_107 + 1 << 4) + 0x42015A58;
			word32 a1_571;
			word32 a3_573;
			word32 a2_572;
			word32 a4_574;
			word32 a5_575;
			word32 a6_576;
			word32 a7_577;
			memcpy(fp + -80, s2_85, 0x10, out a1_571, out a2_572, out a3_573, out a4_574, out a5_575, out a6_576, out a7_577);
			Eq_258450 a5_102 = *((word32) s2_85 + 8);
			s3_103 = *((word32) s2_85 + 4);
			up32 a1_113;
			word32 a2_578;
			word32 a3_579;
			word32 a4_580;
			word32 a5_581;
			word32 a6_582;
			word32 a7_583;
			memcpy(fp + -64, fp + -80, 0x10, out a1_113, out a2_578, out a3_579, out a4_580, out a5_581, out a6_582, out a7_583);
			s2_107 = a5_102 - s3_103;
			dwLoc4C = a5_102;
			a5 = (word32) s0_56->b000C;
			a4 = (union Eq_2 *) 0x08;
			if (a5 == (union Eq_258456 *) 0x08)
			{
				if (a5 != null)
					a4 = parseBooleanValue(fp + -64, s1_57, fp + -64, dwLoc18, out a5, out s2_107);
			}
			else if (a5 == null)
			{
				a5 = (union Eq_258456 *) 0x03;
				if (true)
					a4 = parseInteger32Value(ra, fp + -64, s1_57, fp + -64, a5_102, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
			}
			else
			{
				a4 = (union Eq_2 *) 0x01;
				if (a5 == (union Eq_258456 *) 0x01)
				{
					if (a5 < (union Eq_258456 *) 0x01)
						a4 = parseInteger16Value(ra, fp + -64, s1_57, fp + -64, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
				}
				else if (a5 == (union Eq_258456 *) 0x02)
				{
					if (a5 != null)
						a4 = parseInteger8Value(ra, fp + -64, s1_57, fp + -64, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
				}
				else if (a5 == (union Eq_258456 *) 0x03)
				{
					if (a5 < (union Eq_258456 *) 0x01)
					{
						word32 s0_584;
						word32 s1_585;
						word32 a0_586;
						word32 a3_587;
						word32 s4_588;
						parseUnsignedInteger32Value(ra, s1_57, fp + -64, a5_102, out s0_584, out s1_585, out a0_586, out a3_587, out a4, out a5, out s2_107, out s3_103, out s4_588, out s5_169, out s6_170);
					}
				}
				else if (a5 == (union Eq_258456 *) 0x04)
				{
					if (a5 > (union Eq_258456 *) 0x01)
						a4 = parseUnsignedInteger16Value(ra, s1_57, fp + -64, a5_102, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
				}
				else
				{
					a4 = (union Eq_2 *) 0x05;
					if (a5 == (union Eq_258456 *) 0x05)
					{
						if (a5 != null)
							a4 = parseUnsignedInteger8Value(ra, s1_57, fp + -64, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
					}
					else
					{
						a4 = (union Eq_2 *) 0x06;
						if (a5 == (union Eq_258456 *) 0x06)
						{
							a5 = (union Eq_258456 *) 0x03;
							if (true)
								a4 = parseFloatValue(ra, fp + -64, s1_57, fp + -64, a5_102, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
						}
						else
						{
							a4 = (union Eq_2 *) 0x07;
							if (a5 == (union Eq_258456 *) 0x07)
							{
								if (a5 < (union Eq_258456 *) 0x07)
									a4 = parseDoubleValue(ra, fp + -64, s1_57, fp + -64, a5_102, out a5, out s2_107, out s3_103, out s5_169, out s6_170);
							}
							else
							{
								a4 = (union Eq_2 *) 0x09;
								if (a5 == (union Eq_258456 *) 0x09)
									a4 = parseStringValue(s1_57, fp + -64, a1_113, s1_57, fp + -64, out a5);
							}
						}
					}
				}
			}
			*s6_170 = (union Eq_258456 *) s3_103;
			*s5_169 = (union Eq_2 *) s2_107;
			a0_401 = 0x01;
			goto l2304DF44;
		}
		word32 a0_67;
		word32 a1_567;
		word32 a3_568;
		word32 s4_569;
		word32 s8_570;
		jsoneq(s1_57, s4_58, s8_59 + -0x0504, dwLoc0C, out s1_26, out a0_67, out a1_567, out a2_41, out a3_568, out a4, out a5, out s4_569, out s8_570);
		if (a0_67 == 0x00)
			break;
		s2_107 = (word32) s2_107 + 1;
	}
	a0_401 = 0x00;
l2304DF44:
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a0_401;
	a2Out = dwArg01A8;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_107;
	s3Out = s3_103;
	s4Out = dwArg0168;
	return dwLoc08;
}

