pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304E042: Register word32 extractClientToken(Register Eq_2 a0, Register Eq_2 a1, Stack word32 dwArg0C, Stack Eq_2 dwArg14, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_257466 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_257468) s2Out, Register out Eq_257466 s3Out, Register out ptr32 s4Out, Register out Eq_257471 s5Out)
// Called from:
//      aws_iot_shadow_internal_action
//      AckStatusCallback
word32 extractClientToken(Eq_2 a0, Eq_2 a1, word32 dwArg0C, Eq_2 dwArg14, word32 dwArg0118, Eq_2 dwArg0128, union Eq_257466 & s1Out, ptr32 & a0Out, struct Eq_257468 & s2Out, union Eq_257466 & s3Out, ptr32 & s4Out, union Eq_257471 & s5Out)
{
	ptr32 a0_118;
	jsmn_init(0x420161D8);
	Eq_257466 a0_38;
	struct Eq_257468 * s2_57;
	Eq_257471 s5_61;
	word32 s4_239;
	Eq_257466 s1_193;
	Eq_257466 s3_203;
	struct Eq_258426 * s0_43 = jsmn_parse(&g_t420161D8, a0, a1, g_a42015A58, 0x0078, dwArg0C, dwArg0118, out s1_193, out a0_38, out s2_57, out s3_203, out s4_239, out s5_61);
	if (a0_38 > 0x00)
	{
		struct Eq_258477 * s0_65 = &s0_43->bFFFFFA58;
		if ((word32) s0_43->bFFFFFA58 == 0x01)
		{
			s3_203 = a0_38;
			s1_193.u0 = 0x01;
			do
			{
				if (s1_193 == a0_38)
					goto l2304E086;
				word32 a0_82;
				struct Eq_258888 * a1_83;
				word32 s1_89;
				Eq_2 s4_90;
				word32 a4_242;
				word32 a5_243;
				word32 s8_244;
				word32 a2_240;
				word32 a3_241;
				s0_65 = jsoneq(s2_57, s0_65 + (s1_193 << 0x04) / 0x0D, 587758152, dwArg14, out s1_89, out a0_82, out a1_83, out a2_240, out a3_241, out a4_242, out a5_243, out s4_90, out s8_244);
				s1_193 = s1_89 + 0x01;
			} while (a0_82 != 0x00);
			ui32 s0_100 = a1_83->ptr0004->dw0008 - a1_83;
			s1_193 = s1_89 + 0x01 << 4;
			if (s5_61 >= (s0_100 & 0x00FF) + 1)
			{
				word32 a3_245;
				word32 a4_246;
				word32 a5_247;
				strncpy(s4_90, a1_83 + s2_57, s0_100 & 0x00FF, out a3_245, out a4_246, out a5_247);
				Mem117[(s0_100 & 0x00FF) + s4_90:byte] = 0x00;
				a0_118 = 0x01;
l2304E088:
				0x00 = (uint16) dwArg0128;
				s1Out = s1_193;
				a0Out = a0_118;
				s2Out = s2_57;
				s3Out = s3_203;
				s4Out = dwArg78;
				s5Out = s5_61;
				return dwArgE4;
			}
		}
	}
l2304E086:
	a0_118 = 0x00;
	goto l2304E088;
}

// 2304E0F4: Register Eq_2 extractVersionNumber(Register Eq_2 ra, Register (ptr32 Eq_257468) a0, Register Eq_2 a2, Register Eq_258450 s4, Stack Eq_2 dwArg24, Stack word32 dwArgA8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out)
// Called from:
//      shadow_delta_callback
//      AckStatusCallback
Eq_2 extractVersionNumber(Eq_2 ra, struct Eq_257468 * a0, Eq_2 a2, Eq_258450 s4, Eq_2 dwArg24, word32 dwArgA8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s4Out)
{
	struct Eq_257468 * s3_22 = a0;
	Eq_2 s4_24 = a2;
	Eq_2 s0_27 = 0x01;
	ptr32 s1_146 = 0x42015A58;
	word32 s6_29 = 0x23088000;
	do
	{
		ptr32 a0_130;
		if (s0_27 >= s4_24)
		{
			a0_130 = 0x00;
			goto l2304E120;
		}
		ui32 s2_32 = s0_27 << 0x04;
		word32 a0_41;
		word32 a1_179;
		word32 a2_180;
		word32 a5_181;
		word32 s8_182;
		s0_27 = (char *) jsoneq(s3_22, s1_146 + s2_32, s6_29 + -1292, dwArg24, out s1_146, out a0_41, out a1_179, out a2_180, out a3, out a4, out a5_181, out s4_24, out s8_182) + 1;
		if (a0_41 != 0x00)
			continue;
		word32 a0_62;
		word32 a5_183;
		word32 s2_184;
		word32 s5_185;
		ra = parseUnsignedInteger32Value(ra, s3_22, s2_32 + 16 + s1_146, s4, out s0_27, out s1_146, out a0_62, out a3, out a4, out a5_183, out s2_184, out s3_22, out s4_24, out s5_185, out s6_29);
	} while (a0_62 != 0x00);
	a0_130 = 0x01;
l2304E120:
	0x00 = dwArgA8;
	s1Out = s1_146;
	a0Out = a0_130;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4;
	s4Out = dwArg04;
	return ra;
}

// 2304E15E: void shadow_delta_callback(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register word32 s4, Stack word32 dwArg78, Stack Eq_2 dwArg94, Stack word32 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void shadow_delta_callback(Eq_2 ra, Eq_2 a1, Eq_2 a2, word32 s4, word32 dwArg78, Eq_2 dwArg94, word32 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128)
{
	if (a2 <= 0x0200)
	{
		struct Eq_259039 * a4_25;
		word32 a3_365;
		word32 a6_367;
		word32 a5_366;
		word32 a2_364;
		word32 a1_363;
		word32 a7_368;
		memcpy(1107427036, a1, a2, out a1_363, out a2_364, out a3_365, out a4_25, out a5_366, out a6_367, out a7_368);
		a4_25->b4201FEDC = 0x00;
		word32 a0_46;
		word32 s4_369;
		Eq_2 a2_107;
		Eq_2 s1_126 = isJsonValidAndParse(1107427036, 513, s4, dwArgE8, dwArgF8, out a0_46, out a2_107, out s4_369);
		if (a0_46 == 0x00)
			goto l2304E1EC;
		if ((word32) g_b4200D964 != 0x00)
		{
			0x00 = 0x00;
			word32 a0_80;
			word32 * a3_83;
			word32 * a4_84;
			word32 s4_370;
			ra = extractVersionNumber(ra, (word32) s1_126 - 292, a2_107, (word32) s1_126 - 292, dwLoc0C, dwArg78, out s1_126, out a0_80, out a2_107, out a3_83, out a4_84, out s4_370);
			if (a0_80 != 0x00)
			{
				a2_107 = dwArg94;
				word32 a5_108 = *a3_83;
				if (a3_83 >= a4_84)
					goto l2304E1EC;
				*a4_84 = a5_108;
			}
		}
		struct Eq_259079 * s0_111 = &g_t420161E4;
		Eq_259081 s2_112 = 0x00;
		union Eq_259081 * s3_113 = &g_t4200E000;
		while (s2_112 < *s3_113)
		{
			if ((word32) s0_111->b000C == 0x00)
			{
				0x00 = 0x00;
				word32 a0_130;
				word32 s4_139;
				word32 a4_147;
				struct Eq_259130 * a5_148;
				ra = isJsonKeyMatchingAndUpdateValue(ra, (word32) s1_126 - 292, a2_107, fp + -40, fp + -44, out s0_111, out s1_126, out a0_130, out a2_107, out a4_147, out a5_148, out s2_112, out s3_113, out s4_139);
				if (a0_130 != 0x00)
				{
					s0_111 = a5_148->ptr0008;
					if (a5_148 != null)
						a5_148();
				}
			}
			s2_112 = (word32) s2_112.u1 + 1;
			++s0_111;
		}
	}
l2304E1EC:
	0x00 = dwArg0128;
}

// 2304E22A: Register ui32 findIndexOfSubscriptionList(Register Eq_2 a0, Register out Eq_2 s1Out, Register out Eq_259164 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      unsubscribeFromAcceptedAndRejected
ui32 findIndexOfSubscriptionList(Eq_2 a0, union Eq_2 & s1Out, union Eq_259164 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & s2Out)
{
	Eq_2 s1_17 = 0x42020180;
	ui32 s0_18 = 0x00;
	do
	{
		Eq_259164 a0_43;
		if ((word32) *((word32) s1_17 + 81) == 0x00)
		{
			word32 a1_119;
			word32 a2_120;
			word32 a4_121;
			word32 a5_122;
			if (strcmp(a0, s1_17, out a1_119, out a2_120, out a3, out a4_121, out a5_122) == 0x00)
			{
				a0_43.u0 = (int32) (word16) s0_18;
				goto l2304E25A;
			}
		}
		ui32 s0_37 = s0_18 + 0x01;
		s0_18 = s0_37 & 0x00FF;
		s1_17 = (word32) s1_17 + 83;
	} while ((s0_37 & 0x00FF) != 0x14);
	a0_43.u0 = ~0x00;
l2304E25A:
	s1Out = s1_17;
	a0Out = a0_43;
	a2Out = dwArg48;
	a3Out = a3;
	s2Out = 0x14;
	return s0_18;
}

// 2304E27A: Register Eq_2 topicNameFromThingAndAction(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register word32 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      unsubscribeFromAcceptedAndRejected
//      isSubscriptionPresent
//      subscribeToShadowActionAcks
//      incrementSubscriptionCnt
//      publishToShadowAction
Eq_2 topicNameFromThingAndAction(Eq_2 ra, Eq_2 a0, Eq_2 a2, word32 a3, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a1_23;
	if (a2 == 0x00)
		a1_23.u0 = 0x2308276C;
	else if (a2 == 0x01)
		a1_23.u0 = 587758404;
	else
	{
		if (a2 != 0x02)
			goto l2304E29C;
		a1_23.u0 = 587758412;
	}
	word32 a3_231;
	word32 a4_232;
	word32 a5_233;
	strncpy(fp + -40, a1_23, 0x0A, out a3_231, out a4_232, out a5_233);
l2304E29C:
	ptr32 s10_124;
	ptr32 s1_123;
	Eq_2 ra_121;
	ptr32 s2_126;
	ptr32 s11_125;
	ptr32 s5_129;
	ptr32 s6_130;
	ptr32 s7_131;
	ptr32 s8_132;
	Eq_2 a1_86;
	if (a3 == 0x00)
		a1_86.u0 = 587758348;
	else
	{
		if (a3 != 0x01)
		{
			word32 s0_234;
			word32 a0_235;
			word32 a1_236;
			word32 a2_237;
			word32 a3_238;
			word32 a4_239;
			word32 a5_240;
			word32 a7_241;
			word32 s3_242;
			word32 s4_243;
			word32 s9_244;
			ra_121 = snprintf(ra, a0, 80, &g_t23087B60, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_234, out s1_123, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out a7_241, out s2_126, out s3_242, out s4_243, out s5_129, out s6_130, out s7_131, out s8_132, out s9_244, out s10_124, out s11_125);
			goto l2304E2C8;
		}
		a1_86.u0 = 587758420;
	}
	word32 a3_245;
	word32 a4_246;
	word32 a5_247;
	strncpy(fp + -28, a1_86, 0x0A, out a3_245, out a4_246, out a5_247);
	word32 s0_248;
	word32 a0_249;
	word32 a1_250;
	word32 a2_251;
	word32 a3_252;
	word32 a4_253;
	word32 a5_254;
	word32 a7_255;
	word32 s3_256;
	word32 s4_257;
	word32 s9_258;
	ra_121 = snprintf(ra, a0, 80, &g_t23087B7C, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_248, out s1_123, out a0_249, out a1_250, out a2_251, out a3_252, out a4_253, out a5_254, out a7_255, out s2_126, out s3_256, out s4_257, out s5_129, out s6_130, out s7_131, out s8_132, out s9_258, out s10_124, out s11_125);
l2304E2C8:
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_123;
	s2Out = s2_126;
	s5Out = s5_129;
	s6Out = s6_130;
	s7Out = s7_131;
	s8Out = s8_132;
	s10Out = s10_124;
	s11Out = s11_125;
	return ra_121;
}

// 2304E322: Register Eq_2 unsubscribeFromAcceptedAndRejected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Register out ptr32 s0Out, Register out (ptr32 Eq_259361) s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      AckStatusCallback
//      HandleExpiredResponseCallbacks
Eq_2 unsubscribeFromAcceptedAndRejected(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, ptr32 & s0Out, struct Eq_259361 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	struct Eq_259367 * s0_32;
	word32 s1_412;
	word32 s5_414;
	word32 s2_413;
	word32 s7_415;
	word32 s8_416;
	word32 s10_417;
	word32 s11_418;
	word32 s0_411;
	word32 s11_410;
	word32 s10_409;
	word32 s8_408;
	word32 s7_407;
	word32 s6_406;
	word32 s5_405;
	word32 s2_404;
	word32 s1_403;
	Eq_2 s6_150;
	Eq_2 ra_135 = topicNameFromThingAndAction(topicNameFromThingAndAction(ra, fp + -0x00B0, (word32) *((word32) a0 + 0x4202090A), 0x00, dwLocA8, dwLoc7C, s2, s0, dwLoc38, dwLoc14, dwArg78, out s0_32, out s1_403, out s2_404, out s5_405, out s6_406, out s7_407, out s8_408, out s10_409, out s11_410), fp + -96, (word32) s0_32->b006E, 0x01, dwLocA8, dwLoc7C, s2, s0, dwLoc38, dwLoc14, dwArg78, out s0_411, out s1_412, out s2_413, out s5_414, out s6_150, out s7_415, out s8_416, out s10_417, out s11_418);
	struct Eq_259428 * a0_81;
	word32 a3_421;
	word32 s1_419;
	word32 a2_420;
	word32 s2_422;
	findIndexOfSubscriptionList(fp + -0x00B0, out s1_419, out a0_81, out a2_420, out a3_421, out s2_422);
	if (a0_81 >= null)
	{
		up32 s0_105 = (word32) a0_81->b42020223;
		if ((word32) a0_81->b42020225 == 0x00 && s0_105 == 0x01)
		{
			Eq_2 s2_117 = g_t420207FC;
			Eq_2 a3_120;
			Eq_2 a4_121;
			word32 a1_423;
			word32 a2_424;
			word32 a5_425;
			strlen(fp + -0x00B0, out a1_423, out a2_424, out a3_120, out a4_121, out a5_425);
			word32 a0_130;
			word32 s0_136;
			struct Eq_259494 * s1_137;
			word32 a3_427;
			word32 a2_426;
			word32 s5_429;
			word32 s2_428;
			ra_135 = aws_iot_mqtt_unsubscribe(ra_135, (char *) a0_81 + 0x420201D3, s2_117, fp + -0x00B0, a3_120, a4_121, s6_150, mstatus, dwLocAC, dwLoc9C, dwLoc88, dwLoc48, dwLoc38, dwLoc28, dwArg08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg5C, out s0_136, out s1_137, out a0_130, out a2_426, out a3_427, out s2_428, out s5_429, out s6_150, out mstatus);
			if (a0_130 == 0x00)
				s1_137->b0051 = (byte) s0_136;
		}
		else if (s0_105 > 0x01)
			a0_81->b42020223 = (byte) (s0_105 + ~0x00);
	}
	struct Eq_259444 * a0_163;
	ptr32 s2_169;
	struct Eq_259361 * s1_168;
	ptr32 a3_175;
	ptr32 a2_164;
	ptr32 s0_167 = findIndexOfSubscriptionList(fp + -96, out s1_168, out a0_163, out a2_164, out a3_175, out s2_169);
	if (a0_163 >= null)
	{
		s1_168 = (struct Eq_259361 *) ((char *) a0_163 + 0x420201D3);
		s0_167 = (word32) a0_163->b42020223;
		if ((word32) a0_163->b42020225 == 0x00 && s0_167 == 0x01)
		{
			Eq_2 s2_201 = g_t420207FC;
			Eq_2 a3_204;
			Eq_2 a4_205;
			word32 a1_430;
			word32 a2_431;
			word32 a5_432;
			strlen(fp + -96, out a1_430, out a2_431, out a3_204, out a4_205, out a5_432);
			word32 a0_219;
			word32 s5_433;
			word32 s6_434;
			ra_135 = aws_iot_mqtt_unsubscribe(ra_135, (char *) a0_163 + 0x420201D3, s2_201, fp + -96, a3_204, a4_205, s6_150, mstatus, dwLocAC, dwLoc9C, dwLoc88, dwLoc48, dwLoc38, dwLoc28, dwArg08, dwArg18, dwArg28, dwArg48, dwArg58, dwArg5C, out s0_167, out s1_168, out a0_219, out a2_164, out a3_175, out s2_169, out s5_433, out s6_434, out mstatus);
			if (a0_219 == 0x00)
				s1_168->b0051 = (byte) s0_167;
		}
		else if (s0_167 > 0x01)
		{
			a0_163->b42020223 = (byte) (s0_167 + ~0x00);
			s0_167 += ~0x00;
		}
	}
	s0Out = s0_167;
	s1Out = s1_168;
	a2Out = a2_164;
	a3Out = a3_175;
	a4Out = dwArg80;
	s2Out = s2_169;
	mstatusOut = mstatus;
	return ra_135;
}

// 2304E440: void AckStatusCallback(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack word32 dwArg68, Stack Eq_2 dwArg78)
void AckStatusCallback(Eq_2 ra, Eq_2 a1, Eq_2 a2, ptr32 mstatus, word32 dwArg68, Eq_2 dwArg78)
{
	if (a2 > 0x0200)
		return;
	struct Eq_259632 * a4_34;
	word32 a6_539;
	word32 a7_540;
	word32 a3_537;
	word32 a5_538;
	word32 a1_535;
	word32 a2_536;
	memcpy(1107427036, a1, a2, out a1_535, out a2_536, out a3_537, out a4_34, out a5_538, out a6_539, out a7_540);
	a4_34->b4201FEDC = 0x00;
	struct Eq_259653 * sp_287 = fp + -0x00B0;
	word32 a0_55;
	word32 a2_541;
	Eq_258450 s4_146;
	Eq_2 s1_64 = isJsonValidAndParse(1107427036, 513, dwLocA4, dwArg68, dwArg78, out a0_55, out a2_541, out s4_146);
	if (a0_55 == 0x00)
		return;
	word32 a5_545;
	word32 a3_543;
	word32 a4_544;
	word32 a1_542;
	if (strstr(ra, s1_64, 0x42020800, out a1_542, out a3_543, out a4_544, out a5_545) != 0x00)
	{
		word32 a3_550;
		word32 a1_549;
		word32 a4_551;
		word32 a5_552;
		if (strstr(ra, s1_64, 587758344, out a1_549, out a3_550, out a4_551, out a5_552) == 0x00)
		{
			word32 a1_553;
			word32 a3_554;
			word32 a4_555;
			word32 a5_556;
			if (strstr(ra, s1_64, 587758360, out a1_553, out a3_554, out a4_555, out a5_556) == 0x00)
				goto l2304E4C2;
		}
		word32 a0_131;
		word32 * a3_134;
		word32 * a4_135;
		word32 s1_557;
		word32 a2_558;
		ra = extractVersionNumber(ra, (word32) s4_146 - 292, dwLoc2C, s4_146, dwLoc8C, dwLoc08, out s1_557, out a0_131, out a2_558, out a3_134, out a4_135, out s4_146);
		if (a0_131 != 0x00)
		{
			word32 a5_159 = *a3_134;
			if (a3_134 < a4_135)
				*a4_135 = a5_159;
		}
	}
l2304E4C2:
	word32 a0_168;
	Eq_2 s1_177;
	word32 s4_182;
	word32 s3_547;
	word32 s5_548;
	word32 s2_546;
	extractClientToken((word32) s4_146 - 292, 513, dwLocA4, dwLoc9C, dwArg68, dwArg78, out s1_177, out a0_168, out s2_546, out s3_547, out s4_182, out s5_548);
	if (a0_168 != 0x00)
	{
		Eq_2 s3_197 = 0x42020814;
		Eq_2 s0_198 = 0x00;
		Eq_2 s2_199 = 0x42020814;
		do
		{
			Eq_2 s6_206 = s0_198 & 0x00FF;
			if ((word32) s3_197.u22->b0078 == 0x00)
			{
				word32 s5_211 = (word32) s0_198 + 0x0088;
				word32 a1_559;
				word32 a2_560;
				word32 a3_561;
				word32 a4_562;
				word32 a5_563;
				if (strcmp(s3_197, fp + -0x00A0, out a1_559, out a2_560, out a3_561, out a4_562, out a5_563) == 0x00)
				{
					word32 a2_245 = 0x02;
					word32 a1_564;
					word32 a3_565;
					word32 a5_566;
					struct Eq_259791 * a4_239;
					if (strstr(ra, s1_177, 587758348, out a1_564, out a3_565, out a4_239, out a5_566) == 0x00)
					{
						word32 a1_567;
						word32 a3_568;
						word32 a5_569;
						strstr(ra, s1_177, 587758420, out a1_567, out a3_568, out a4_239, out a5_569);
						a2_245 = 0x01;
					}
					<anonymous> * a6_268 = *((word32) s0_198 + 0x4202090C);
					if (a6_268 != null)
					{
						word32 a5_270 = a4_239->dw0074;
						word32 a4_303;
						word32 a6_304;
						word32 t1_305;
						word32 t5_306;
						word32 s10_307;
						word32 a7_308;
						word32 t0_309;
						word32 t3_310;
						word32 t4_311;
						word32 t6_312;
						word32 s11_313;
						word32 s9_314;
						word32 t2_315;
						word32 tp_316;
						a6_268();
					}
					word32 s0_340;
					ptr32 s2_344;
					word32 s1_570;
					word32 a2_571;
					word32 a3_572;
					word32 a4_573;
					word32 mstatus_574;
					unsubscribeFromAcceptedAndRejected(ra, s0_198, s6_206, s2_199, mstatus, sp_287->t0008, sp_287->t0018, sp_287->t0028, sp_287->t0048, sp_287->t0058, sp_287->t005C, sp_287->t0078, out s0_340, out s1_570, out a2_571, out a3_572, out a4_573, out s2_344, out mstatus_574);
					(s2_344 + (s0_340 + 0x0088))->b0078 = 0x01;
					return;
				}
			}
			s0_198 = (word32) s0_198 + 1;
			++s3_197.u22;
		} while (s0_198 != 0x0A);
	}
}

