pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304E5AA: Register word32 initDeltaTokens()
// Called from:
//      aws_iot_shadow_init
word32 initDeltaTokens()
{
	struct Eq_259894 * a5_10 = g_a420161F0;
	do
	{
		a5_10->b0000 = 0x01;
		++a5_10;
	} while (a5_10 != &g_t42016958);
	g_t4200E000.u0 = 0x00;
	g_b4200EFF8 = 0x00;
	return 0x01;
}

// 2304E5D4: Register word32 registerJsonTokenOnDelta(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_5763) a2, Register (ptr32 Eq_7368) a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out ptr32 a3Out)
// Called from:
//      aws_iot_shadow_register_delta
word32 registerJsonTokenOnDelta(Eq_2 ra, Eq_2 s1, struct Eq_5763 * a2, struct Eq_7368 * a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, ptr32 & a3Out)
{
	word32 a0_104 = 0x00;
	if ((word32) g_b4200DFF8 == 0x00)
	{
		Eq_2 s10_37;
		word32 s2_39;
		Eq_2 s6_43;
		word32 s11_237;
		word32 s9_236;
		word32 s8_235;
		word32 s7_234;
		word32 s5_233;
		word32 s4_232;
		word32 s3_231;
		word32 a7_230;
		word32 a5_229;
		word32 a4_228;
		word32 a3_227;
		word32 a2_226;
		word32 a1_225;
		word32 a0_224;
		word32 s1_223;
		word32 s0_222;
		snprintf(ra, 0x42020130, 80, &g_t23087B20, dwLoc08, dwArg18, dwArg44, dwArg60, s3, dwArg88, dwArgAC, out s0_222, out s1_223, out a0_224, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229, out a7_230, out s2_39, out s3_231, out s4_232, out s5_233, out s6_43, out s7_234, out s8_235, out s9_236, out s10_37, out s11_237);
		Eq_2 s3_51 = g_t420207FC;
		word32 a1_238;
		word32 a2_239;
		word32 a3_240;
		word32 a4_241;
		word32 a5_242;
		strlen(s2_39 + 304, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242);
		byte * s0_72;
		word32 s1_243;
		word32 a3_244;
		word32 s2_245;
		word32 s3_246;
		word32 s4_247;
		word32 s5_248;
		word32 s6_249;
		word32 s7_250;
		word32 s10_251;
		word32 mstatus_252;
		aws_iot_mqtt_subscribe(s3_51, s2_39 + 304, 0x00, 587522398, s6_43, s10_37, mstatus, dwLoc1C, dwLoc0C, dwArg08, dwArg48, dwArg58, s1, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, out s0_72, out s1_243, out a0_104, out a2, out a3_244, out a4, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s10_251, out mstatus_252);
		*s0_72 = 0x01;
	}
	ptr32 a3_102 = a4->ptr0000;
	if (a4 <= (struct Eq_7368 *) 0x0077)
	{
		struct Eq_260024 * a1_109 = a4 << 0x04;
		a2->dw0000 = (char *) a1_109 + 0x420161E4;
		a2->ptr0010->dw0004 = (char *) a1_109 + 0x420161E4;
		a2->dw0008 = (char *) a1_109 + 0x420161E4;
		a1_109->b420161F0 = 0x00;
		a4->ptr0001 = a3_102;
	}
	else
		a0_104 = ~0x00;
	a3Out = a3_102;
	return a0_104;
}

// 2304E688: Register word32 initializeRecords(Register Eq_2 a0)
// Called from:
//      aws_iot_shadow_connect
word32 initializeRecords(Eq_2 a0)
{
	struct Eq_260051 * a5_10 = g_a4202088C;
	do
	{
		a5_10->b0000 = 0x01;
		++a5_10;
	} while (a5_10 != &g_t42020CEC);
	struct Eq_260061 * a5_13 = &g_t42020180;
	do
	{
		a5_13->b0051 = 0x01;
		a5_13->b0050 = 0x00;
		a5_13->b0052 = 0x00;
		++a5_13;
	} while (a5_13 != &g_t420207FC);
	g_t420207FC = a0;
	return 0x42020000;
}

// 2304E6CE: Register Eq_2 isSubscriptionPresent(Register Eq_2 ra, Register Eq_2 a1, Stack Eq_2 dwArg68, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      aws_iot_shadow_internal_action
Eq_2 isSubscriptionPresent(Eq_2 ra, Eq_2 a1, Eq_2 dwArg68, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s10Out)
{
	Eq_2 s1_31;
	Eq_2 s0_62;
	ptr32 s7_71;
	word32 s10_241;
	word32 s11_242;
	word32 s5_238;
	word32 s6_239;
	word32 s8_240;
	word32 s11_235;
	word32 s1_236;
	word32 s2_237;
	word32 s10_234;
	word32 s8_233;
	word32 s7_232;
	word32 s2_229;
	word32 s5_230;
	word32 s6_231;
	word32 s0_228;
	Eq_2 ra_61 = topicNameFromThingAndAction(topicNameFromThingAndAction(ra, fp + -0x00C0, a1, 0x00, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, dwArg68, out s0_228, out s1_31, out s2_229, out s5_230, out s6_231, out s7_232, out s8_233, out s10_234, out s11_235), fp + -112, s1_31, 0x01, dwLocB8, dwLoc8C, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, dwArg68, out s0_62, out s1_236, out s2_237, out s5_238, out s6_239, out s7_71, out s8_240, out s10_241, out s11_242);
	ptr32 s1_110 = 0x00;
	ptr32 s2_117 = 0x00;
	s0_112 = s0_62;
	do
	{
		Eq_2 s0_112;
		if ((word32) *((word32) s0_112 + 81) == 0x00)
		{
			word32 a5_247;
			word32 a2_244;
			word32 a3_245;
			word32 a4_246;
			word32 a1_243;
			if (strcmp(fp + -0x00C0, s0_112, out a1_243, out a2_244, out a3_245, out a4_246, out a5_247) != 0x00)
			{
				word32 a4_251;
				word32 a5_252;
				word32 a3_250;
				word32 a1_248;
				word32 a2_249;
				if (strcmp(fp + -112, s0_112, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252) == 0x00)
					s1_110 = 0x01;
			}
			else
				s2_117 = 0x01;
		}
		s0_112 = (word32) s0_112 + 83;
	} while (s0_112 != (word32) s0_62 + 1660);
	if (s1_110 != 0x00)
		s1_110 = s2_117;
	s0Out = s0_112;
	a0Out = s1_110;
	s2Out = dwArg98;
	s7Out = s7_71;
	s10Out = dwArg54;
	return ra_61;
}

// 2304E742: Register Eq_2 subscribeToShadowActionAcks(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_internal_action
Eq_2 subscribeToShadowActionAcks(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 s2, Eq_2 s7, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_260189 * a4_15 = &g_a420201D0->b0001;
	struct Eq_260191 * a3_16 = &g_a420201D0->b0001;
	struct Eq_260193 * a5_39 = null;
	ptr32 s5_156 = 0x42020180;
	do
	{
		int32 s3_166;
		ui32 a1_46 = a5_39 & 0x00FF;
		if ((word32) a3_16->b0000 != 0x00)
		{
			a5_39[0x42020224] = (struct Eq_260193) 0x00;
			s3_166 = (int32) (word16) a1_46;
			goto l2304E79A;
		}
		++a5_39;
		++a3_16;
	} while (a5_39 != (struct Eq_260193 *) 0x14);
	s3_166 = ~0x00;
l2304E79A:
	Eq_2 s0_152 = 0x00;
	do
	{
		ptr32 s2_176;
		Eq_2 s6_157;
		ui32 s6_64 = s0_152 & 0x00FF;
		if ((word32) a4_15->b0000 != 0x00)
		{
			struct Eq_260218 * s0_74 = (word32) s0_152 + 83;
			s0_74->b420201D1 = 0x00;
			s6_157 = (int32) (word16) s6_64;
			s2_176 = 0x00;
			s0_152 = (char *) s0_74 + 0x42020180;
			if (s3_166 == ~0x00)
				goto l2304E8D6;
			Eq_2 s1_112;
			Eq_2 s10_113;
			struct Eq_260244 * s11_114;
			Eq_2 s6_119;
			word32 s8_121;
			word32 s0_728;
			word32 s7_731;
			word32 s2_729;
			word32 s5_730;
			topicNameFromThingAndAction(ra, s3_166 + 0x420201D3, a1, 0x00, dwLoc58, dwLoc2C, dwLoc10, dwLoc0C, dwArg18, s7, dwArgC8, out s0_728, out s1_112, out s2_729, out s5_730, out s6_119, out s7_731, out s8_121, out s10_113, out s11_114);
			Eq_2 s2_130 = s11_114->t07FC;
			word32 a1_732;
			word32 a2_733;
			word32 a4_735;
			word32 a5_736;
			word32 a3_734;
			strlen(s1_112, out a1_732, out a2_733, out a3_734, out a4_735, out a5_736);
			ptr32 a0_148;
			word32 s4_155;
			Eq_2 s10_174;
			word32 a2_737;
			word32 a3_738;
			word32 a4_739;
			word32 s2_740;
			word32 s7_741;
			ra = aws_iot_mqtt_subscribe(s2_130, s1_112, 0x00, s8_121 + 0x0440, s6_119, s10_113, mstatus, dwLoc5C, dwLoc4C, s2, dwArg08, dwArg18, dwArg28, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, out s0_152, out s1, out a0_148, out a2_737, out a3_738, out a4_739, out s2_740, out s3_166, out s4_155, out s5_156, out s6_157, out s7_741, out s10_174, out mstatus);
			s2_176 = a0_148;
			if (a0_148 != 0x00)
				goto l2304E89A;
			((word32) s1 + 80)->u1 = 0x01;
			((word32) s1 + 82)->u1 = (byte) s4_155;
			Eq_2 s0_192;
			Eq_2 s10_194;
			struct Eq_260341 * s11_195;
			Eq_2 s6_200;
			word32 s8_202;
			word32 s2_743;
			word32 s1_742;
			word32 s5_744;
			word32 s7_745;
			topicNameFromThingAndAction(ra, s0_152, s10_174, 0x01, dwLoc58, dwLoc2C, dwLoc10, dwLoc0C, dwArg18, s7, dwArgC8, out s0_192, out s1_742, out s2_743, out s5_744, out s6_200, out s7_745, out s8_202, out s10_194, out s11_195);
			Eq_2 s1_211 = s11_195->t07FC;
			word32 a2_747;
			word32 a1_746;
			word32 a3_748;
			word32 a4_749;
			word32 a5_750;
			strlen(s0_192, out a1_746, out a2_747, out a3_748, out a4_749, out a5_750);
			ptr32 a0_225;
			word32 s4_232;
			word32 s7_249;
			word32 a2_751;
			word32 s2_752;
			word32 s10_753;
			Eq_2 a4_240;
			Eq_2 a3_227;
			ra = aws_iot_mqtt_subscribe(s1_211, s0_192, 0x00, s8_202 + 0x0440, s6_200, s10_194, mstatus, dwLoc5C, dwLoc4C, s2, dwArg08, dwArg18, dwArg28, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, out s0_152, out s1, out a0_225, out a2_751, out a3_227, out a4_240, out s2_752, out s3_166, out s4_232, out s5_156, out s6_157, out s7_249, out s10_753, out mstatus);
			s2_176 = a0_225;
			if (a0_225 != 0x00)
				goto l2304E89A;
			((word32) s0_152 + 80)->u1 = (byte) s7_249;
			((word32) s0_152 + 82)->u1 = (byte) s4_232;
			init_timer(fp + -76);
			word32 s1_754;
			word32 a1_755;
			Eq_2 a2_331;
			s0_152 = countdown_sec(ra, fp + -76, 0x02, a3_227, s10, dwArg00, dwArg04, dwArg28, ra, out s1_754, out a1_755, out a2_331);
			do
			{
				word32 a0_345;
				word32 s2_758;
				word32 s3_759;
				word32 s4_760;
				word32 s8_761;
				word32 a5_757;
				word32 a1_756;
				has_timer_expired(a2_331, a3_227, a4_240, mstatus, dwLoc4C, s10, dwLoc28, dwArgC8, dwArg0108, out a0_345, out a1_756, out a2_331, out a3_227, out a4_240, out a5_757, out s2_758, out s3_759, out s4_760, out s8_761);
			} while (a0_345 == 0x00);
			goto l2304E856;
		}
		s0_152 = (word32) s0_152 + 1;
		++a4_15;
	} while (s0_152 != 0x14);
	if (s3_166 != ~0x00)
	{
		s6_157.u0 = ~0x00;
		s2_176 = 0x00;
l2304E89A:
		Eq_2 a1_259 = s3_166 + 83 + s5_156;
		word32 a4_261 = (word32) *((word32) a1_259 + 80);
		((word32) a1_259 + 81)->u1 = 0x01;
		if (a4_261 == 0x01)
		{
			Eq_2 s0_265 = g_t420207FC;
			Eq_2 a3_269;
			Eq_2 a4_270;
			Eq_2 a1_272;
			word32 a2_762;
			word32 a5_763;
			strlen(a1_259, out a1_272, out a2_762, out a3_269, out a4_270, out a5_763);
			word32 a3_767;
			word32 s1_764;
			word32 a0_765;
			word32 a2_766;
			aws_iot_mqtt_unsubscribe(ra, s1, s0_265, a1_272, a3_269, a4_270, s6_157, mstatus, dwLoc5C, dwLoc4C, s2, dwArg08, dwArg18, dwArg28, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgAC, out s0_152, out s1_764, out a0_765, out a2_766, out a3_767, out s2_176, out s5_156, out s6_157, out mstatus);
		}
		if (s6_157 != ~0x00)
		{
l2304E8D6:
			(s5_156 + ((word32) s6_157 + 83))->b0051 = 0x01;
		}
	}
	else
	{
l2304E856:
		s2_176 = 0x00;
	}
	s0Out = s0_152;
	a0Out = s2_176;
	s2Out = s2_176;
	s4Out = dwArgDC;
	s5Out = s4;
	mstatusOut = mstatus;
	return dwArg68;
}

// 2304E8E8: Register Eq_2 incrementSubscriptionCnt(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 s2, Stack Eq_2 dwArg78, Register out Eq_2 s0Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      aws_iot_shadow_internal_action
Eq_2 incrementSubscriptionCnt(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 s2, Eq_2 dwArg78, union Eq_2 & s0Out, ptr32 & s2Out, ptr32 & s5Out)
{
	Eq_2 s1_31;
	Eq_2 s0_62;
	ptr32 s2_66;
	ptr32 s5_69;
	word32 s10_231;
	word32 s11_232;
	word32 s6_228;
	word32 s8_230;
	word32 s7_229;
	word32 s10_225;
	word32 s1_227;
	word32 s11_226;
	word32 s6_222;
	word32 s8_224;
	word32 s7_223;
	word32 s0_219;
	word32 s5_221;
	word32 s2_220;
	Eq_2 ra_61 = topicNameFromThingAndAction(topicNameFromThingAndAction(ra, fp + -0x00B0, a1, 0x00, dwLocA8, dwLoc7C, s2, s0, dwLoc38, dwLoc14, dwArg78, out s0_219, out s1_31, out s2_220, out s5_221, out s6_222, out s7_223, out s8_224, out s10_225, out s11_226), fp + -96, s1_31, 0x01, dwLocA8, dwLoc7C, s2, s0, dwLoc38, dwLoc14, dwArg78, out s0_62, out s1_227, out s2_66, out s5_69, out s6_228, out s7_229, out s8_230, out s10_231, out s11_232);
	s0_116 = s0_62;
	do
	{
		Eq_2 s0_116;
		if ((word32) *((word32) s0_116 + 81) == 0x00)
		{
			word32 a5_237;
			word32 a2_234;
			word32 a4_236;
			word32 a3_235;
			word32 a1_233;
			if (strcmp(fp + -0x00B0, s0_116, out a1_233, out a2_234, out a3_235, out a4_236, out a5_237) != 0x00)
			{
				word32 a3_240;
				word32 a5_242;
				word32 a4_241;
				word32 a2_239;
				word32 a1_238;
				if (strcmp(fp + -96, s0_116, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242) != 0x00)
					goto l2304E93A;
			}
			word32 a5_109 = (word32) *((word32) s0_116 + 80);
			((word32) s0_116 + 82)->u1 = (byte) s2_66;
			((word32) s0_116 + 80)->u1 = (byte) (a5_109 + 0x01);
			goto l2304E93A;
		}
l2304E93A:
		s0_116 = (word32) s0_116 + 83;
	} while (s0_116 != (word32) s0_62 + 1660);
	s0Out = s0_116;
	s2Out = s2_66;
	s5Out = s5_69;
	return ra_61;
}

// 2304E95A: Register Eq_2 publishToShadowAction(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack word32 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack ptr32 dwArg0114, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_internal_action
Eq_2 publishToShadowAction(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, word32 a2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, word32 dwArg74, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArgB8, ptr32 dwArg0114, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x01;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else if (a2 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x01;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_27;
		Eq_2 s7_36;
		word32 s1_185;
		word32 s2_186;
		word32 s5_187;
		word32 s6_188;
		word32 s8_189;
		word32 s10_190;
		word32 s11_191;
		Eq_2 ra_26 = topicNameFromThingAndAction(ra, fp + -96, a1, 0x02, dwLoc68, s0, dwLoc20, dwLoc1C, dwArg08, dwArg2C, dwArgB8, out s0_27, out s1_185, out s2_186, out s5_187, out s6_188, out s7_36, out s8_189, out s10_190, out s11_191);
		word32 a1_192;
		word32 a2_193;
		word32 a3_194;
		word32 a4_195;
		word32 a5_196;
		strlen(s0_27, out a1_192, out a2_193, out a3_194, out a4_195, out a5_196);
		Eq_2 a4_60;
		ptr32 a0_70;
		Eq_2 s0_75;
		ptr32 s3_77;
		ptr32 s9_78;
		ptr32 s2_86;
		ptr32 s4_87;
		ptr32 mstatus_97;
		word32 a1_197;
		word32 a2_198;
		word32 a3_199;
		word32 a5_200;
		Eq_2 ra_74 = aws_iot_mqtt_publish(ra_26, g_t420207FC, fp + -96, (word32) (word16) strlen(fp + -96, out a1_197, out a2_198, out a3_199, out a4_60, out a5_200), fp + -112, a4_60, s7_36, mstatus, dwLoc68, dwLoc28, dwLoc18, dwLoc08, dwArg28, dwArg38, dwArg48, dwArg68, dwArg74, dwArg78, dwArg94, dwArg0114, out s0_75, out a0_70, out s2_86, out s3_77, out s4_87, out s9_78, out mstatus_97);
		s0Out = s0_75;
		a0Out = a0_70;
		s2Out = s2_86;
		s3Out = s3_77;
		s4Out = s4_87;
		s9Out = s9_78;
		mstatusOut = mstatus_97;
		return ra_74;
	}
}

// 2304E9B0: Register (ptr32 byte) getNextFreeIndexOfAckWaitList(Register (ptr32 byte) a0)
// Called from:
//      aws_iot_shadow_internal_action
byte * getNextFreeIndexOfAckWaitList(byte * a0)
{
	byte * a3_11 = null;
	if (a0 != null)
	{
		struct Eq_260777 * a4_15 = g_a4202088C;
		ui32 a5_12 = 0x00;
		do
		{
			a3_11 = (word32) a4_15->b0000;
			if (a3_11 != null)
			{
				*a0 = (byte) a5_12;
				return a3_11;
			}
			ui32 a5_13 = a5_12 + 0x01;
			a5_12 = a5_13 & 0x00FF;
			++a4_15;
		} while ((a5_13 & 0x00FF) != 0x0A);
	}
	return a3_11;
}

// 2304E9DE: Register Eq_2 addToAckWaitList(Register Eq_2 ra, Register (ptr32 Eq_257630) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register (ptr32 Eq_257581) a4, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128)
// Called from:
//      aws_iot_shadow_internal_action
Eq_2 addToAckWaitList(Eq_2 ra, struct Eq_257630 * a0, Eq_2 a1, word32 a2, Eq_2 a3, struct Eq_257581 * a4, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0128)
{
	a4->dw0070 = (char *) a0 + 0x4202089C;
	word32 a1_111;
	word32 a2_112;
	word32 a3_113;
	word32 a4_114;
	word32 a5_115;
	word32 a6_116;
	word32 a7_117;
	memcpy((char *) a0 + 0x4202089C, a3, 90, out a1_111, out a2_112, out a3_113, out a4_114, out a5_115, out a6_116, out a7_117);
	struct Eq_260825 * a5_54;
	Eq_2 a3_58;
	up32 a6_59;
	word32 a1_118;
	word32 a2_119;
	word32 a4_120;
	word32 a7_121;
	memcpy((char *) a0 + 0x420208F6, a1, 0x14, out a1_118, out a2_119, out a3_58, out a4_120, out a5_54, out a6_59, out a7_121);
	a5_54->dw0074 = (char *) a0 + 0x4202089C;
	a0->b4202090A = (byte) a2;
	init_timer(&a0->b4202090A + 0x0E);
	struct Eq_260856 * s1_80;
	word32 a1_122;
	word32 a2_123;
	countdown_sec(ra, dwLoc28, a6_59, a3_58, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_80, out a1_122, out a2_123);
	s1_80->b0078 = 0x00;
	0x00 = (uint16) dwArg0128;
	return a1;
}

// 2304EA52: Register word32 HandleExpiredResponseCallbacks(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
// Called from:
//      aws_iot_shadow_yield
word32 HandleExpiredResponseCallbacks(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	struct Eq_260872 * s0_109 = &g_t42020814;
	Eq_2 s1_105 = 0x00;
	Eq_2 s2_111 = 0x0A;
	do
	{
		if ((word32) s0_109->b0078 == 0x00)
		{
			word32 a0_31;
			struct Eq_260888 * a5_33;
			word32 s4_42;
			word32 a1_249;
			word32 s8_250;
			word32 s3_41;
			s1_105 = has_timer_expired(a2, a3, a4, mstatus, dwLoc0C, dwLoc08, dwArg18, dwArg0108, dwArg0148, out a0_31, out a1_249, out a2, out a3, out a4, out a5_33, out s2_111, out s3_41, out s4_42, out s8_250);
			if (a0_31 != 0x00)
			{
				Eq_2 s0_45 = a5_33->t0070;
				if (a5_33 != null)
				{
					a5_33();
					s0_45 = *((word32) a4 + 116);
				}
				*((word32) s0_45 + 0x0078) = (byte) s3_41;
				ra = unsubscribeFromAcceptedAndRejected(ra, s0_45, s1_105, s2_111, mstatus, s2, dwLoc08, dwArg08, dwArg28, dwArg38, dwArg3C, dwArg58, out s0_109, out s1_105, out a2, out a3, out a4, out s2_111, out mstatus);
			}
		}
		ui32 s1_107 = (word32) s1_105 + 1;
		s1_105 = s1_107 & 0x00FF;
		++s0_109;
	} while ((s1_107 & 0x00FF) != s2_111);
	return dwArg04;
}

// 2304EABE: Register Eq_260462 has_timer_expired(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out Eq_260462 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      subscribeToShadowActionAcks
//      HandleExpiredResponseCallbacks
//      aws_iot_mqtt_yield
//      iot_tls_write
//      iot_tls_read
//      aws_iot_mqtt_internal_send_packet
//      aws_iot_mqtt_internal_wait_for_read
Eq_260462 has_timer_expired(Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg0128, Eq_2 dwArg0168, union Eq_260462 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a5_15;
	Eq_2 a0_14 = xTaskGetTickCount(out a5_15);
	Eq_2 a5_20 = a0_14 - a5_15;
	Eq_2 s0_18 = *((word32) a4 + 4);
	Eq_2 s2_19 = a0_14;
	Eq_260462 s1_22 = (word32) (a5_20 < a4) ^ 1;
	if (a5_20 < a4)
	{
		s0_18 = *((word32) a5_20 + 8);
		if (a5_20 == a0_14)
		{
			word32 a0_92;
			word32 a2_93;
			s0_18 = vTaskDelay(0x01, a2, a3, a4, a5_20, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_22, out a0_92, out a1, out a2_93, out a3, out a4, out a5_20, out s2_19, out s3, out s4, out s8);
		}
	}
	*((word32) s0_18 + 8) = s2_19;
	0x00 = (uint16) dwArg38;
	a0Out = s1_22;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_20;
	s2Out = s2_19;
	s3Out = s3;
	s4Out = s4;
	s8Out = s8;
	return s1_22;
}

// 2304EB02: Register Eq_2 countdown_ms(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a2Out)
// Called from:
//      countdown_sec
//      aws_iot_mqtt_connect
//      _aws_iot_mqtt_internal_disconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
Eq_2 countdown_ms(Eq_2 a0, Eq_2 a1, ptr32 & a2Out)
{
	word32 a5_28;
	*xTaskGetTickCount(out a5_28) = a0;
	*((word32) a0 + 8) = 0x00;
	*((word32) a1 + 4) = a0;
	a2Out = dwArg44;
	return a0;
}

