pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304EB22: Register up32 left_ms(Register (ptr32 word32) a4, Register out ptr32 a5Out)
// Called from:
//      iot_tls_read
up32 left_ms(word32 * a4, ptr32 & a5Out)
{
	up32 a0_16;
	ptr32 a5_11;
	Eq_2 a0_10 = xTaskGetTickCount(out a5_11);
	if (a0_10 - a5_11 < a4)
	{
		a5_11 = a4 + a5_11;
		a0_16 = a5_11 - a0_10;
	}
	else
		a0_16 = 0x00;
	a5Out = a5_11;
	return a0_16;
}

// 2304EB4C: Register Eq_2 countdown_sec(Register Eq_2 ra, Register Eq_2 a0, Register up32 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out (ptr32 byte) a2Out)
// Called from:
//      subscribeToShadowActionAcks
//      addToAckWaitList
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
Eq_2 countdown_sec(Eq_2 ra, Eq_2 a0, up32 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a1Out, byte & a2Out)
{
	Eq_2 s1_13 = a0;
	if (a1 > 4294967)
	{
		word32 a0_116;
		word32 a1_117;
		word32 a2_118;
		word32 a4_119;
		word32 a5_120;
		word32 s4_121;
		word32 s8_122;
		puts(587758488, out a0_116, out a1_117, out a2_118, out a4_119, out a5_120, out s4_121, out s8_122);
		word32 a0_123;
		word32 a1_124;
		word32 a2_125;
		word32 a3_126;
		word32 a4_127;
		word32 a5_128;
		word32 a7_129;
		word32 s2_130;
		word32 s3_131;
		word32 s4_132;
		word32 s5_133;
		word32 s6_134;
		word32 s7_135;
		word32 s8_136;
		word32 s9_137;
		word32 s10_138;
		word32 s11_139;
		word32 t4_140;
		printf(ra, &g_t23087BA4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_13, out a0_123, out a1_124, out a2_125, out a3_126, out a4_127, out a5_128, out a7_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136, out s9_137, out s10_138, out s11_139, out t4_140);
	}
	byte * a2_66;
	Eq_2 s0_68 = countdown_ms(s1_13, a1 + 1000, out a2_66);
	s1Out = s1_13;
	a1Out = a1 + 1000;
	a2Out = a2_66;
	return s0_68;
}

// 2304EB94: void init_timer(Register Eq_2 a0)
// Called from:
//      subscribeToShadowActionAcks
//      addToAckWaitList
//      aws_iot_mqtt_init
//      aws_iot_mqtt_connect
//      _aws_iot_mqtt_internal_disconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
void init_timer(Eq_2 a0)
{
	*a0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	*((word32) a0 + 8) = 0x00;
}

// 2304EBA2: Register word32 jsmn_parse(Register (ptr32 Eq_258404) a0, Register Eq_2 a1, Register Eq_2 a2, Register (arr Eq_363353) a3, Register Eq_258408 a4, Stack word32 dwArg3C, Stack word32 dwArg0148, Register out (ptr32 Eq_258411) s1Out, Register out Eq_258408 a0Out, Register out Eq_258413 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_258416 s5Out)
// Called from:
//      isJsonValidAndParse
//      extractClientToken
word32 jsmn_parse(struct Eq_258404 * a0, Eq_2 a1, Eq_2 a2, Eq_363353 a3[], Eq_258408 a4, word32 dwArg3C, word32 dwArg0148, union Eq_258411 & s1Out, union Eq_258408 & a0Out, union Eq_258413 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_258416 & s5Out)
{
	Eq_258408 a0_1155 = a0->t0004;
	while (true)
	{
		Eq_2 a7_41 = a0->t0000;
		if (a7_41 >= a2)
			break;
		word32 t1_45 = CONVERT(Mem40[a1 + a7_41:byte], byte, word32);
		if (t1_45 == 0x00)
			break;
		if (t1_45 != 44)
		{
			if (t1_45 <= 44)
			{
				if (t1_45 == 0x0D)
					goto l2304ED68;
				if (t1_45 <= 0x0D)
				{
					if (((word32) t1_45.u1 - 9 & 0x00FF) > 0x01)
						goto l2304EC38;
					goto l2304ED68;
				}
				if (t1_45 == 32)
					goto l2304ED68;
				if (t1_45 == 0x0022)
				{
					a0->t0000 = (word32) a7_41 + 1;
					s5.u0 = 0x0022;
					while (true)
					{
						Eq_2 t3_193 = a0->t0000;
						if (t3_193 >= a2)
							break;
						word32 t1_197 = CONVERT(Mem192[a1 + t3_193:byte], byte, word32);
						if (t1_197 == 0x00)
							break;
						if (t1_197 == 0x0022)
						{
							if (a3 == null)
								goto l2304EDC6;
							Eq_258408 t1_250 = a0->t0004;
							if (t1_250 >= a4)
								goto l2304ED92;
							a0->t0004 = (word32) t1_250.u1 + 1;
							struct Eq_261335 * a7_259 = &(a3 + (t1_250 << 0x04) / 16)->b0000;
							a7_259->t0008.u0 = ~0x00;
							a7_259->dw0004 = ~0x00;
							a7_259->dw000C = 0x00;
							Eq_2 t1_268 = a0->t0000;
							a7_259->b0000 = 0x03;
							a7_259->dw0004 = (word32) a7_41 + 1;
							a7_259->t0008 = t1_268;
							goto l2304EDC6;
						}
						if (t1_197 == 92 && t3_193 + 1 <u a2)
						{
							Mem201[a0 + 0x00:word32] = t3_193 + 1;
							word32 t1_203 = CONVERT(Mem201[t3_193 + 1 + a1:byte], byte, word32);
							if (t1_203 == 0x0066)
								goto l2304EE0C;
							if (t1_203 <= 0x0066)
							{
								if (t1_203 == 47)
									goto l2304EE0C;
								if (t1_203 > 47)
								{
									if (t1_203 != 92 && t1_203 != 98)
										goto l2304EE20;
									goto l2304EE0C;
								}
								if (t1_203 == 0x0022)
									goto l2304EE0C;
							}
							else
							{
								if (t1_203 == 114)
									goto l2304EE0C;
								if (t1_203 > 114)
								{
									s1 = (union Eq_258411 *) 116;
									if (t1_203 == 116)
										goto l2304EE0C;
									s1 = (union Eq_258411 *) 117;
									if (t1_203 != 117)
										goto l2304EE20;
									Mem209[a0 + 0x00:word32] = t3_193 + 0x02;
									s1 = (union Eq_258411 *) 0x04;
									do
									{
										Eq_2 t3_213 = a0->t0000;
										if (t3_213 >= a2)
											break;
										word32 t1_217 = CONVERT(Mem212[a1 + t3_213:byte], byte, word32);
										if (t1_217 == 0x00)
											break;
										s2 = t1_217 + -48 & 0x00FF;
										if (s2 > 0x09)
										{
											s2.u0 = 0x05;
											if (((t1_217 & -33) + -65 & 0x00FF) > 0x05)
												goto l2304EE20;
										}
										Mem228[a0 + 0x00:word32] = t3_213 + 0x01;
										s1 = (union Eq_258411 *) ((char *) s1 - 1);
									} while (s1 != null);
									a0->t0000 = (word32) a0->t0000 - 1;
									goto l2304EE0C;
								}
								if (t1_203 == 110)
									goto l2304EE0C;
							}
l2304EE20:
							a0->t0000 = a7_41;
							goto l2304ED24;
						}
l2304EE0C:
						a0->t0000 = (word32) a0->t0000 + 1;
					}
					a0->t0000 = a7_41;
l2304EC84:
					a0_1155.u0 = ~0x02;
					goto l2304EC00;
				}
				goto l2304EC38;
			}
			if (t1_45 != 93)
			{
				if (t1_45 <= 93)
				{
					if (t1_45 == 58)
						goto l2304ECEE;
					if (t1_45 == 91)
						goto l2304EC9C;
					goto l2304EC38;
				}
				if (t1_45 != 0x007B)
				{
					if (t1_45 == 0x007D)
						goto l2304ED06;
l2304EC38:
					s1 = (union Eq_258411 *) 0x0D;
					while (true)
					{
						Eq_2 t3_291 = a0->t0000;
						if (t3_291 >= a2)
							break;
						word32 t1_295 = CONVERT(Mem290[a1 + t3_291:byte], byte, word32);
						if (t1_295 == 0x00 || t1_295 == 32)
							break;
						if (t1_295 <= 32)
						{
							if (t1_295 >= 0x09)
							{
								s2.u0 = 0x0A;
								if (t1_295 <= 0x0A || t1_295 == 0x0D)
									break;
							}
						}
						else
						{
							if (t1_295 == 58)
								break;
							if (t1_295 <= 58)
							{
								if (t1_295 == 44)
									break;
							}
							else if (t1_295 == 93 || t1_295 == 0x007D)
								break;
						}
						s2.u0 = 94;
						if (((word32) t1_295.u1 - 32 & 0x00FF) > 94)
							goto l2304EE20;
						a0->t0000 = (word32) t3_291 + 1;
					}
					if (a3 == null)
					{
						a0->t0000 = (word32) t3_291 - 1;
						goto l2304EDC6;
					}
					Eq_258408 t1_324 = a0->t0004;
					if (t1_324 < a4)
					{
						a0->t0004 = (word32) t1_324 + 1;
						struct Eq_261282 * t1_337 = &(a3 + (t1_324 << 4) / 16)->b0000;
						t1_337->t0008.u0 = ~0x00;
						t1_337->t0004.u0 = ~0x00;
						t1_337->dw000C = 0x00;
						Eq_2 t3_345 = a0->t0000;
						t1_337->b0000 = 0x04;
						t1_337->t0004 = a7_41;
						t1_337->t0008 = t3_345;
						a0->t0000 = (word32) a0->t0000 - 1;
						s1 = (union Eq_258411 *) 0x04;
l2304EDC6:
						Eq_261224 a7_358 = a0->t0008;
						a0_1155 = (word32) a0_1155.u0 + 1;
						if (a7_358 != ~0x00 && a3 != null)
						{
							struct Eq_261262 * a7_373 = &(a3 + (a7_358 << 4) / 16)->b0000;
							++a7_373->dw000C;
						}
						goto l2304ED68;
					}
l2304ED92:
					a0->t0000 = a7_41;
l2304ED96:
					a0_1155.u0 = ~0x00;
					goto l2304EC00;
				}
l2304EC9C:
				a0_1155 = (word32) a0_1155.u0 + 1;
				if (a3 == null)
					goto l2304ED68;
				Eq_258408 a7_144 = a0->t0004;
				if (a7_144 >= a4)
					goto l2304ED96;
				a0->t0004 = (word32) a7_144.u1 + 1;
				struct Eq_261511 * a7_150 = &(a3 + (a7_144 << 4) / 16)->b0000;
				a7_150->dw0008 = ~0x00;
				a7_150->t0004.u0 = ~0x00;
				a7_150->dw000C = 0x00;
				Eq_261224 t3_155 = a0->t0008;
				if (t3_155 != ~0x00)
				{
					struct Eq_261538 * t3_157 = &(a3 + (t3_155 << 4) / 16)->b0000;
					++t3_157->dw000C;
				}
				s1 = (union Eq_258411 *) 0x007B;
				word32 t3_162 = 0x01;
				if (t1_45 != 0x007B)
					t3_162 = 0x02;
				a7_150->b0000 = (byte) t3_162;
				a7_150->t0004 = a0->t0000;
l2304ECEE:
				a0->t0008 = (word32) a0->t0004 - 1;
			}
			else
			{
l2304ED06:
				if (a3 != null)
				{
					s2.u0 = 0x01;
					if (t1_45 != 0x007D)
						s2.u0 = 0x02;
					Eq_258408 t3_89 = a0->t0004;
					Eq_261224 t1_102 = (word32) t3_89.u1 - 1;
					union Eq_258411 * t3_104 = &(a3 + (t3_89 << 4) / 16)->b0000;
					while (t1_102 >= 0x00)
					{
						s1 = (union Eq_258411 *) ((char *) t3_104 - 16);
						if (*((char *) t3_104 - 0x0C) != ~0x00 && *((char *) t3_104 - 8) == ~0x00)
						{
							if ((word32) *s1 != s2)
								goto l2304ED24;
							a0->t0008.u0 = ~0x00;
							*((char *) s1 + 8) = (word32) a7_41 + 1;
							struct Eq_261662 * a7_121 = &(a3 + (t1_102 << 0x04) / 16)->b0000;
							do
							{
								if (a7_121->dw0004 != ~0x00 && a7_121->dw0008 == ~0x00)
								{
									a0->t0008 = t1_102;
									break;
								}
								t1_102 = (word32) t1_102 - 1;
								a7_121 = (struct Eq_261662 *) ((char *) a7_121 - 16);
							} while (t1_102 != ~0x00);
							goto l2304ED68;
						}
						t1_102 = (word32) t1_102 - 1;
						t3_104 = s1;
					}
					if (t1_102 == ~0x00)
					{
l2304ED24:
						a0_1155.u0 = ~0x01;
						goto l2304EC00;
					}
				}
			}
		}
		else if (a3 != null)
		{
			Eq_261224 a7_48 = a0->t0008;
			if (a7_48 != ~0x00 && ((word32) (a3)[a7_48].b0000 + ~0x00 & 0x00FF) > 0x01)
			{
				Eq_258408 a7_56 = a0->t0004;
				Eq_261224 t3_57 = (word32) a7_56.u1 - 1;
				struct Eq_261601 * a7_59 = &(a3 + (a7_56 << 4) / 16)->b0000;
				while (t3_57 >= 0x00)
				{
					if (((word32) a7_59->bFFFFFFF0 + ~0x00 & 0x00FF) <= 0x01 && (a7_59->dwFFFFFFF4 != ~0x00 && a7_59->dwFFFFFFF8 == ~0x00))
					{
						a0->t0008 = t3_57;
						break;
					}
					t3_57 = (word32) t3_57 - 1;
					a7_59 = (struct Eq_261601 *) &a7_59->bFFFFFFF0;
				}
			}
		}
l2304ED68:
		a0->t0000 = (word32) a0->t0000 + 1;
	}
	if (a3 != null)
	{
		Eq_258408 a5_386 = a0->t0004;
		int32 a4_387;
		struct Eq_261133 * a3_389 = &(a3 + (a5_386 << 4) / 16)->b0000;
		for (a4_387 = (word32) a5_386 - 1; a4_387 >= 0x00; a4_387 += ~0x00)
		{
			if (a3_389->dwFFFFFFF4 != ~0x00 && a3_389->dwFFFFFFF8 == ~0x00)
				goto l2304EC84;
			a3_389 = (struct Eq_261133 *) ((char *) a3_389 - 16);
		}
	}
l2304EC00:
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s1Out = s1;
	a0Out = a0_1155;
	s2Out = s2;
	s3Out = 0x09;
	s4Out = dwArg98;
	s5Out = s5;
	return dwLoc04;
}

// 2304EF9E: void jsmn_init(Register Eq_2 a0)
// Called from:
//      isJsonValidAndParse
//      extractClientToken
void jsmn_init(Eq_2 a0)
{
	*a0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	*(union Eq_2 *) 0x07 = a0;
}

