pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304EFAC: Register word32 jsoneq(Register (ptr32 Eq_257468) a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg44, Register out (ptr32 Eq_257468) s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
//      extractClientToken
//      extractVersionNumber
word32 jsoneq(struct Eq_257468 * a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg44, struct Eq_257468 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a4_5 = (word32) *a1;
	if (a4_5 == 0x03)
	{
		ptr32 a0_30;
		ui32 a5_23;
		word32 a2_105;
		Eq_2 a1_24;
		ptr32 a3_21;
		ptr32 a4_22;
		Eq_2 a0_20 = strlen(a2, out a1_24, out a2_105, out a3_21, out a4_22, out a5_23);
		Eq_2 a2_26 = a0_20;
		word32 s0_28 = *((word32) a0_20 + 4);
		Eq_2 a5_29 = a5_23 - a0_20;
		if (a0_20 == a5_29)
			a0_30 = 0x00 - CONVERT(strncmp(a0_20 + a0, a1_24, dwArg44, out a1_24, out a2_26, out a3_21, out a4_22, out a5_29) != 0x00, bool, word32);
		else
			a0_30 = ~0x00;
		s1Out = a0;
		a0Out = a0_30;
		a1Out = a1_24;
		a2Out = a2_26;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_29;
		s4Out = dwArg04;
		s8Out = dwLoc1C;
		return s0_28;
	}
	else
	{
		s1Out = s1;
		a0Out = ~0x00;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4_5;
		a5Out.u0 = 0x03;
		s4Out = s4;
		s8Out = s8;
		return s0;
	}
}

// 2304EFF8: Register Eq_2 parseUnsignedInteger32Value(Register Eq_2 ra, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack Eq_258450 dwArg04, Register out Eq_258715 s0Out, Register out ptr32 s1Out, Register out Eq_258717 a0Out, Register out Eq_258718 a3Out, Register out Eq_258719 a4Out, Register out Eq_258717 a5Out, Register out Eq_258721 s2Out, Register out Eq_258722 s3Out, Register out Eq_258723 s4Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
//      extractVersionNumber
Eq_2 parseUnsignedInteger32Value(Eq_2 ra, struct Eq_257468 * a1, byte * a2, Eq_258450 dwArg04, union Eq_258715 & s0Out, ptr32 & s1Out, union Eq_258717 & a0Out, union Eq_258718 & a3Out, union Eq_258719 & a4Out, union Eq_258717 & a5Out, union Eq_258721 & s2Out, union Eq_258722 & s3Out, union Eq_258723 & s4Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	Eq_258719 a4_5 = (word32) *a2;
	if (a4_5 == 0x04)
	{
		a4_5.u0 = 45;
		a3 = (word32) a1->b0004;
		if (a3 != 45)
		{
			word32 a0_22;
			Eq_258718 a3_25;
			Eq_258715 s0_30;
			ptr32 s1_31;
			Eq_258721 s2_34;
			Eq_258722 s3_35;
			Eq_258723 s4_36;
			union Eq_2 * s5_37;
			union Eq_258456 * s6_38;
			word32 a4_157;
			Eq_2 ra_29 = sscanf(ra, &a1->b0004, &g_b2308C990, dwArg04, out s0_30, out s1_31, out a0_22, out a3_25, out a4_157, out s2_34, out s3_35, out s4_36, out s5_37, out s6_38);
			Eq_258717 a5_47 = 0x00;
			if (a0_22 != 0x01)
				a5_47.u0 = -42;
			s0Out = s0_30;
			s1Out = s1_31;
			a0Out = a5_47;
			a3Out = a3_25;
			a4Out.u0 = 0x01;
			a5Out = a5_47;
			s2Out = s2_34;
			s3Out = s3_35;
			s4Out = s4_36;
			s5Out = s5_37;
			s6Out = s6_38;
			return ra_29;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a0Out.u0 = -42;
	a3Out = a3;
	a4Out = a4_5;
	a5Out.u0 = -42;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 2304F042: Register int32 parseUnsignedInteger16Value(Register Eq_2 ra, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack Eq_258450 dwArg04, Register out Eq_258751 a5Out, Register out Eq_258752 s2Out, Register out Eq_258753 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
int32 parseUnsignedInteger16Value(Eq_2 ra, struct Eq_257468 * a1, byte * a2, Eq_258450 dwArg04, union Eq_258751 & a5Out, union Eq_258752 & s2Out, union Eq_258753 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	int32 a4_5 = (word32) *a2;
	if (a4_5 == 0x04)
	{
		a4_5 = 45;
		if ((word32) a1->b0004 != 45)
		{
			word32 a0_22;
			Eq_258752 s2_34;
			Eq_258753 s3_35;
			union Eq_2 * s5_37;
			union Eq_258456 * s6_38;
			word32 s4_155;
			word32 a4_154;
			word32 a3_153;
			word32 s1_152;
			word32 s0_151;
			sscanf(ra, &a1->b0004, &g_b23087BD8, dwArg04, out s0_151, out s1_152, out a0_22, out a3_153, out a4_154, out s2_34, out s3_35, out s4_155, out s5_37, out s6_38);
			Eq_258751 a5_47 = 0x00;
			if (a0_22 != 0x01)
				a5_47.u0 = -42;
			a5Out = a5_47;
			s2Out = s2_34;
			s3Out = s3_35;
			s5Out = s5_37;
			s6Out = s6_38;
			return 0x01;
		}
	}
	a5Out.u0 = -42;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	s6Out = s6;
	return a4_5;
}

// 2304F08C: Register int32 parseUnsignedInteger8Value(Register Eq_2 ra, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Register out ptr32 a5Out, Register out Eq_258775 s2Out, Register out Eq_258776 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
int32 parseUnsignedInteger8Value(Eq_2 ra, struct Eq_257468 * a1, byte * a2, ptr32 & a5Out, union Eq_258775 & s2Out, union Eq_258776 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	int32 a4_5 = (word32) *a2;
	ptr32 a5_10 = 0x04;
	if (a4_5 != 0x04)
	{
l2304F096:
		a5Out = a5_10;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	a4_5 = 45;
	a5_10 = &a1->b0004;
	if ((word32) a1->b0004 == 45)
		goto l2304F096;
	word32 a0_23;
	byte * s0_31;
	Eq_258775 s2_35;
	Eq_258776 s3_36;
	union Eq_2 * s5_38;
	union Eq_258456 * s6_39;
	word32 s4_187;
	word32 a3_186;
	word32 s1_185;
	int32 a4_27;
	sscanf(ra, &a1->b0004, &g_b2308C990, dwLoc0C, out s0_31, out s1_185, out a0_23, out a3_186, out a4_27, out s2_35, out s3_36, out s4_187, out s5_38, out s6_39);
	if (a0_23 == 0x01)
	{
		a4_27 = 0x00FF;
		if (true)
		{
			*s0_31 = 0x01;
l2304F0A0:
			a5Out = 0x01;
			s2Out = s2_35;
			s3Out = s3_36;
			s5Out = s5_38;
			s6Out = s6_39;
			return a4_27;
		}
	}
	goto l2304F0A0;
}

// 2304F0E8: Register word32 parseInteger32Value(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack Eq_258450 dwArg04, Register out Eq_258635 a5Out, Register out Eq_258636 s2Out, Register out Eq_258637 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
word32 parseInteger32Value(Eq_2 ra, ptr32 a0, struct Eq_257468 * a1, byte * a2, Eq_258450 dwArg04, union Eq_258635 & a5Out, union Eq_258636 & s2Out, union Eq_258637 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	word32 a4_5 = (word32) *a2;
	if (a4_5 != 0x04)
	{
		a5Out.u0 = -42;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	else
	{
		word32 a0_20;
		Eq_258636 s2_32;
		Eq_258637 s3_33;
		union Eq_2 * s5_35;
		union Eq_258456 * s6_36;
		word32 s4_130;
		word32 a4_129;
		word32 a3_128;
		word32 s1_127;
		word32 s0_126;
		sscanf(ra, a1 + a0 / 0x0C, &g_b23075514, dwArg04, out s0_126, out s1_127, out a0_20, out a3_128, out a4_129, out s2_32, out s3_33, out s4_130, out s5_35, out s6_36);
		Eq_258635 a5_45 = 0x00;
		if (a0_20 != 0x01)
			a5_45.u0 = -42;
		a5Out = a5_45;
		s2Out = s2_32;
		s3Out = s3_33;
		s5Out = s5_35;
		s6Out = s6_36;
		return 0x01;
	}
}

// 2304F128: Register up32 parseInteger16Value(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Register out ptr32 a5Out, Register out Eq_258662 s2Out, Register out Eq_258663 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
up32 parseInteger16Value(Eq_2 ra, ptr32 a0, struct Eq_257468 * a1, byte * a2, ptr32 & a5Out, union Eq_258662 & s2Out, union Eq_258663 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	up32 a4_5 = (word32) *a2;
	if (a4_5 != 0x04)
	{
		a5Out = 0x04;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	word32 a0_21;
	up32 a4_25;
	word16 * s0_29;
	Eq_258662 s2_33;
	Eq_258663 s3_34;
	union Eq_2 * s5_36;
	union Eq_258456 * s6_37;
	word32 a3_162;
	word32 s4_163;
	word32 s1_161;
	sscanf(ra, a1 + a0 / 0x0C, &g_b23087BD4, dwLoc0C, out s0_29, out s1_161, out a0_21, out a3_162, out a4_25, out s2_33, out s3_34, out s4_163, out s5_36, out s6_37);
	ptr32 a5_45 = 0x01;
	if (a0_21 == 0x01)
	{
		a5_45 = a4_25 + 0x08000000;
		if (a4_25 < 0xF8000000)
		{
			*s0_29 = (word16) a4_25;
l2304F13C:
			a5Out = a5_45;
			s2Out = s2_33;
			s3Out = s3_34;
			s5Out = s5_36;
			s6Out = s6_37;
			return a4_25;
		}
	}
	goto l2304F13C;
}

// 2304F17A: Register int32 parseInteger8Value(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Register out ptr32 a5Out, Register out Eq_258687 s2Out, Register out Eq_258688 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
int32 parseInteger8Value(Eq_2 ra, ptr32 a0, struct Eq_257468 * a1, byte * a2, ptr32 & a5Out, union Eq_258687 & s2Out, union Eq_258688 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	int32 a4_5 = (word32) *a2;
	if (a4_5 != 0x04)
	{
		a5Out = 0x04;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	word32 a0_21;
	byte * s0_29;
	Eq_258687 s2_33;
	Eq_258688 s3_34;
	union Eq_2 * s5_36;
	union Eq_258456 * s6_37;
	word32 a3_161;
	word32 s4_162;
	word32 s1_160;
	int32 a4_25;
	sscanf(ra, a1 + a0 / 0x0C, &g_b23087BD4, dwLoc0C, out s0_29, out s1_160, out a0_21, out a3_161, out a4_25, out s2_33, out s3_34, out s4_162, out s5_36, out s6_37);
	if (a0_21 == 0x01)
	{
		a4_25 = 0x00FF;
		if (true)
		{
			*s0_29 = 0x01;
l2304F18E:
			a5Out = 0x01;
			s2Out = s2_33;
			s3Out = s3_34;
			s5Out = s5_36;
			s6Out = s6_37;
			return a4_25;
		}
	}
	goto l2304F18E;
}

// 2304F1CE: Register word32 parseFloatValue(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack Eq_258450 dwArg04, Register out Eq_258799 a5Out, Register out Eq_258800 s2Out, Register out Eq_258801 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
word32 parseFloatValue(Eq_2 ra, ptr32 a0, struct Eq_257468 * a1, byte * a2, Eq_258450 dwArg04, union Eq_258799 & a5Out, union Eq_258800 & s2Out, union Eq_258801 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	word32 a4_5 = (word32) *a2;
	if (a4_5 != 0x04)
	{
		a5Out.u0 = -42;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	else
	{
		word32 a0_20;
		Eq_258800 s2_32;
		Eq_258801 s3_33;
		union Eq_2 * s5_35;
		union Eq_258456 * s6_36;
		word32 s4_130;
		word32 a4_129;
		word32 a3_128;
		word32 s1_127;
		word32 s0_126;
		sscanf(ra, a1 + a0 / 0x0C, &g_b23087BD0, dwArg04, out s0_126, out s1_127, out a0_20, out a3_128, out a4_129, out s2_32, out s3_33, out s4_130, out s5_35, out s6_36);
		Eq_258799 a5_45 = 0x00;
		if (a0_20 != 0x01)
			a5_45.u0 = -42;
		a5Out = a5_45;
		s2Out = s2_32;
		s3Out = s3_33;
		s5Out = s5_35;
		s6Out = s6_36;
		return 0x01;
	}
}

