pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304F20E: Register word32 parseDoubleValue(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack Eq_258450 dwArg04, Register out Eq_258825 a5Out, Register out Eq_258826 s2Out, Register out Eq_258827 s3Out, Register out (ptr32 Eq_2) s5Out, Register out (ptr32 Eq_258456) s6Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
word32 parseDoubleValue(Eq_2 ra, ptr32 a0, struct Eq_257468 * a1, byte * a2, Eq_258450 dwArg04, union Eq_258825 & a5Out, union Eq_258826 & s2Out, union Eq_258827 & s3Out, union Eq_2 & s5Out, union Eq_258456 & s6Out)
{
	word32 a4_5 = (word32) *a2;
	if (a4_5 != 0x04)
	{
		a5Out.u0 = -42;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return a4_5;
	}
	else
	{
		word32 a0_20;
		Eq_258826 s2_32;
		Eq_258827 s3_33;
		union Eq_2 * s5_35;
		union Eq_258456 * s6_36;
		word32 s4_130;
		word32 a4_129;
		word32 a3_128;
		word32 s1_127;
		word32 s0_126;
		sscanf(ra, a1 + a0 / 0x0C, &g_b23087BCC, dwArg04, out s0_126, out s1_127, out a0_20, out a3_128, out a4_129, out s2_32, out s3_33, out s4_130, out s5_35, out s6_36);
		Eq_258825 a5_45 = 0x00;
		if (a0_20 != 0x01)
			a5_45.u0 = -42;
		a5Out = a5_45;
		s2Out = s2_32;
		s3Out = s3_33;
		s5Out = s5_35;
		s6Out = s6_36;
		return 0x01;
	}
}

// 2304F24E: Register word32 parseBooleanValue(Register (ptr32 byte) a0, Register (ptr32 Eq_257468) a1, Register (ptr32 byte) a2, Stack word32 dwArg38, Register out ptr32 a5Out, Register out (ptr32 Eq_257468) s2Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
word32 parseBooleanValue(byte * a0, struct Eq_257468 * a1, byte * a2, word32 dwArg38, ptr32 & a5Out, struct Eq_257468 & s2Out)
{
	word32 a4_5 = (word32) *a2;
	if (a4_5 == 0x04)
	{
		ptr32 a5_45;
		word32 a1_107;
		word32 a2_108;
		word32 a3_109;
		word32 a5_110;
		word32 a4_29;
		word32 a0_26 = strncmp(a0 + a1, 587673176, 0x04, out a1_107, out a2_108, out a3_109, out a4_29, out a5_110);
		if (a0_26 == 0x00)
		{
			*a0 = 0x01;
			a5_45 = 0x01;
		}
		else
		{
			word32 a1_111;
			word32 a2_112;
			word32 a3_113;
			if (strncmp(a0_26 + a1, 0x23072E60, 0x05, out a1_111, out a2_112, out a3_113, out a4_29, out a5_45) == 0x00)
				*a0 = 0x00;
		}
		0x00 = dwArg38;
		a5Out = a5_45;
		s2Out = a1;
		return a4_29;
	}
	else
	{
		a5Out = 0x04;
		s2Out = s2;
		return a4_5;
	}
}

// 2304F2B4: Register int32 parseStringValue(Register (ptr32 Eq_257468) s1, Register Eq_2 a0, Register up32 a1, Register (ptr32 Eq_257468) a2, Register (ptr32 Eq_258845) a3, Register out (ptr32 byte) a5Out)
// Called from:
//      isJsonKeyMatchingAndUpdateValue
int32 parseStringValue(struct Eq_257468 * s1, Eq_2 a0, up32 a1, struct Eq_257468 * a2, struct Eq_258845 * a3, byte & a5Out)
{
	int32 a4_16;
	int32 a6_11 = a3->dw0004;
	Eq_2995 s1_15 = s1 - a6_11;
	if ((word32) *s1->ptr0008 == 0x03)
	{
		a4_16 = -45;
		if (a1 >= (word32) s1_15.u1 + 1)
		{
			word32 a3_67;
			word32 a4_68;
			word32 a5_69;
			strncpy(a0, a2 + a6_11 / 0x0C, s1_15, out a3_67, out a4_68, out a5_69);
			a5 = a0 + s1_15;
			*a5 = 0x00;
			a4_16 = 0x00;
		}
	}
	else
		a4_16 = -42;
	a5Out = a5;
	return a4_16;
}

// 2304F304: Register Eq_2 aws_iot_mqtt_get_client_state(Register Eq_2 a0)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_disconnect
//      aws_iot_mqtt_attempt_reconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
Eq_2 aws_iot_mqtt_get_client_state(Eq_2 a0)
{
	if (a0 == 0x00)
		return 0x00;
	return (word32) *((word32) a0 + 24);
}

// 2304F310: Register Eq_2 aws_iot_mqtt_client_lock_mutex(Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 word32) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out (ptr32 word32) a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aws_iot_mqtt_set_client_state
//      aws_iot_mqtt_internal_send_packet
//      aws_iot_mqtt_internal_cycle_read
Eq_2 aws_iot_mqtt_client_lock_mutex(Eq_2 s1, Eq_2 a0, word32 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & a0Out, word32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		a0Out = ~0x01;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return s1;
	}
	else if ((word32) *((word32) a0 + 0x0440) != 0x00)
	{
		ptr32 a0_14;
		word32 * a1_15;
		Eq_2 a2_16;
		Eq_2 a3_17;
		Eq_2 a4_18;
		ptr32 s2_22;
		ptr32 s3_23;
		ptr32 s4_24;
		Eq_2 s1_21 = aws_iot_thread_mutex_lock(s1, a1, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a0_14, out a1_15, out a2_16, out a3_17, out a4_18, out s2_22, out s3_23, out s4_24);
		a0Out = a0_14;
		a1Out = a1_15;
		a2Out = a2_16;
		a3Out = a3_17;
		a4Out = a4_18;
		s2Out = s2_22;
		s3Out = s3_23;
		s4Out = s4_24;
		return s1_21;
	}
	else
	{
		ptr32 a0_28;
		word32 * a1_29;
		Eq_2 a2_30;
		Eq_2 a3_31;
		Eq_2 a4_32;
		ptr32 s2_36;
		ptr32 s3_37;
		ptr32 s4_38;
		Eq_2 s1_35 = aws_iot_thread_mutex_trylock(s1, a1, a2, a3, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, out a0_28, out a1_29, out a2_30, out a3_31, out a4_32, out s2_36, out s3_37, out s4_38);
		a0Out = a0_28;
		a1Out = a1_29;
		a2Out = a2_30;
		a3Out = a3_31;
		a4Out = a4_32;
		s2Out = s2_36;
		s3Out = s3_37;
		s4Out = s4_38;
		return s1_35;
	}
}

// 2304F328: Register word32 aws_iot_mqtt_client_unlock_mutex(Register Eq_2 a0, Register (ptr32 (ptr32 Eq_151879)) a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_151879)) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aws_iot_mqtt_set_client_state
//      aws_iot_mqtt_internal_send_packet
//      aws_iot_mqtt_internal_cycle_read
word32 aws_iot_mqtt_client_unlock_mutex(Eq_2 a0, struct Eq_151879 ** a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, struct Eq_151879 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (a0 == 0x00 || a1 == null)
	{
		s1Out = s1;
		a0Out = ~0x01;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		return t1;
	}
	else
	{
		ptr32 a0_10;
		struct Eq_151879 ** a1_11;
		ptr32 a2_12;
		ptr32 a3_13;
		Eq_2 a4_14;
		ptr32 s1_18;
		ptr32 s2_19;
		ptr32 s3_20;
		ptr32 s5_22;
		ptr32 s6_23;
		word32 t1_26 = aws_iot_thread_mutex_unlock(a1, a4, mstatus, dwArg04, dwArg28, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_18, out a0_10, out a1_11, out a2_12, out a3_13, out a4_14, out s2_19, out s3_20, out s5_22, out s6_23);
		s1Out = s1_18;
		a0Out = a0_10;
		a1Out = a1_11;
		a2Out = a2_12;
		a3Out = a3_13;
		a4Out = a4_14;
		s2Out = s2_19;
		s3Out = s3_20;
		s5Out = s5_22;
		s6Out = s6_23;
		return t1_26;
	}
}

// 2304F336: Register Eq_2 aws_iot_mqtt_set_client_state(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aws_iot_mqtt_connect
//      aws_iot_mqtt_disconnect
//      aws_iot_mqtt_attempt_reconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
//      aws_iot_mqtt_internal_cycle_read
Eq_2 aws_iot_mqtt_set_client_state(Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out.u0 = ~0x01;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		return s0;
	}
	else
	{
		struct Eq_151879 ** s4_38;
		word32 a2_182;
		Eq_2 a4_125;
		Eq_2 a3_123;
		ptr32 a1_120;
		Eq_2 a0_118;
		ptr32 s2_138;
		Eq_2 s3_140;
		Eq_2 s1_136 = aws_iot_mqtt_client_lock_mutex(s1, a0, (word32) a0 + 0x0444, a2, a3, a4, mstatus, s4, dwArg08, s3, dwArgD8, dwArg0118, out a0_118, out a1_120, out a2_182, out a3_123, out a4_125, out s2_138, out s3_140, out s4_38);
		if (a0_118 == 0x00)
		{
			if ((word32) *((word32) a0 + 24) == s3_140)
				((word32) a0 + 24)->u1 = (byte) s2_138;
			word32 a2_183;
			aws_iot_mqtt_client_unlock_mutex(a0, s4_38, a4_125, mstatus, s4, dwArg08, s3, dwArgD8, dwArg0118, dwArg0158, out s1_136, out a0_118, out a1_120, out a2_183, out a3_123, out a4_125, out s2_138, out s3_140, out s5, out s6);
			if (s1_136 != 0x00)
				a0_118 = s1_136;
		}
		s1Out = s1_136;
		a0Out = a0_118;
		a1Out = a1_120;
		a2Out = dwArg48;
		a3Out = a3_123;
		a4Out = a4_125;
		s2Out = s2_138;
		s3Out = s3_140;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		return s1;
	}
}

// 2304F388: Register Eq_2 aws_iot_mqtt_set_connect_params(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      aws_iot_mqtt_init
//      aws_iot_mqtt_connect
Eq_2 aws_iot_mqtt_set_connect_params(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 dwArg08, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg54, Eq_2 dwArg98, Eq_2 dwArgBC, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x01;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ra;
	}
	else
	{
		Eq_2 s0_14 = a0;
		ptr32 a0_125 = ~0x01;
		if (a1 != 0x00)
		{
			((word32) a0 + 1121)->u1 = (byte) (word32) *((word32) a1 + 0x0011);
			Eq_2 a5_21 = (word32) *((word32) a1 + 4);
			((word32) a0 + 0x0454)->u1 = (byte) a5_21;
			struct Eq_262572 * a1_24 = *((word32) a5_21 + 8);
			*((word32) a0 + 1112) = a5_21;
			((word32) a0 + 1116)->u0 = (word16) (word32) a1_24->w000C;
			s2 = 0x42017000;
			word32 a1_210;
			word32 a2_211;
			word32 a3_212;
			word32 a4_213;
			word32 a5_214;
			if (strlen(0x42016964, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214) == 0x00)
			{
				word32 s1_216;
				word32 a0_217;
				word32 a1_218;
				word32 a2_219;
				word32 a3_220;
				word32 a4_221;
				word32 a5_222;
				word32 a7_223;
				word32 s5_224;
				word32 s6_225;
				word32 s7_226;
				word32 s8_227;
				word32 s9_228;
				word32 s10_229;
				word32 s11_230;
				ra = snprintf(ra, 0x42016964, 0x19, &g_t23087C14, dwArg08, dwArg28, dwArg54, s1, ra, dwArg98, dwArgBC, out s0_14, out s1_216, out a0_217, out a1_218, out a2_219, out a3_220, out a4_221, out a5_222, out a7_223, out s2, out s3, out s4, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_229, out s11_230);
			}
			*((word32) s0_14 + 1144) = s2 + -0x069C;
			Eq_2 a5_72;
			word32 a2_215;
			((word32) s0_14 + 1148)->u0 = (word16) strlen(s2 + -0x069C, out a1, out a2_215, out a3, out a4, out a5_72);
			struct Eq_262623 * s1_76 = *((word32) a5_72 + 48);
			*((word32) s0_14 + 1152) = a5_72;
			Eq_2 a5_79 = (word32) s1_76->w0034;
			((word32) s0_14 + 0x0484)->u0 = (word16) a5_79;
			struct Eq_262639 * s1_81 = *((word32) a5_79 + 24);
			*((word32) s0_14 + 1128) = a5_79;
			Eq_2 a5_83 = (word32) s1_81->w001C;
			((word32) s0_14 + 1132)->u0 = (word16) a5_83;
			s1 = *((word32) a5_83 + 32);
			*((word32) s0_14 + 1136) = a5_83;
			((word32) s0_14 + 0x0474)->u0 = (word16) (word32) *((word32) s1 + 36);
			((word32) s0_14 + 0x0477)->u1 = (byte) (word32) *((word32) s1 + 39);
			((word32) s0_14 + 1142)->u1 = (byte) (word32) *((word32) s1 + 38);
			((word32) s0_14 + 1118)->u0 = (word16) (word32) *((word32) s1 + 0x0E);
			((word32) s0_14 + 1120)->u1 = (byte) (word32) *((word32) s1 + 16);
			a0_125 = 0x00;
		}
		0x00 = dwArg38;
		s1Out = s1;
		a0Out = a0_125;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return ra;
	}
}

