pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304F450: Register Eq_2 aws_iot_mqtt_init(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      aws_iot_shadow_init
Eq_2 aws_iot_mqtt_init(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a3Out)
{
	struct Eq_262741 * a5_30;
	word32 a7_388;
	word32 a6_387;
	word32 a1_383;
	word32 a2_384;
	word32 a3_385;
	word32 a4_386;
	memcpy(fp + -88, 587758556, 56, out a1_383, out a2_384, out a3_385, out a4_386, out a5_30, out a6_387, out a7_388);
	Eq_2 s0_13 = a0;
	ptr32 s2_127 = ~0x01;
	if (a0 != 0x00 && a1 != 0x00)
	{
		struct Eq_262771 * s1_42 = a5_30->ptr0004;
		if (a5_30 == null)
			goto l2304F50E;
		word32 a5_43 = (word32) s1_42->w0008;
		if (a5_43 != 0x00 && (a5_43 != 0x00 && (a5_43 != 0x00 && a5_43 != 0x00)))
		{
			struct Eq_262790 * a5_47 = (word32) a0 + 0x0488;
			do
			{
				a5_47->dw0000 = 0x00;
				a5_47->dw0008 = 0x00;
				a5_47->dw000C = 0x00;
				a5_47->b0006 = 0x00;
				++a5_47;
			} while (a5_47 != (word32) a0 + 0x04D8);
			a5_47[2] = (struct Eq_262790) a0;
			*((word32) a0 + 48) = 0x00;
			a5_47->dw0024 = (word32) a0;
			*(union Eq_2 *) 0x0234 = a0;
			*(union Eq_2 *) 0x0238 = a0;
			*((word32) a0 + 0x04D8) = (<anonymous> *) 0x0200;
			Eq_2 s1_71 = *(union Eq_2 *) 556;
			*((word32) a0 + 28) = 0x01;
			*((word32) a0 + 1244) = 0x0200;
			word32 s2_390;
			ptr32 a0_75;
			Eq_2 a3_79;
			Eq_2 a4_80;
			struct Eq_262847 * s1_82;
			word32 a1_389;
			word32 s3_391;
			word32 s4_392;
			Eq_2 ra_85 = aws_iot_mqtt_set_connect_params(ra, s1_71, a0, fp + -88, dwLoc58, s2, dwLoc28, dwLoc0C, dwArg38, dwArg5C, out s1_82, out a0_75, out a1_389, out a3_79, out a4_80, out s2_390, out s3_391, out s4_392);
			s2_127 = a0_75;
			if (a0_75 == 0x00)
			{
				Eq_2 a5_99 = (word32) s1_82->b0030;
				((word32) a0 + 0x0440)->u1 = (byte) a5_99;
				ptr32 a0_105;
				Eq_2 a3_108;
				Eq_2 a4_109;
				Eq_2 a5_110;
				word32 a1_393;
				word32 a2_394;
				word32 s3_395;
				word32 s4_396;
				word32 s5_397;
				word32 s6_398;
				aws_iot_thread_mutex_init(ra_85, (word32) a0 + 0x0444, a3_79, a4_80, a5_99, mstatus, dwLoc60, dwLoc5C, dwArg24, dwArg98, dwArgD8, dwArg0118, out a0_105, out a1_393, out a2_394, out a3_108, out a4_109, out a5_110, out s3_395, out s4_396, out s5_397, out s6_398);
				s2_127 = a0_105;
				if (a0_105 != 0x00)
					goto l2304F50E;
				ptr32 a0_130;
				Eq_2 a5_135;
				word32 a1_399;
				word32 a2_400;
				word32 s4_401;
				word32 s5_402;
				word32 s6_403;
				union Eq_2 * s3_140;
				Eq_2 a4_134;
				Eq_2 a3_133;
				aws_iot_thread_mutex_init(ra_85, (word32) a0 + 0x0448, a3_108, a4_109, a5_110, mstatus, dwLoc60, dwLoc5C, dwArg24, dwArg98, dwArgD8, dwArg0118, out a0_130, out a1_399, out a2_400, out a3_133, out a4_134, out a5_135, out s3_140, out s4_401, out s5_402, out s6_403);
				s2_127 = a0_130;
				if (a0_130 != 0x00)
				{
l2304F508:
					word32 a3_405;
					word32 a4_406;
					s0_13 = aws_iot_thread_mutex_destroy(s3_140, a3_133, a4_134, mstatus, dwArgE8, dwArg0128, out a3_405, out a4_406);
					goto l2304F50E;
				}
				ptr32 a0_155;
				struct Eq_262957 * a1_156;
				struct Eq_262958 * a2_157;
				Eq_2 a3_158;
				Eq_2 a4_159;
				union Eq_2 * s4_166;
				word32 s5_167;
				union Eq_2 * s6_168;
				word32 a5_404;
				struct Eq_262927 * s1_163 = aws_iot_thread_mutex_init(ra_85, (word32) a0 + 0x044C, a3_133, a4_134, a5_135, mstatus, dwLoc60, dwLoc5C, dwArg24, dwArg98, dwArgD8, dwArg0118, out a0_155, out a1_156, out a2_157, out a3_158, out a4_159, out a5_404, out s3_140, out s4_166, out s5_167, out s6_168);
				s2_127 = a0_155;
				if (a0_155 != 0x00)
				{
					aws_iot_thread_mutex_destroy(s4_166, a3_158, a4_159, mstatus, dwArgE8, dwArg0128, out a3_133, out a4_134);
					goto l2304F508;
				}
				*((word32) a0 + 25) = 0x00;
				((word32) a0 + 26)->u1 = (byte) (word32) s1_163->b0000;
				ptr32 a0_189 = iot_tls_init((word32) a0 + 0x04E0, a1_156, a2_157, a3_158, a4_159, (word32) s1_163->w0008, s1_163->t0020, (word32) s1_163->b0024);
				s2_127 = a0_189;
				if (a0_189 != 0x00)
				{
					Eq_2 a3_199;
					Eq_2 a4_200;
					aws_iot_thread_mutex_destroy(s4_166, a3_158, a4_159, mstatus, dwArgE8, dwArg0128, out a3_199, out a4_200);
					Eq_2 a3_212;
					Eq_2 a4_213;
					aws_iot_thread_mutex_destroy(s3_140, a3_199, a4_200, mstatus, dwArgE8, dwArg0128, out a3_212, out a4_213);
					word32 a3_407;
					word32 a4_408;
					s0_13 = aws_iot_thread_mutex_destroy(s6_168, a3_212, a4_213, mstatus, dwArgE8, dwArg0128, out a3_407, out a4_408);
					((word32) s0_13 + 24)->u1 = 0x00;
				}
				else
				{
					init_timer(a0);
					init_timer((word32) a0 + 0x0C);
					((word32) a0 + 24)->u1 = (byte) s5_167;
				}
			}
		}
	}
l2304F50E:
	s0Out = s0_13;
	a0Out = s2_127;
	a3Out = dwArg08;
	return dwArg68;
}

// 2304F592: Register Eq_2 aws_iot_mqtt_get_next_packet_id(Register Eq_2 a0)
// Called from:
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
Eq_2 aws_iot_mqtt_get_next_packet_id(Eq_2 a0)
{
	Eq_2 a5_11;
	word32 a5_5 = (word32) *((word32) a0 + 28);
	if (a5_5 != 0x0FFFFFFF)
		a5_11 = (word32) (word16) (a5_5 + 0x01);
	else
		a5_11.u0 = 0x01;
	((word32) a0 + 28)->u0 = (word16) a5_11;
	return a5_11;
}

// 2304F5B0: Register Eq_2 aws_iot_mqtt_is_client_connected(Register Eq_2 a0)
// Called from:
//      aws_iot_shadow_register_delta
//      aws_iot_shadow_update
//      aws_iot_mqtt_disconnect
//      aws_iot_mqtt_attempt_reconnect
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
//      aws_iot_mqtt_unsubscribe
//      aws_iot_mqtt_yield
Eq_2 aws_iot_mqtt_is_client_connected(Eq_2 a0)
{
	if (a0 == 0x00)
		return 0x00;
	return (word32) ((word32) *((word32) a0 + 24) < ~0x09);
}

