pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304F5C2: Register Eq_2 aws_iot_mqtt_autoreconnect_set_status(Register Eq_2 a0, Register word32 a1)
// Called from:
//      aws_iot_shadow_set_autoreconnect_status
Eq_2 aws_iot_mqtt_autoreconnect_set_status(Eq_2 a0, word32 a1)
{
	if (a0 == 0x00)
		return ~0x01;
	((word32) a0 + 26)->u1 = (byte) a1;
	return 0x00;
}

// 2304F5D0: Register Eq_2 aws_iot_mqtt_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_connect
//      aws_iot_mqtt_attempt_reconnect
Eq_2 aws_iot_mqtt_connect(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s6Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s1_16 = ~0x01;
	if (a0 != 0x00)
	{
		aws_iot_mqtt_internal_flushBuffers(a0);
		s2 = a1;
		Eq_2 a0_23 = aws_iot_mqtt_get_client_state(a0);
		if (a0_23 == 0x01)
		{
l2304F614:
			struct Eq_263128 * sp_111;
			Eq_2 a2_423;
			Eq_2 s1_238;
			Eq_2 a1_119;
			Eq_2 s1_567;
			word32 s6_1135;
			word32 s5_1134;
			word32 s3_1133;
			word32 a0_1130;
			word32 a1_1131;
			word32 a2_1132;
			Eq_2 s1_103;
			Eq_2 s2_105;
			Eq_2 a4_108;
			Eq_2 a3_109;
			Eq_2 s4_106;
			Eq_2 s0_114 = aws_iot_mqtt_set_client_state(s1_16, a0, 0x02, a3, a4, s3, s4, mstatus, dwLoc38, dwArg98, dwArgD8, dwArg0118, out s1_103, out a0_1130, out a1_1131, out a2_1132, out a3_109, out a4_108, out s2_105, out s3_1133, out s4_106, out s5_1134, out s6_1135);
			s3 = (word32) s0_114 + 0x04E0;
			if (s2_105 != 0x00)
			{
				word32 a0_73;
				ra = aws_iot_mqtt_set_connect_params(ra, s1_103, s0_114, s2_105, dwLoc38, dwLoc18, dwLoc08, dwArg14, s1, dwArg7C, out s1_103, out a0_73, out a1_119, out a3_109, out a4_108, out s2_105, out s3, out s4_106);
				if (a0_73 != 0x00)
				{
					s1_567.u0 = ~0x19;
					goto l2304F86E;
				}
			}
			Eq_2 s1_112;
			word32 a5_120;
			word32 tp_128;
			word32 a7_129;
			word32 s5_130;
			word32 s6_131;
			word32 t0_132;
			word32 t1_133;
			word32 t4_134;
			word32 t5_135;
			word32 t6_136;
			word32 s11_138;
			word32 s7_139;
			word32 s9_140;
			Eq_2 a0_118;
			(*((word32) s0_114 + 0x04E0))();
			if (a0_118 == 0x00)
			{
				init_timer(&sp_111->b000C + 8);
				Eq_2 s0_142 = *((word32) a1_119 + 36);
				word32 a2_1136;
				word32 a5_151 = (word32) *((word32) countdown_ms(&sp_111->b000C + 8, a1_119, out a2_1136) + 1118);
				sp_111->b000C = 0x00;
				s0_114 = *((word32) s1_112 + 52);
				((word32) s0_114 + 40)->u0 = (word16) a5_151;
				s4_106 = (word32) s0_142 + 64;
				s2_105 = (word32) *((word32) s0_114 + 1116);
				if (*((word32) s0_114 + 1112) == 0x00)
				{
					if (s2_105 != 0x00)
					{
l2304F65E:
						a0_118.u0 = ~0x01;
						goto l2304F660;
					}
				}
				else if (s2_105 == 0x00)
					goto l2304F65E;
				a4_108 = (word32) *((word32) s0_114 + 0x0454);
				a0_118.u0 = -37;
				if (a4_108 != 0x04)
					goto l2304F660;
				word32 a5_162 = (word32) *((word32) s0_114 + 1121);
				sp_111->t0008 = (word32) s0_142 + 64;
				s2_105 = (word32) s2_105 + 0x0C;
				if (a5_162 != 0x00)
					s2_105 = s2_105 + 0x0C + (CONVERT(Mem165[s0_114 + 1132:uint16] + Mem165[s0_114 + 0x0474:uint16], uint16, uint16) + 0x04);
				if (*((word32) s0_114 + 1144) != 0x00)
					s2_105 = (word32) s2_105 + ((word32) (*((word32) s0_114 + 1148)) + 0x02);
				if (*((word32) s0_114 + 1152) != 0x00)
					s2_105 = (word32) s2_105 + ((word32) (*((word32) s0_114 + 0x0484)) + 0x02);
				if (s1_112 < aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(s2_105, out a3_109, out a4_108))
				{
					a0_118.u0 = -33;
					goto l2304F660;
				}
				Eq_2 a5_208;
				a0_118 = aws_iot_mqtt_internal_init_header(&sp_111->b000C, (struct Eq_263391 *) 0x01, 0x00, null, 0x00, out a1_119, out a3_109, out a4_108, out a5_208);
				if (a0_118 != 0x00)
					goto l2304F660;
				struct Eq_263413 * a5_224;
				word32 a5_1142;
				word32 a1_1143;
				word32 a3_1144;
				word32 a4_1145;
				sp_111->t0008 = a5_224 + aws_iot_mqtt_internal_write_len_to_buffer(aws_iot_mqtt_internal_write_char((word32) sp_111->b000C, a5_208, out a5_1142), s2_105, out a1_1143, out a3_1144, out a4_1145, out a5_224) / 5;
				Eq_2 a5_237;
				word32 a4_1148;
				word32 s2_1149;
				word32 a0_1146;
				word32 a1_1147;
				s1_238 = aws_iot_mqtt_internal_write_utf8_string(587758716, 0x04, a5_224, sp_111->dw0038, out a0_1146, out a1_1147, out a3, out a4_1148, out a5_237, out s2_1149);
				word32 a5_1150;
				aws_iot_mqtt_internal_write_char((word32) *((word32) s0_114 + 0x0454), a5_237, out a5_1150);
				ui32 a1_257 = (word32) ((word32) *((word32) s0_114 + 1120) != 0x00);
				Eq_2 a1_258 = a1_257 << 1;
				if ((word32) *((word32) s0_114 + 1121) != 0x00)
					a1_258 = (a1_257 << 1 | 4 | ((word32) (*((word32) s0_114 + 0x0477)) << 3 | (word32) (*((word32) s0_114 + 1142)) << 5)) & 0x00FF;
				if (*((word32) s0_114 + 1152) != 0x00)
					a1_258 |= 64;
				Eq_2 a5_274 = *((word32) s0_114 + 1144);
				if (a5_274 != 0x00)
					a1_258 |= 0x0080;
				struct Eq_263413 * a5_284;
				aws_iot_mqtt_internal_write_char(a1_258, a5_274, out a5_284);
				struct Eq_263413 * a5_291;
				word32 a4_1151;
				aws_iot_mqtt_internal_write_uint_16((word32) *((word32) s0_114 + 1118), a5_284, out a4_1151, out a5_291);
				Eq_2 a1_292 = *((word32) s0_114 + 1112);
				if (a1_292 == 0x00)
				{
					word32 a5_1156;
					aws_iot_mqtt_internal_write_uint_16(a1_292, a5_291, out a4, out a5_1156);
				}
				else
				{
					word32 s2_1155;
					word32 a1_1153;
					word32 a5_1154;
					word32 a0_1152;
					s1_238 = aws_iot_mqtt_internal_write_utf8_string(a1_292, (word32) *((word32) s0_114 + 1116), a5_291, sp_111->dw0038, out a0_1152, out a1_1153, out a3, out a4, out a5_1154, out s2_1155);
				}
				struct Eq_263413 * a5_318 = (word32) *((word32) s0_114 + 1121);
				if (a5_318 != null)
				{
					struct Eq_263413 * a5_327;
					word32 a0_1157;
					word32 a1_1158;
					word32 a4_1160;
					word32 a3_1159;
					word32 s2_1161;
					aws_iot_mqtt_internal_write_utf8_string(*((word32) s0_114 + 1128), (word32) *((word32) s0_114 + 1132), a5_318, sp_111->dw0038, out a0_1157, out a1_1158, out a3_1159, out a4_1160, out a5_327, out s2_1161);
					word32 a0_1162;
					word32 a1_1163;
					word32 s2_1164;
					s1_238 = aws_iot_mqtt_internal_write_utf8_string(*((word32) s0_114 + 1136), (word32) *((word32) s0_114 + 0x0474), a5_327, sp_111->dw0038, out a0_1162, out a1_1163, out a3, out a4, out a5_318, out s2_1164);
				}
				Eq_2 a1_362 = *((word32) s0_114 + 1144);
				if (a1_362 != 0x00)
				{
					word32 a1_1166;
					word32 s2_1167;
					word32 a0_1165;
					s1_238 = aws_iot_mqtt_internal_write_utf8_string(a1_362, (word32) *((word32) s0_114 + 1148), a5_318, sp_111->dw0038, out a0_1165, out a1_1166, out a3, out a4, out a5_318, out s2_1167);
				}
				Eq_2 a1_386 = *((word32) s0_114 + 1152);
				if (a1_386 != 0x00)
				{
					word32 a5_1169;
					word32 s2_1170;
					word32 a0_1168;
					s1_238 = aws_iot_mqtt_internal_write_utf8_string(a1_386, (word32) *((word32) s0_114 + 0x0484), a5_318, sp_111->dw0038, out a0_1168, out a1_386, out a3, out a4, out a5_1169, out s2_1170);
				}
				Eq_2 a1_422 = a1_386 - ((word32) s0_142 + 64);
				if (a1_422 == 0x00)
				{
					a2_423.u0 = 0x03;
l2304F850:
					word32 a0_1137;
					word32 a2_1139;
					word32 s4_1140;
					word32 s5_1141;
					word32 a1_1138;
					aws_iot_mqtt_set_client_state(s1_238, s0_114, a2_423, a3, a4, s3, s4_106, mstatus, sp_111->t0008, sp_111->t00D8, sp_111->t0118, sp_111->t0158, out s1_16, out a0_1137, out a1_1138, out a2_1139, out a3, out a4, out s2, out s3, out s4_1140, out s5_1141, out s6);
					goto l2304F858;
				}
				word32 s5_1173;
				word32 s6_1174;
				word32 s1_1171;
				word32 a2_1172;
				ra = aws_iot_mqtt_internal_send_packet(ra, s0_114, a1_422, &sp_111->b000C + 8, a3, a4, mstatus, sp_111->t0054, sp_111->t00C8, sp_111->t0108, sp_111->t0128, out s0_114, out s1_1171, out a0_118, out a1_119, out a2_1172, out a3_109, out a4_108, out s2_105, out s3, out s4_106, out s5_1173, out s6_1174, out mstatus);
				if (a0_118 == 0x00)
				{
					word32 s7_1175;
					word32 s10_1176;
					word32 s1_501;
					ra = aws_iot_mqtt_internal_wait_for_read(ra, s0_114, &sp_111->b000C + 8, a3_109, a4_108, s10, mstatus, sp_111->t0004, sp_111->t0018, sp_111->t0064, sp_111->t0078, sp_111->t00B8, sp_111->t0108, sp_111->t0148, out s0_114, out s1_501, out a0_118, out a1_119, out a3_109, out a4_108, out s2_105, out s3, out s4_106, out s7_1175, out s10_1176, out mstatus);
					if (a0_118 == 0x00)
					{
						s0_114 = *((word32) a3_109 + 56);
						a4_108.u0 = 0x03;
						a0_118.u0 = ~0x1F;
						if (a3_109 > 0x03)
						{
							sp_111->t0004 = (word32) s0_114 + 576;
							sp_111->dw0084 = 0x00;
							sp_111->t0008.u0 = 0x00;
							word32 a5_1177;
							s2_105 = aws_iot_mqtt_internal_read_char((word32) s0_114 + 576, out a4_108, out a5_1177) >> 4 & 0x00FF;
							a0_118.u0 = ~0x00;
							if (s2_105 == 0x02)
							{
								s0_114 = sp_111->t0044;
								a1_119 = &sp_111->b000C;
								word32 a5_547;
								a0_118 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer(~0x00, &sp_111->b000C, &sp_111->b000C + 4, out a3_109, out a4_108, out a5_547);
								if (a0_118 == 0x00)
								{
									s0_114 = sp_111->t00E4;
									Eq_2 a5_555 = (word16) a4_108.u0 + a5_547;
									sp_111->t0004 = a5_555;
									a0_118.u0 = -35;
									if (a5_555 == s2_105)
									{
										word32 a4_1178;
										Eq_2 a5_561;
										aws_iot_mqtt_internal_read_char(a5_555, out a4_1178, out a5_561);
										word32 a5_1179;
										if (aws_iot_mqtt_internal_read_char(a5_561, out a4_108, out a5_1179) <= 0x05)
										{
											Eq_2 s1_573;
											Eq_2 ra_574;
											ptr32 s0_575;
											ptr32 s2_576;
											Eq_2 s3_577;
											ptr32 s4_578;
											Eq_2 a0_579;
											Eq_2 a4_582;
											Eq_2 a3_587;
											ptr32 mstatus_588;
											word32 tp_589;
											word32 a7_590;
											word32 s5_591;
											ptr32 s6_592;
											word32 t0_593;
											word32 t1_594;
											word32 t4_595;
											word32 t5_596;
											word32 t6_597;
											Eq_2 s10_598;
											word32 s11_599;
											word32 s7_600;
											word32 s9_601;
											g_t23087C64();
											s0Out = s0_575;
											s1Out = s1_573;
											a0Out = a0_579;
											a3Out = a3_587;
											a4Out = a4_582;
											s2Out = s2_576;
											s3Out = s3_577;
											s4Out = s4_578;
											s6Out = s6_592;
											s10Out = s10_598;
											mstatusOut = mstatus_588;
											return ra_574;
										}
										s1_567.u0 = -36;
l2304F86E:
										word32 s1_652;
										word32 ra_653;
										struct Eq_263267 * s0_654;
										word32 s2_655;
										word32 s3_656;
										word32 s4_657;
										word32 a1_659;
										word32 a4_661;
										word32 a3_666;
										word32 mstatus_667;
										(*((word32) s0_114 + 0x04EC))();
										word32 a0_690;
										word32 a5_692;
										word32 tp_700;
										word32 a7_701;
										word32 s5_702;
										word32 t0_704;
										word32 t1_705;
										word32 t4_706;
										word32 t5_707;
										word32 t6_708;
										word32 s11_710;
										word32 s7_711;
										word32 s9_712;
										s0_654->ptr04F4();
										a2_423.u0 = 11;
										if (a0_690 != 0x00)
										{
											s1_16.u0 = ~0x0C;
											goto l2304F858;
										}
										goto l2304F850;
									}
								}
							}
						}
					}
				}
			}
l2304F660:
			s1_567 = a0_118;
			goto l2304F86E;
		}
		s1_16.u0 = ~0x0E;
		if ((int32) (byte) a0_23 == 0x00)
			goto l2304F858;
		a4.u0 = 0x02;
		if (((word32) a0_23 - 11 & 0x00FF) <= 0x02)
			goto l2304F614;
	}
l2304F858:
	s0Out = dwArg0158;
	s1Out = s1_16;
	a0Out = s1_16;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArgF4;
	s6Out = s6;
	s10Out = s10;
	mstatusOut = mstatus;
	return ra;
}

// 2304F8A4: Register Eq_2 _aws_iot_mqtt_internal_disconnect(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_disconnect
Eq_2 _aws_iot_mqtt_internal_disconnect(Eq_2 ra, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	word32 a2_204;
	word32 s4_205;
	Eq_2 a1_24;
	Eq_2 a4_117;
	Eq_2 a3_110;
	ptr32 a0_131;
	ptr32 s1_107;
	ptr32 s2_118;
	ptr32 s0_105 = aws_iot_mqtt_internal_serialize_zero((word32) *((word32) a1 + 52) + 64, a1, (struct Eq_263391 *) 0x0E, fp + ~0x1F, out s1_107, out a0_131, out a1_24, out a2_204, out a3_110, out a4_117, out s2_118, out s4_205);
	if (a0_131 == 0x00)
	{
		init_timer(fp + ~0x1B);
		word32 a2_206;
		Eq_2 s0_36 = countdown_ms(fp + ~0x1B, a1_24, out a2_206);
		0x00 = (uint16) dwArg44;
		if (a1_24 != 0x00)
		{
			word32 s1_207;
			word32 a0_208;
			word32 a2_209;
			word32 a3_210;
			word32 a4_211;
			word32 s2_212;
			word32 s3_213;
			word32 s4_214;
			word32 s5_215;
			word32 s6_216;
			ra = aws_iot_mqtt_internal_send_packet(ra, s0_36, a1_24, fp + ~0x1B, a3_110, a4_117, mstatus, dwArg34, dwArgA8, dwArgE8, dwArg0108, out s0_36, out s1_207, out a0_208, out a1_24, out a2_209, out a3_210, out a4_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out mstatus);
		}
		word32 s1_70 = (word32) s0_36 + 0x04E0;
		struct Eq_264010 * s0_77;
		word32 ra_78;
		word32 s1_79;
		word32 a1_81;
		word32 mstatus_91;
		(*((word32) s0_36 + 0x04EC))();
		word32 a0_108;
		word32 tp_120;
		word32 a7_122;
		word32 t0_125;
		word32 t1_126;
		word32 t4_127;
		word32 t5_128;
		word32 t6_129;
		s0_77->ptr04F4();
		a0_131 = 0x00 - (word32) (a0_108 != 0x00);
	}
	s0Out = s0_105;
	s1Out = s1_107;
	a0Out = a0_131;
	a3Out = a3_110;
	a4Out = a4_117;
	s2Out = s2_118;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2304F900: Register Eq_2 aws_iot_mqtt_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_disconnect
//      _aws_iot_mqtt_handle_disconnect
Eq_2 aws_iot_mqtt_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x01;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = ~0x01;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_14 = aws_iot_mqtt_get_client_state(a0);
		Eq_2 s1_129 = a0_14;
		ptr32 a5_18 = ~0x0C;
		if (aws_iot_mqtt_is_client_connected(a0) != 0x00)
		{
			ptr32 a0_27;
			Eq_2 a1_28;
			word32 a2_179;
			aws_iot_mqtt_set_client_state(a0_14, a0, 0x0A, a3, a4, s3, s4, mstatus, dwLoc08, dwArgC8, dwArg0108, dwArg0148, out s1_129, out a0_27, out a1_28, out a2_179, out a3, out a4, out s2, out s3, out s4, out s5, out s6);
			a5_18 = a0_27;
			if (a0_27 == 0x00)
			{
				ptr32 a0_52;
				struct Eq_264102 * s0_59;
				ra = _aws_iot_mqtt_internal_disconnect(ra, a1_28, mstatus, dwArg24, dwArg34, dwArg98, dwArgD8, dwArgF8, out s0_59, out s1_129, out a0_52, out a3, out a4, out s2, out s3, out s4, out s5, out s6, out mstatus);
				a5_18 = a0_52;
				if (a0_52 != 0x00)
					s0_59->b0018 = (byte) s1_129;
				else
				{
					s0_59->b0018 = 0x0C;
					a4.u0 = 0x0C;
				}
			}
		}
		s1Out = s1_129;
		a0Out = a5_18;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_18;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2304F952: Register Eq_2 aws_iot_mqtt_attempt_reconnect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_264153) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_yield
Eq_2 aws_iot_mqtt_attempt_reconnect(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0148, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_264153 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x01;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ptr32 a5_111 = ~0x0E;
		if (aws_iot_mqtt_is_client_connected(a0) == 0x00)
		{
			Eq_2 s0_25;
			Eq_2 s1_26;
			Eq_2 s4_27;
			Eq_2 a3_31;
			Eq_2 a4_32;
			Eq_2 s3_40;
			ptr32 s6_42;
			word32 a0_225;
			word32 s2_226;
			ra = aws_iot_mqtt_connect(ra, s1, a0, a3, a4, s3, s4, mstatus, dwArg04, dwArg6C, dwArg88, dwArgC8, dwArg0108, out s0_25, out s1_26, out a0_225, out a3_31, out a4_32, out s2_226, out s3_40, out s4_27, out s6_42, out s10, out mstatus);
			if (aws_iot_mqtt_get_client_state(s0_25) != 0x03)
			{
				word32 a0_227;
				word32 a2_228;
				word32 s2_229;
				aws_iot_mqtt_set_client_state(s1_26, s0_25, 0x0D, a3_31, a4_32, s3_40, s4_27, mstatus, dwLoc08, dwArgC8, dwArg0108, dwArg0148, out s1, out a0_227, out a1, out a2_228, out a3, out a4, out s2_229, out s3, out s4, out s5, out s6);
				a5_111 = 0x04;
			}
			else
			{
				ptr32 a0_55;
				ra = aws_iot_mqtt_resubscribe(s1_26, s0_25, a3_31, s3_40, s4_27, s6_42, s10, mstatus, s0, dwArg04, dwArg18, dwArg58, dwArg68, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, out s1, out a0_55, out a1, out a3, out a4, out s3, out s4, out s5, out s6, out s10, out mstatus);
				a5_111 = a0_55;
				if (a0_55 == 0x00)
					a5_111 = 0x03;
			}
		}
		s1Out = s1;
		a0Out = a5_111;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2304F9A0: Register word32 aws_iot_mqtt_internal_serialize_ack(Register word32 a0, Register Eq_2 a1, Register (ptr32 Eq_263391) a2, Register (ptr32 Eq_263393) a3, Register Eq_2 a4, Register (ptr32 word32) a5, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out (ptr32 byte) a2Out, Register out (ptr32 Eq_263393) a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out (ptr32 word32) s3Out)
// Called from:
//      aws_iot_mqtt_internal_cycle_read
word32 aws_iot_mqtt_internal_serialize_ack(word32 a0, Eq_2 a1, struct Eq_263391 * a2, struct Eq_263393 * a3, Eq_2 a4, word32 * a5, Eq_2 dwArg0128, union Eq_2 & a0Out, union Eq_2 & a1Out, byte & a2Out, struct Eq_263393 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, word32 & s3Out)
{
	Eq_2 s0_15 = ~0x01;
	if (a0 != 0x00 && a5 != null)
	{
		s0_15.u0 = -33;
		if (a1 > 0x03)
		{
			Eq_2 a5_36;
			Eq_2 a0_33 = aws_iot_mqtt_internal_init_header(fp + -40, a2, (word32) (a2 < (struct Eq_263391 *) ~0x06), a3, 0x00, out a1, out a3, out a4, out a5_36);
			s2 = a4;
			s3 = a5;
			s0_15 = a0_33;
			if (a0_33 == 0x00)
			{
				struct Eq_263413 * a5_51;
				word32 a5_109;
				word32 a1_110;
				word32 a4_111;
				aws_iot_mqtt_internal_write_len_to_buffer(aws_iot_mqtt_internal_write_char(0x00, a5_36, out a5_109), 0x02, out a1_110, out a3, out a4_111, out a5_51);
				word32 a5_112;
				*a5 = aws_iot_mqtt_internal_write_uint_16(a4, a5_51, out a4, out a5_112) - a0;
				a1 = a4;
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	a0Out = s0_15;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	return dwArgE4;
}

