pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304FA14: Register word32 aws_iot_mqtt_internal_deserialize_publish(Register up32 t1, Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register (ptr32 byte) a2, Register (ptr32 word16) a3, Register Eq_2 a4, Register Eq_2 a5, Register (ptr32 word32) a6, Register (ptr32 Eq_264475) a7, Stack Eq_264351 dwArgA4, Stack word32 dwArg0198, Register out (ptr32 Eq_264353) s0Out, Register out Eq_2 a0Out, Register out (ptr32 byte) a1Out, Register out (ptr32 byte) a2Out, Register out (ptr32 word16) a3Out, Register out Eq_2 a4Out, Register out (ptr32 word32) s2Out, Register out (ptr32 Eq_264475) s3Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out)
// Called from:
//      aws_iot_mqtt_internal_cycle_read
word32 aws_iot_mqtt_internal_deserialize_publish(up32 t1, byte * a0, byte * a1, byte * a2, word16 * a3, Eq_2 a4, Eq_2 a5, word32 * a6, union Eq_264475 * a7, Eq_264351 dwArgA4, word32 dwArg0198, struct Eq_264353 & s0Out, union Eq_2 & a0Out, byte & a1Out, byte & a2Out, word16 & a3Out, union Eq_2 & a4Out, word32 & s2Out, union Eq_264475 & s3Out, union Eq_2 & s6Out, union Eq_2 & s7Out)
{
	Eq_2 s7_110;
	if (a0 != null && (a1 != null && (a2 != null && a3 != null)))
	{
		s7_110.u0 = ~0x1F;
		if (t1 > 0x03)
		{
			word32 a5_233;
			Eq_263847 a0_50 = aws_iot_mqtt_internal_read_char(a5, out a4, out a5_233);
			s3 = a7;
			s2 = a6;
			s6 = a4;
			if ((a0_50 >> 0x04 & 0x00FF) != 0x03)
				goto l2304FA36;
			*a0 = (byte) (a0_50 >> 0x03 & 0x01);
			*a1 = (byte) (a0_50 >> 0x01 & 0x03);
			*a2 = (byte) (a0_50 & 0x01);
			int32 a5_68;
			Eq_2 a0_66 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer(a0_50 & 0x01, fp + -56, fp + -52, out a3, out a4, out a5_68);
			a1 = fp + -56;
			s7_110 = a0_66;
			if (a0_66 == 0x00)
			{
				a4.u0 = 0x01;
				Eq_264434 s0_79 = (word32) dwArgA4 + a5_68;
				if (a5_68 <= 0x01)
					goto l2304FA36;
				word32 a5_234;
				up32 a0_81 = aws_iot_mqtt_internal_read_uint16_t(0x01, out a3, out a4, out a5_234);
				a5->u0 = (word16) a0_81;
				if (s0_79 < (word32) dwArgA4 + a0_81)
					goto l2304FA36;
				*a4.u0 = dwArgA4;
				if (s0_79 - ((word32) dwArgA4 + (word32) (*a5)) < 0x00)
					goto l2304FA36;
				Eq_264468 a5_104 = (word32) *a1;
				if (a5_104 != 0x00)
					*a3 = (word16) aws_iot_mqtt_internal_read_uint16_t(a4, out a3, out a4, out a5_104);
				*a7 = (union Eq_264475 *) (s0_79 - a5_104);
				*a6 = (word32) a5_104;
			}
		}
l2304FA38:
		0x00 = dwArg0198;
		s0Out = dwArg0158;
		a0Out = s7_110;
		a1Out = a1;
		a2Out = dwArg0138;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7_110;
		return dwArg4C;
	}
	else
	{
l2304FA36:
		s7_110.u0 = ~0x00;
		goto l2304FA38;
	}
}

// 2304FB00: Register Eq_2 aws_iot_mqtt_internal_deserialize_ack(Register (ptr32 byte) a0, Register (ptr32 Eq_264493) a1, Register (ptr32 word16) a2, Register (ptr32 Eq_264495) a3, Register Eq_2 a4, Register out (ptr32 Eq_264493) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_264495) a3Out, Register out Eq_2 a4Out, Register out (ptr32 word16) s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      aws_iot_mqtt_publish
//      aws_iot_mqtt_unsubscribe
Eq_2 aws_iot_mqtt_internal_deserialize_ack(byte * a0, struct Eq_264493 * a1, word16 * a2, struct Eq_264495 * a3, Eq_2 a4, struct Eq_264493 & s1Out, union Eq_2 & a0Out, struct Eq_264495 & a3Out, union Eq_2 & a4Out, word16 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s0_16 = ~0x01;
	if (a0 != null && (a1 != null && (a2 != null && a3 != null)))
	{
		s0_16.u0 = ~0x1F;
		if (a4 > 0x03)
		{
			word32 a4_107;
			word32 a5_108;
			Eq_263847 a0_27 = aws_iot_mqtt_internal_read_char(0x03, out a4_107, out a5_108);
			a1->b0000 = (byte) (a0_27 >> 0x03 & 0x01);
			*a0 = (byte) (a0_27 >> 4);
			word32 a5_109;
			Eq_2 a0_38 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer(a0_27 >> 4, fp + ~0x17, fp + ~0x13, out a3, out a4, out a5_109);
			s1 = a1;
			s2 = a2;
			s0_16 = a0_38;
			if (a0_38 == 0x00)
			{
				s0_16 = dwArgA4;
				if (a4 > 0x01)
				{
					word32 a5_110;
					*a2 = (word16) aws_iot_mqtt_internal_read_uint16_t(a4, out a3, out a4, out a5_110);
				}
				else
					s0_16.u0 = ~0x00;
			}
		}
	}
	s1Out = s1;
	a0Out = s0_16;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s4Out = dwArg04;
	s8Out = 0x00;
	return s0_16;
}

// 2304FB78: Register Eq_2 aws_iot_mqtt_publish(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0104, Stack ptr32 dwArg0184, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      publishToShadowAction
Eq_2 aws_iot_mqtt_publish(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, word32 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArg0104, ptr32 dwArg0184, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || (a2 == 0x00 || a3 == 0x00)))
	{
		s0Out = s0;
		a0Out = ~0x01;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 s0_332 = a0;
	Eq_2 s3_241 = a2;
	ptr32 a5_348 = ~0x0C;
	if (aws_iot_mqtt_is_client_connected(a0) != 0x00)
	{
		Eq_2 a0_44 = aws_iot_mqtt_get_client_state(a0);
		s4 = a0_44;
		if (a0_44 == 0x03)
		{
l2304FBCE:
			ptr32 a0_63;
			Eq_2 a1_64;
			Eq_2 s5_79;
			word32 s6_663;
			word32 a2_661;
			word32 a4_662;
			Eq_2 s1_239;
			Eq_2 a3_130;
			s0_332 = aws_iot_mqtt_set_client_state(a3, a0, 0x05, a3, a4, a2, a0_44, mstatus, dwLoc68, dwArg68, dwArgA8, dwArgE8, out s1_239, out a0_63, out a1_64, out a2_661, out a3_130, out a4_662, out s2, out s3_241, out s4, out s5_79, out s6_663);
			a5_348 = a0_63;
			if (a0_63 == 0x00)
			{
				init_timer(fp + -76);
				word32 a2_664;
				Eq_2 s0_93 = countdown_ms(fp + -76, a1_64, out a2_664);
				if ((word32) *s1_239 == 0x01)
					((word32) s1_239 + 4)->u0 = (word16) aws_iot_mqtt_get_next_packet_id(s0_93);
				Eq_2 s9_105 = *((word32) s1_239 + 8);
				Eq_2 s0_111 = *((word32) a3_130 + 52);
				word32 s7_112 = (word32) *s1_239;
				Eq_2 a4_113 = (word32) *((word32) s1_239 + 1);
				Eq_2 s10_114 = (word32) *((word32) s1_239 + 4);
				Eq_2 s6_115 = *((word32) s1_239 + 0x0C);
				if (s9_105 != 0x00)
				{
					word32 a5_118 = s3_241 + s6_115;
					Eq_2 s11_120 = a5_118 + 4;
					if (s7_112 == 0x00)
						s11_120 = a5_118 + 2;
					s0_111 = s7;
					if (a3_130 >= aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(s11_120, out a3_130, out a4_113))
					{
						Eq_2 a5_144;
						word32 a1_672;
						if (aws_iot_mqtt_internal_init_header(fp + -84, (struct Eq_263391 *) 0x03, s7_112, null, a4_113, out a1_672, out a3_130, out a4_113, out a5_144) == 0x00)
						{
							word32 a5_673;
							Eq_263420 a0_150 = aws_iot_mqtt_internal_write_char(0x00, a5_144, out a5_673);
							0x00 = dwArgE4;
							struct Eq_263413 * a5_158;
							word32 a1_674;
							word32 a4_676;
							word32 a3_675;
							aws_iot_mqtt_internal_write_len_to_buffer(a0_150, s11_120, out a1_674, out a3_675, out a4_676, out a5_158);
							0x00 = dwArg0184;
							struct Eq_263413 * a5_172;
							word32 a1_677;
							word32 s2_680;
							word32 a3_678;
							word32 a4_679;
							Eq_2 a0_168;
							aws_iot_mqtt_internal_write_utf8_string(s5_79, s3_241, a5_158, dwLoc38, out a0_168, out a1_677, out a3_678, out a4_679, out a5_172, out s2_680);
							if (s7_112 != 0x00)
							{
								word32 a5_691;
								word32 a4_690;
								a0_168 = aws_iot_mqtt_internal_write_uint_16(s10_114, a5_172, out a4_690, out a5_691);
							}
							0x00 = dwArgE4;
							Eq_2 a4_200;
							word32 a1_203;
							Eq_2 a3_205;
							word32 a5_682;
							word32 a2_681;
							word32 a6_683;
							word32 a7_684;
							memcpy(a0_168, s9_105, s6_115, out a1_203, out a2_681, out a3_205, out a4_200, out a5_682, out a6_683, out a7_684);
							0x00 = (uint16) dwArg0104;
							word32 a0_227;
							word32 s5_688;
							word32 s6_689;
							word32 a1_685;
							word32 a2_686;
							word32 s2_687;
							Eq_2 ra_251 = aws_iot_mqtt_internal_send_packet(ra, s7, (word32) s6_115 + a1_203 - ((word32) s0_93 + 64), fp + -76, a3_205, a4_200, mstatus, dwLoc1C, dwArg58, dwArg98, dwArgB8, out s0_111, out s1_239, out a0_227, out a1_685, out a2_686, out a3_130, out a4_113, out s2_687, out s3_241, out s4, out s5_688, out s6_689, out mstatus);
							if (a0_227 == 0x00)
							{
								a4_113 = (word32) *s1_239;
								if (a4_113 == 0x01)
								{
									word32 a0_259;
									word32 s10_695;
									word32 a1_692;
									word32 s2_693;
									word32 s7_694;
									aws_iot_mqtt_internal_wait_for_read(ra_251, s0_111, fp + -76, a3_130, a4_113, s10_114, mstatus, a3_130, dwLoc58, dwLoc0C, dwArg08, dwArg48, dwArg98, dwArgD8, out s0_111, out s1_239, out a0_259, out a1_692, out a3_130, out a4_113, out s2_693, out s3_241, out s4, out s7_694, out s10_695, out mstatus);
									if (a0_259 == 0x00)
									{
										word32 a0_696;
										word32 s2_697;
										word32 s8_698;
										s0_111 = aws_iot_mqtt_internal_deserialize_ack(fp + -84, fp + -0x0055, fp + -80, (word32) *((word32) a4_113 + 56) + 576, a4_113, out s1_239, out a0_696, out a3_130, out a4_113, out s2_697, out s4, out s8_698);
									}
								}
							}
						}
					}
				}
				ptr32 a0_325;
				word32 a1_666;
				word32 s1_665;
				word32 a3_668;
				word32 a2_667;
				word32 a4_669;
				word32 s5_670;
				word32 s6_671;
				s0_332 = aws_iot_mqtt_set_client_state(s1_239, s0_111, s4, a3_130, a4_113, s3_241, s4, mstatus, dwLoc68, dwArg68, dwArgA8, dwArgE8, out s1_665, out a0_325, out a1_666, out a2_667, out a3_668, out a4_669, out s2, out s3_241, out s4, out s5_670, out s6_671);
				a5_348 = a0_325;
				if (s2 != 0x00)
					a5_348 = s2;
			}
			goto l2304FCE6;
		}
		a4.u0 = 0x09;
		a5_348 = ~0x1D;
		if (a0_44 == 0x09)
			goto l2304FBCE;
	}
l2304FCE6:
	s0Out = s0_332;
	a0Out = a5_348;
	s2Out = s2;
	s3Out = s3_241;
	s4Out = s4;
	s9Out = dwArg18;
	mstatusOut = mstatus;
	return dwLoc24;
}

// 2304FD0A: Register word32 _aws_iot_mqtt_deserialize_suback.constprop.0(Register (ptr32 Eq_264881) a0, Register (ptr32 Eq_264882) a1, Register ptr32 a2, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_264882) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_264882) a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_264881) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
word32 _aws_iot_mqtt_deserialize_suback.constprop.0(struct Eq_264881 * a0, struct Eq_264882 * a1, ptr32 a2, Eq_2 a4, Eq_2 dwArg0128, struct Eq_264882 & s1Out, union Eq_2 & a0Out, struct Eq_264882 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_264881 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a5_146 = 0x04;
	Eq_2 s3_23 = ~0x1F;
	if (a4 > 0x04)
	{
		s2 = a0;
		s1 = a1;
		word32 a5_178;
		Eq_263863 a0_36 = aws_iot_mqtt_internal_read_char(0x04, out a4, out a5_178) >> 4 & 0x00FF;
		a5_146.u0 = 0x09;
		if (a0_36 != 0x09)
		{
l2304FD40:
			s3_23.u0 = ~0x00;
			goto l2304FD42;
		}
		Eq_2 a0_41 = aws_iot_mqtt_internal_decode_remaining_length_from_buffer(a0_36, fp + -40, fp + -36, out a3, out a4, out a5_146);
		a1 = fp + -40;
		s3_23 = a0_41;
		if (a0_41 != 0x00)
			goto l2304FD42;
		word32 s0_54 = a5_146 + a4 + a4;
		a5_146.u0 = 0x01;
		if (a4 <= 0x01)
			goto l2304FD40;
		a0->dw0000 = (int32) (word16) aws_iot_mqtt_internal_read_uint16_t(a4, out a3, out a4, out a5_146);
		a1->dw0000 = 0x00;
		s5 = 0x01;
		while (a5_146 < s0_54)
		{
			s1 = (struct Eq_264882 *) *a5_146.u0;
			if (a5_146 > 0x01)
				goto l2304FD40;
			*((word16) a5_146.u0 + 1) = s1;
			s2 = (struct Eq_264881 *) ((word16) a5_146.u0 + a2);
			s2->dw0000 = (int32) (byte) aws_iot_mqtt_internal_read_char(a5_146, out a4, out a5_146);
		}
	}
l2304FD42:
	0x00 = (uint16) dwArg0128;
	s1Out = s1;
	a0Out = s3_23;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_146;
	s2Out = s2;
	s3Out = s3_23;
	s4Out = dwArg78;
	s5Out = s5;
	return dwArgE4;
}

// 2304FDAA: Register word32 _aws_iot_mqtt_serialize_subscribe.constprop.1(Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_264979) a3, Register (ptr32 uint16) a4, Register (ptr32 byte) a5, Register (ptr32 word32) a6, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 uint16) s3Out, Register out ptr32 s4Out, Register out Eq_2 s7Out)
// Called from:
//      aws_iot_mqtt_subscribe
//      aws_iot_mqtt_resubscribe
word32 _aws_iot_mqtt_serialize_subscribe.constprop.1(Eq_2 a1, Eq_2 a2, struct Eq_264979 * a3, uint16 * a4, byte * a5, word32 * a6, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, ptr32 & a4Out, uint16 & s3Out, ptr32 & s4Out, union Eq_2 & s7Out)
{
	word32 s0_23 = (word32) *a4;
	word32 a3_183;
	ptr32 a4_154;
	if (a1 >= aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length(s0_23 + 0x05, out a3_183, out a4_154))
	{
		Eq_2 a5_55;
		word32 a3_184;
		if (aws_iot_mqtt_internal_init_header(fp + -56, (struct Eq_263391 *) 0x08, 0x01, null, 0x00, out a1, out a3_184, out a4_154, out a5_55) == 0x00)
		{
			struct Eq_263413 * a5_70;
			word32 a5_185;
			word32 a1_186;
			word32 a3_187;
			word32 a4_188;
			aws_iot_mqtt_internal_write_len_to_buffer(aws_iot_mqtt_internal_write_char(0x00, a5_55, out a5_185), s0_23 + 0x05, out a1_186, out a3_187, out a4_188, out a5_70);
			struct Eq_263413 * a5_79;
			word32 a4_189;
			aws_iot_mqtt_internal_write_uint_16(a2, a5_70, out a4_189, out a5_79);
			Eq_2 a5_87;
			word32 s2_89;
			word32 a0_190;
			word32 a1_191;
			word32 a3_192;
			aws_iot_mqtt_internal_write_utf8_string(a3->dw0000, (word32) *a4, a5_79, dwLoc18, out a0_190, out a1_191, out a3_192, out a4_154, out a5_87, out s2_89);
			a1 = (word32) *a5;
			word32 a5_193;
			*a6 = aws_iot_mqtt_internal_write_char(a1, a5_87, out a5_193) - s2_89;
		}
	}
	s0Out = s0_23 + 0x05;
	s1Out = dwLoc4C;
	a0Out = dwLoc4C;
	a1Out = a1;
	a3Out = s2;
	a4Out = a4_154;
	s3Out = a4;
	s4Out = dwArg0168;
	s7Out = a2;
	return dwLoc08;
}

// 2304FE54: Register word32 aws_iot_mqtt_subscribe(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s6, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_connect
//      registerJsonTokenOnDelta
//      subscribeToShadowActionAcks
word32 aws_iot_mqtt_subscribe(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s6, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || (a1 == 0x00 || a4 == 0x00))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x01;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_26 = a0;
		ptr32 s5_276 = a5;
		Eq_2 s2_269 = a3;
		Eq_2 s6_277 = a2;
		if (aws_iot_mqtt_is_client_connected(a0) != 0x00)
		{
			Eq_2 a0_38 = aws_iot_mqtt_get_client_state(a0);
			s3 = a0_38;
			if (a0_38 == 0x03 || a0_38 == 0x09)
			{
				word32 a0_56;
				Eq_2 a1_57;
				word32 s1_64;
				word32 a3_509;
				word32 s4_510;
				s0_26 = aws_iot_mqtt_set_client_state(a1, a0, 0x06, a3, a4, a0_38, a4, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_64, out a0_56, out a1_57, out a2, out a3_509, out a4, out s2_269, out s3, out s4_510, out s5_276, out s6_277);
				if (a0_56 == 0x00)
				{
					init_timer(fp + -44);
					byte bLoc41_401 = SLICE(s1_64, byte, 24);
					word32 a0_108;
					Eq_2 a1_126;
					word32 a2_511;
					Eq_2 s3_118;
					Eq_2 s0_115;
					Eq_2 s4_119;
					Eq_2 s1_116;
					Eq_2 a4_111;
					Eq_2 a3_110;
					Eq_2 ra_114 = _aws_iot_mqtt_serialize_subscribe.constprop.1(a1_57, aws_iot_mqtt_get_next_packet_id(countdown_ms(fp + -44, a1_57, out a2_511)), fp + -56, fp + -64, fp + -65, fp + -52, out s0_115, out s1_116, out a0_108, out a1_126, out a3_110, out a4_111, out s3_118, out s4_119, out s7);
					if (a0_108 == 0x00)
					{
						s1_116.u0 = 0x00;
						a4_111.u0 = 0x05;
						do
						{
							if (a3_110 == 0x00)
							{
								word32 a0_149;
								word32 s2_519;
								word32 s5_520;
								word32 s6_521;
								word32 a1_517;
								word32 a2_518;
								Eq_2 ra_173 = aws_iot_mqtt_internal_send_packet(ra_114, s0_115, a1_126, fp + -44, a3_110, 0x05, mstatus, dwArg04, dwArg78, dwArgB8, dwArgD8, out s0_115, out s1_116, out a0_149, out a1_517, out a2_518, out a3_110, out a4_111, out s2_519, out s3_118, out s4_119, out s5_520, out s6_521, out mstatus);
								if (a0_149 == 0x00)
								{
									word32 a0_179;
									word32 a1_522;
									word32 s2_523;
									aws_iot_mqtt_internal_wait_for_read(ra_173, s0_115, fp + -44, a3_110, a4_111, s10, mstatus, dwLoc4C, s6, dwArg14, dwArg28, dwArg68, dwArgB8, dwArgF8, out s0_115, out s1_116, out a0_179, out a1_522, out a3_110, out a4_111, out s2_523, out s3_118, out s4_119, out s7, out s10, out mstatus);
									if (a0_179 == 0x00)
									{
										word32 a0_213;
										word32 a5_215;
										Eq_2 s5_230;
										word32 s2_525;
										word32 a1_524;
										s0_115 = _aws_iot_mqtt_deserialize_suback.constprop.0(fp + -62, fp + -48, fp + -60, a4_111, dwArgD8, out s1_116, out a0_213, out a1_524, out a3_110, out a4_111, out a5_215, out s2_525, out s3_118, out s4_119, out s5_230);
										if (a0_213 == 0x00)
										{
											a3_110 = (word32) s0_115 + (s1_116 << 0x04);
											*((word32) a3_110 + 0x0488) = a5_215;
											*((word32) a3_110 + 1168) = s4_119;
											*((word32) a3_110 + 0x0494) = s5_230;
											*((word32) a3_110 + 1164) = 0x00;
											((word32) a3_110 + 1166)->u1 = (byte) (word32) bLoc41_401;
										}
									}
								}
								break;
							}
							s1_116 = (word16) s1_116.u0 + 1;
						} while (s1_116 != 0x05);
					}
					word32 s1_512;
					word32 a0_513;
					word32 a1_514;
					word32 s4_516;
					word32 a3_515;
					s0_26 = aws_iot_mqtt_set_client_state(s1_116, s0_115, s3_118, a3_110, a4_111, s3_118, s4_119, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_512, out a0_513, out a1_514, out a2, out a3_515, out a4, out s2_269, out s3, out s4_516, out s5_276, out s6_277);
				}
			}
		}
		s0Out = s0_26;
		s1Out = dwLoc4C;
		a0Out = dwArg0188;
		a2Out = a2;
		a3Out = s2;
		a4Out = a4;
		s2Out = s2_269;
		s3Out = s3;
		s4Out = dwArg0168;
		s5Out = s5_276;
		s6Out = s6_277;
		s7Out = s7;
		s10Out = s10;
		mstatusOut = mstatus;
		return dwLoc08;
	}
}

