pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 2304FF92: Register word32 aws_iot_mqtt_resubscribe(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 s6, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_attempt_reconnect
word32 aws_iot_mqtt_resubscribe(Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s3, Eq_2 s4, ptr32 s6, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a0Out = ~0x01;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		byte bLoc35_433 = SLICE(s6, byte, 24);
		ptr32 a5_25 = ~0x0C;
		if (aws_iot_mqtt_is_client_connected(a0) != 0x00)
		{
			a4 = 0x03;
			a5_25 = ~0x1D;
			if (aws_iot_mqtt_get_client_state(a0) == 0x03)
			{
				ptr32 a0_35;
				word32 s1_528;
				word32 s2_530;
				word32 s4_531;
				word32 a2_529;
				Eq_2 a3_112;
				Eq_2 s0_117 = aws_iot_mqtt_set_client_state(s1, a0, 0x08, a3, 0x03, s3, s4, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_528, out a0_35, out a1, out a2_529, out a3_112, out a4, out s2_530, out s3, out s4_531, out s5, out s6);
				a5_25 = a0_35;
				if (a0_35 == 0x00)
				{
					struct Eq_264979 * s2_219 = (word32) s0_117 + 0x0488;
					Eq_2 s3_120 = 0x00;
					Eq_2 a4_113 = 0x05;
					Eq_2 dwLoc38_434 = SEQ(bLoc35_433, 0x00, 0x00);
					while (a3_112 != 0x00)
					{
						s3_120 = (word32) s3_120 + 1;
						if (s3_120 == 0x05)
							break;
					}
					Eq_2 s4_121 = 0x00;
					while (true)
					{
						Eq_2 s1_135;
						if (s3_120 == s4_121)
							break;
						if (s2_219->dw0000 != 0x00)
						{
							init_timer(fp + -44);
							word32 a2_536;
							countdown_ms(fp + -44, a1, out a2_536);
							Eq_2 a0_110;
							Eq_2 a1_128;
							word32 s1_537;
							word32 s7_538;
							Eq_2 ra_116 = _aws_iot_mqtt_serialize_subscribe.constprop.1(a1, aws_iot_mqtt_get_next_packet_id(*((word32) a1 + 52)), s2_219, &s2_219->dw0000 + 1, (char *) &s2_219->dw0000 + 6, fp + -52, out s0_117, out s1_537, out a0_110, out a1_128, out a3_112, out a4_113, out s3_120, out s4_121, out s7_538);
							s1_135 = a0_110;
							if (a0_110 != 0x00)
								goto l23050076;
							Eq_2 a0_140;
							word32 s2_542;
							word32 s5_543;
							word32 s6_544;
							word32 a1_540;
							word32 a2_541;
							word32 s1_539;
							Eq_2 ra_164 = aws_iot_mqtt_internal_send_packet(ra_116, s0_117, a1_128, fp + -44, a3_112, a4_113, mstatus, dwArg04, dwArg78, dwArgB8, dwArgD8, out s0_117, out s1_539, out a0_140, out a1_540, out a2_541, out a3_112, out a4_113, out s2_542, out s3_120, out s4_121, out s5_543, out s6_544, out mstatus);
							s1_135 = a0_140;
							if (a0_140 != 0x00)
								goto l23050076;
							Eq_2 a0_170;
							word32 s2_547;
							word32 s7_548;
							word32 s1_545;
							word32 a1_546;
							aws_iot_mqtt_internal_wait_for_read(ra_164, s0_117, fp + -44, a3_112, a4_113, s10, mstatus, dwLoc4C, dwLoc38_434, dwArg14, dwArg28, dwArg68, dwArgB8, dwArgF8, out s0_117, out s1_545, out a0_170, out a1_546, out a3_112, out a4_113, out s2_547, out s3_120, out s4_121, out s7_548, out s10, out mstatus);
							s1_135 = a0_170;
							if (a0_170 != 0x00)
								goto l23050076;
							Eq_2 a0_204;
							word32 a5_550;
							word32 s5_551;
							word32 s1_549;
							s0_117 = _aws_iot_mqtt_deserialize_suback.constprop.0(fp + -58, fp + -48, fp + -56, a4_113, dwArgD8, out s1_549, out a0_204, out a1, out a3_112, out a4_113, out a5_550, out s2_219, out s3_120, out s4_121, out s5_551);
							s1_135 = a0_204;
							if (a0_204 != 0x00)
								goto l23050076;
						}
						s4_121 = (word32) s4_121 + 1;
						++s2_219;
					}
					s1_135.u0 = 0x00;
l23050076:
					ptr32 a0_248;
					ptr32 s1_256;
					word32 a2_532;
					word32 a3_533;
					word32 s4_535;
					word32 s2_534;
					aws_iot_mqtt_set_client_state(s1_135, s0_117, 0x03, a3_112, a4_113, s3_120, s4_121, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_256, out a0_248, out a1, out a2_532, out a3_533, out a4, out s2_534, out s3, out s4_535, out s5, out s6);
					a5_25 = a0_248;
					if (s1_256 != 0x00)
						a5_25 = s1_256;
				}
			}
		}
		s1Out = dwLoc4C;
		a0Out = a5_25;
		a1Out = a1;
		a3Out = s2;
		a4Out = a4;
		s3Out = s3;
		s4Out = dwArg0168;
		s5Out = s5;
		s6Out = s6;
		s10Out = s10;
		mstatusOut = mstatus;
		return dwLoc08;
	}
}

// 230500A2: Register Eq_2 aws_iot_mqtt_unsubscribe(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Register out (ptr32 Eq_259521) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      unsubscribeFromAcceptedAndRejected
//      subscribeToShadowActionAcks
Eq_2 aws_iot_mqtt_unsubscribe(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg010C, struct Eq_259521 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s5Out, union Eq_2 & s6Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x01;
		a2Out = a2;
		a3Out = a3;
		s2Out = s2;
		s5Out = s5;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 s2_351;
	ptr32 s5_35 = a2;
	ptr32 a5_365 = ~0x0C;
	s2_351 = s2;
	if (aws_iot_mqtt_is_client_connected(a0) != 0x00)
	{
		Eq_2 a0_40 = aws_iot_mqtt_get_client_state(a0);
		if (a0_40 != 0x03)
		{
			a4.u0 = 0x09;
			a5_365 = ~0x1D;
			s2_351 = s2;
			if (a0_40 != 0x09)
				goto l23050102;
		}
		Eq_2 s1_68;
		Eq_2 s5_76;
		word32 s6_742;
		word32 a1_739;
		word32 a2_740;
		word32 s2_741;
		Eq_2 s4_190;
		Eq_2 s3_200;
		Eq_2 a4_124;
		Eq_2 a3_123;
		Eq_2 a0_410;
		Eq_2 s0_109 = aws_iot_mqtt_set_client_state(s1, a0, 0x07, a3, a4, a1, a0_40, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_68, out a0_410, out a1_739, out a2_740, out a3_123, out a4_124, out s2_741, out s3_200, out s4_190, out s5_76, out s6_742);
		if (a0_410 != 0x00)
		{
			ptr32 a0_370;
			word32 s1_743;
			word32 a3_746;
			word32 a1_744;
			word32 a2_745;
			word32 s3_748;
			word32 s4_749;
			word32 a4_747;
			aws_iot_mqtt_set_client_state(s1_68, s0_109, s4_190, a3_123, a4_124, s3_200, s4_190, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_743, out a0_370, out a1_744, out a2_745, out a3_746, out a4_747, out s2_351, out s3_748, out s4_749, out s5_35, out s6);
			a5_365 = a0_370;
		}
		else
		{
			do
			{
				Eq_2 s1_126;
				word32 s1_88 = *a0_410;
				if (a0_410 != 0x00)
				{
					Eq_2 a1_92;
					word32 a5_751;
					word32 a2_750;
					a0_410 = strcmp(a0_410, s3_200, out a1_92, out a2_750, out a3_123, out a4_124, out a5_751);
					if (a0_410 == 0x00)
					{
						init_timer(fp + -60);
						word32 a2_752;
						s0_109 = countdown_ms(fp + -60, a1_92, out a2_752);
						Eq_2 s10_113 = *((word32) s0_109 + 52);
						Eq_2 a0_114 = aws_iot_mqtt_get_next_packet_id(s0_109);
						dwLoc48 = s0_109 + 64;
						s1_126.u0 = -33;
						if (s10_113 < aws_iot_mqtt_internal_get_final_packet_length_from_remaining_length((word32) s5_76 + 4, out a3_123, out a4_124))
							goto l23050136;
						Eq_2 a5_135;
						word32 a1_759;
						Eq_2 a0_132 = aws_iot_mqtt_internal_init_header(fp + -0x0044, (struct Eq_263391 *) 0x0A, 0x01, null, 0x00, out a1_759, out a3_123, out a4_124, out a5_135);
						s1_126 = a0_132;
						if (a0_132 != 0x00)
							goto l23050136;
						struct Eq_263413 * a5_150;
						word32 a4_763;
						word32 a1_761;
						word32 a5_760;
						word32 a3_762;
						Eq_2 a0_154 = a5_150 + aws_iot_mqtt_internal_write_len_to_buffer(aws_iot_mqtt_internal_write_char(0x00, a5_135, out a5_760), (word32) s5_76 + 4, out a1_761, out a3_762, out a4_763, out a5_150) / 5;
						struct Eq_263413 * a5_159;
						word32 a4_764;
						aws_iot_mqtt_internal_write_uint_16(a0_114, a5_150, out a4_764, out a5_159);
						ui32 a1_164;
						Eq_2 a4_166;
						Eq_2 a3_171;
						word32 s2_767;
						word32 a5_766;
						word32 a0_765;
						aws_iot_mqtt_internal_write_utf8_string(s3_200, s5_76, a5_159, dwLoc18, out a0_765, out a1_164, out a3_171, out a4_166, out a5_766, out s2_767);
						dwLoc48 = a0_154;
						word24 nLoc48_456 = (word24) a0_154;
						Eq_2 a0_186;
						word32 a2_770;
						word32 a1_769;
						word32 s1_768;
						word32 s2_771;
						word32 s5_772;
						word32 s6_773;
						word32 ra_210 = aws_iot_mqtt_internal_send_packet(ra, s0_109, a1_164 - (s0_109 + 64), fp + -60, a3_171, a4_166, mstatus, dwArg04, dwArg78, dwArgB8, dwArgD8, out s0_109, out s1_768, out a0_186, out a1_769, out a2_770, out a3_123, out a4_124, out s2_771, out s3_200, out s4_190, out s5_772, out s6_773, out mstatus);
						s1_126 = a0_186;
						if (a0_186 != 0x00)
							goto l23050136;
						Eq_2 a0_215;
						word32 s2_776;
						word32 s7_777;
						word32 s10_778;
						word32 s1_774;
						word32 a1_775;
						aws_iot_mqtt_internal_wait_for_read(ra_210, s0_109, fp + -60, a3_123, a4_124, s10_113, mstatus, dwLoc4C, s6, dwArg14, dwArg28, dwArg68, dwArgB8, dwArgF8, out s0_109, out s1_774, out a0_215, out a1_775, out a3_123, out a4_124, out s2_776, out s3_200, out s4_190, out s7_777, out s10_778, out mstatus);
						s1_126 = a0_215;
						if (a0_215 != 0x00)
							goto l23050136;
						Eq_2 a0_251;
						struct Eq_265796 * s8_255;
						word32 s1_779;
						struct Eq_265796 * s2_264;
						s0_109 = aws_iot_mqtt_internal_deserialize_ack(fp + -69, fp + -0x0044, fp + -64, (word32) *((word32) a4_124 + 56) + 576, a4_124, out s1_779, out a0_251, out a3_123, out a4_124, out s2_264, out s4_190, out s8_255);
						s1_126 = a0_251;
						if (a0_251 != 0x00)
							goto l23050136;
						a4_124.u0 = 0x00;
						dwLoc48 = (uint32) nLoc48_456;
						if (true)
							break;
						do
						{
							Eq_2 a0_272 = s2_264->dw0000;
							if (a0_272 != 0x00)
							{
								word32 a1_780;
								word32 a2_781;
								word32 a5_782;
								if (strcmp(a0_272, s3_200, out a1_780, out a2_781, out a3_123, out a4_124, out a5_782) == 0x00)
									s2_264->dw0000 = 0x00;
							}
							++s2_264;
						} while (s2_264 != s8_255);
						goto l23050136;
					}
				}
			} while (s1_88 + 0x10 != (word32) s0_109 + 0x04D8);
			s1_126.u0 = ~0x00;
l23050136:
			ptr32 a0_342;
			ptr32 s1_350;
			word32 a2_754;
			word32 a1_753;
			word32 a3_755;
			word32 s3_757;
			word32 a4_756;
			word32 s4_758;
			aws_iot_mqtt_set_client_state(s1_126, s0_109, s4_190, a3_123, a4_124, s3_200, s4_190, mstatus, dwLoc48, dwArg88, dwArgC8, dwArg0108, out s1_350, out a0_342, out a1_753, out a2_754, out a3_755, out a4_756, out s2_351, out s3_757, out s4_758, out s5_35, out s6);
			a5_365 = a0_342;
			if (s1_350 != 0x00)
				a5_365 = s1_350;
		}
	}
l23050102:
	0x00 = (uint16) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a5_365;
	a2Out = dwArg01A8;
	a3Out = s2;
	s2Out = s2_351;
	s5Out = s5_35;
	s6Out = s6;
	mstatusOut = mstatus;
	return dwLoc08;
}

