pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0004.c
// 23050228: Register Eq_2 _aws_iot_mqtt_handle_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_265864) s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_mqtt_yield
Eq_2 _aws_iot_mqtt_handle_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0138, struct Eq_265864 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 s0_100 = a0;
	word32 a0_17;
	word32 a2_217;
	word32 a5_218;
	ptr32 a4_110;
	ptr32 a3_111;
	ptr32 mstatus_109;
	struct Eq_265864 * s1_106;
	ptr32 s2_129;
	ptr32 s3_108;
	ptr32 s4_107;
	ptr32 s5_130;
	ptr32 s6_131;
	Eq_2 ra_105 = aws_iot_mqtt_disconnect(ra, a0, a3, a4, s3, s4, mstatus, dwArg14, dwArg24, dwArg88, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0138, out s1_106, out a0_17, out a2_217, out a3_111, out a4_110, out a5_218, out s2_129, out s3_108, out s4_107, out s5_130, out s6_131, out mstatus_109);
	if (a0_17 != 0x00)
	{
		((word32) a0 + 24)->u1 = 11;
		<anonymous> * a5_43 = *((word32) a0 + 0x04EC);
		struct Eq_265919 * s0_47;
		word32 ra_48;
		word32 s1_49;
		word32 s4_55;
		word32 s3_56;
		word32 mstatus_57;
		word32 a4_58;
		word32 a3_59;
		a5_43();
		s0_47->ptr04F4();
	}
	<anonymous> * a5_102 = *((word32) s0_100 + 0x04D8);
	if (a5_102 != null)
		a5_102();
	((word32) s0_100 + 24)->u1 = 11;
	s1Out = s1_106;
	a0Out = ~0x0C;
	a2Out = dwArg10;
	a3Out = a3_111;
	a4Out = a4_110;
	s2Out = s2_129;
	s3Out = s3_108;
	s4Out = s4_107;
	s5Out = s5_130;
	s6Out = s6_131;
	mstatusOut = mstatus_109;
	return ra_105;
}

// 23050272: Register Eq_2 aws_iot_mqtt_yield(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      aws_iot_shadow_yield
Eq_2 aws_iot_mqtt_yield(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0118, word32 dwArg0198, ptr32 & s0Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	struct Eq_265936 * sp_3 = fp + -64;
	Eq_2 s0_124 = ~0x01;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a0_25 = aws_iot_mqtt_get_client_state(a0);
		Eq_2 s1_101 = a0;
		s2 = a1;
		s3 = a0_25;
		s0_124.u0 = 0x05;
		if (a0_25 == 0x0C)
			goto l23050340;
		if (a0_25 == 0x0D)
		{
l230502A2:
			init_timer(fp + -56);
			Eq_2 a2_317;
			countdown_ms(fp + -56, s2, out a2_317);
			Eq_2 s4_102 = (word32) s1_101 + 0x0C;
			struct Eq_263957 * s5_103 = (word32) s1_101 + 64;
			s3.u0 = 0x1F000400;
			word32 s6_116 = (word32) s1_101 + 0x04E0;
			do
			{
				Eq_2 a2_110;
				if (aws_iot_mqtt_get_client_state(s1_101) == 0x0D)
				{
					s1_101 = *(union Eq_2 *) 0x39;
					if (s3 < 0x0D)
					{
						s0_124.u0 = ~0x0D;
						goto l2305042E;
					}
					word32 a0_318;
					word32 s2_322;
					word32 a5_844;
					word32 s8_845;
					struct Eq_266062 * a1_324;
					Eq_2 s3_328;
					Eq_2 s4_329;
					Eq_2 s1_321 = has_timer_expired(a2_317, a3, a4, mstatus, sp_3->t0014, sp_3->t0018, sp_3->t0038, sp_3->t0128, sp_3->t0168, out a0_318, out a1_324, out a2_110, out a3, out a4, out a5_844, out s2_322, out s3_328, out s4_329, out s8_845);
					s0_124.u0 = 0x04;
					if (a0_318 == 0x00)
						goto l2305030E;
					Eq_2 s2_334;
					Eq_2 s10_364;
					<anonymous> * a5_333 = *((word32) s1_321 + 0x04F0);
					if (a5_333 != null)
					{
						Eq_2 s0_339;
						Eq_2 s1_341;
						Eq_2 a0_347;
						word32 a7_358;
						word32 t0_359;
						word32 t1_360;
						word32 t4_361;
						word32 t5_362;
						word32 t6_363;
						word32 s9_365;
						word32 s7_366;
						word32 s11_574;
						a5_333();
						s2_334 = a0_347;
						s10 = s10_364;
						if (a0_347 != 0x06)
							goto l23050358;
						Eq_2 a0_370;
						Eq_2 s1_380;
						ra = aws_iot_mqtt_attempt_reconnect(ra, s0_339, s1_341, s1_341, a3, a4, s3_328, s4_329, mstatus, sp_3->t0004, sp_3->t0018, sp_3->t0058, sp_3->t0068, sp_3->t006C, sp_3->t0078, sp_3->t0088, sp_3->t00A8, sp_3->t00B8, sp_3->t00C8, sp_3->t00E8, sp_3->t00F8, sp_3->t0108, sp_3->t0148, out s1_380, out a0_370, out a1_324, out a2_110, out a3, out a4, out s3_328, out s4_329, out s5_103, out s6_116, out s10, out mstatus);
						s2_334 = a0_370;
						if (a0_370 != 0x03)
							goto l23050358;
						Eq_2 a0_420;
						word32 s1_849;
						word32 s4_853;
						word32 a1_850;
						word32 s2_851;
						word32 s3_852;
						aws_iot_mqtt_set_client_state(s1_380, s1_380, 0x04, a3, a4, s3_328, s4_329, mstatus, sp_3->t0008, sp_3->t00D8, sp_3->t0118, sp_3->t0158, out s1_849, out a0_420, out a1_850, out a2_110, out a3, out a4, out s2_851, out s3_852, out s4_853, out s5_103, out s6_116);
						s0_124 = a0_420;
						if (a0_420 == 0x00)
							s0_124.u0 = 0x03;
					}
					else
					{
						s2_334.u0 = ~0x11;
l23050358:
						Eq_2 a1_404 = a1_324 << 1;
						*((word32) a1_404 + 44) = a1_324->t002C;
						s0_124.u0 = ~0x0D;
						if (s3_328 >= a1_404)
						{
							countdown_ms(s4_329, a1_404, out a2_110);
							s0_124 = s2_334;
						}
					}
					goto l2305030E;
				}
				Eq_2 a0_96;
				word32 s7_843;
				word32 a1_842;
				word32 s0_841;
				ra = aws_iot_mqtt_internal_cycle_read(ra, s1_101, &sp_3->t0008, (char *) sp_3 + 3, a3, a4, s2, s10, mstatus, sp_3->t0024, sp_3->t0084, sp_3->t0098, sp_3->t00D8, out s0_841, out s1_101, out a0_96, out a1_842, out a2_110, out a3, out a4, out s2, out s3, out s4_102, out s5_103, out s6_116, out s7_843, out s10, out mstatus);
				s0_124 = a0_96;
				if (a0_96 == 0x00)
				{
					if ((word32) *((word32) s1_101 + 40) == 0x00)
						goto l2305030E;
					word32 a0_133;
					Eq_2 a1_139;
					word32 a5_861;
					word32 s2_862;
					word32 s8_863;
					s1_101 = has_timer_expired(a2_110, a3, a4, mstatus, sp_3->t0014, sp_3->t0018, sp_3->t0038, sp_3->t0128, sp_3->t0168, out a0_133, out a1_139, out a2_110, out a3, out a4, out a5_861, out s2_862, out s3, out s4_102, out s8_863);
					if (a0_133 == 0x00)
						goto l2305030E;
					if ((word32) *((word32) s1_101 + 25) != 0x00)
						goto l23050392;
					init_timer(&sp_3->t0014);
					word32 a2_864;
					countdown_ms(&sp_3->t0014, a1_139, out a2_864);
					sp_3->dw0080 = 0x00;
					Eq_2 a0_162;
					Eq_2 a1_169;
					aws_iot_mqtt_internal_serialize_zero(s5_103, a1_139, (struct Eq_263391 *) 0x0C, &sp_3->t0004, out s1_101, out a0_162, out a1_169, out a2_110, out a3, out a4, out s2, out s4_102);
					s0_124 = a0_162;
					if (a0_162 != 0x00)
						goto l2305039A;
					word32 a0_179;
					word32 a1_868;
					word32 a2_869;
					word32 s2_870;
					word32 s0_867;
					ra = aws_iot_mqtt_internal_send_packet(ra, s1_101, a1_169, &sp_3->t0014, a3, a4, mstatus, sp_3->t0054, sp_3->t00C8, sp_3->t0108, sp_3->t0128, out s0_867, out s1_101, out a0_179, out a1_868, out a2_869, out a3, out a4, out s2_870, out s3, out s4_102, out s5_103, out s6_116, out mstatus);
					if (a0_179 != 0x00)
						goto l23050392;
					up32 a1_205 = (word32) *((word32) s1_101 + 40);
					*((word32) s1_101 + 25) = 0x01;
					word32 s1_871;
					word32 a1_872;
					s0_124 = countdown_sec(ra, s1_101, a1_205, a3, sp_3->t0018, sp_3->t0060, sp_3->t0064, sp_3->t0088, sp_3->t00AC, out s1_871, out a1_872, out a2_110);
					goto l2305030E;
				}
				a4.u0 = ~0x0B;
				if ((int32) (byte) (a0_96 & -3) != ~0x0B && a0_96 != ~0x06)
				{
					if (a0_96 != ~0x0C)
						goto l2305042E;
					goto l230503A0;
				}
l23050392:
				Eq_2 a0_228;
				ra = _aws_iot_mqtt_handle_disconnect(ra, s1_101, a3, a4, s3, s4_102, mstatus, sp_3->t0014, sp_3->t0024, sp_3->t0088, sp_3->t00B8, sp_3->t00C8, sp_3->t00E8, sp_3->t00F8, sp_3->t0138, out s1_101, out a0_228, out a2_110, out a3, out a4, out s2, out s3, out s4_102, out s5_103, out s6_116, out mstatus);
				s0_124 = a0_228;
l2305039A:
				if (s0_124 == ~0x0C)
				{
l230503A0:
					Eq_2 s1_258 = *(union Eq_2 *) 0x23;
					*(union Eq_2 *) 0x24 = s1_258;
					if ((word32) *((word32) s1_258 + 26) == 0x00)
						goto l23050326;
					Eq_2 a0_277;
					word32 a2_866;
					word32 a1_865;
					aws_iot_mqtt_set_client_state(s1_258, s1_258, 0x0D, a3, a4, s3, s4_102, mstatus, sp_3->t0008, sp_3->t00D8, sp_3->t0118, sp_3->t0158, out s1_101, out a0_277, out a1_865, out a2_866, out a3, out a4, out s2, out s3, out s4_102, out s5_103, out s6_116);
					s0_124 = a0_277;
					if (a0_277 != 0x00)
						break;
					*(union Eq_2 *) 0x0414 = s1_101;
					countdown_ms(s4_102, 1000, out a2_110);
					s0_124.u0 = 0x04;
				}
				else if (s0_124 != 0x00)
					goto l2305042E;
l2305030E:
				word32 a0_458;
				word32 a1_846;
				word32 a5_847;
				word32 s8_848;
				s1_101 = has_timer_expired(a2_110, a3, a4, mstatus, sp_3->t0014, sp_3->t0018, sp_3->t0038, sp_3->t0128, sp_3->t0168, out a0_458, out a1_846, out a2_317, out a3, out a4, out a5_847, out s2, out s3, out s4_102, out s8_848);
			} while (a0_458 == 0x00);
			if (s0_124 != ~0x0C)
			{
l2305042E:
				if (s0_124 != 0x04)
				{
					Eq_2 a0_498;
					word32 a1_855;
					word32 a4_857;
					word32 s4_858;
					word32 s5_859;
					word32 s6_860;
					word32 a2_856;
					word32 s1_854;
					s0_124 = aws_iot_mqtt_set_client_state(s1_101, s1_101, 0x03, a3, a4, s3, s4_102, mstatus, sp_3->t0008, sp_3->t00D8, sp_3->t0118, sp_3->t0158, out s1_854, out a0_498, out a1_855, out a2_856, out a3, out a4_857, out s2, out s3, out s4_858, out s5_859, out s6_860);
					if (s0_124 == 0x00)
						s0_124 = a0_498;
				}
				goto l23050340;
			}
l23050326:
			s0_124.u0 = ~0x0C;
			goto l23050340;
		}
		if (aws_iot_mqtt_is_client_connected(a0) == 0x00)
			goto l23050326;
		s0_124.u0 = ~0x1D;
		if (a0_25 == 0x03)
		{
			Eq_2 a0_40;
			word32 s6_877;
			word32 s5_876;
			word32 s4_875;
			word32 a1_873;
			word32 a2_874;
			aws_iot_mqtt_set_client_state(a0, a0, 0x04, a3, a4, a0_25, s4, mstatus, dwLoc38, dwArg98, dwArgD8, dwArg0118, out s1_101, out a0_40, out a1_873, out a2_874, out a3, out a4, out s2, out s3, out s4_875, out s5_876, out s6_877);
			s0_124 = a0_40;
			if (a0_40 == 0x00)
				goto l230502A2;
		}
	}
l23050340:
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	a0Out = s0_124;
	a2Out = dwArg0138;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s10Out = s10;
	mstatusOut = mstatus;
	return ra;
}

